[
 {
  "major": "Alkalmazott nyelvtudományok és kommunikáció",
  "year": 2013,
  "title": "Néhány háromszéki nyelvjárási jelenség diakrón vizsgálata",
  "students": [
    {
      "name": "Both Csaba Attila",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Gál F. Noémi",
      "university": ""
    }
  ],
  "content": "Dolgozatom célja feltérképezni, hogy milyen nyelvjárási sajátosságok éltek a háromszéki dialektusban (négy település esetében: Bölön, Sepsiköröspatak, Dálnok és Zágon falvak esetében) ötven-hatvan évvel ezelőtt a Romániai Magyar Nyelvjárások Atlasza anyagának gyűjtése idején, illetve a 2013-ban, a fent említett településeken végzett újragyűjtés adatainak feldolgozása és eredményeinek leírása, valamint a két gyűjtés eredményei közt mutatkozó különbségek feltárása fonetikai-fonológiai, illetve lexikológiai-szemantikai szempontból. Mind az RMNyA adatait, mind a 2013-ban készült gyűjtés adatait a Dr. Vékás Domokos és Dr. Vargha Fruzsina Sára fejlesztette BihalBocs nevű számítógépes nyelvföldrajzi szoftverrel dolgoztam fel, így a tanulmány elkészítése során a már digitalizált Székely Nyelvföldrajzi Szótár, Magyar Nyelvjárási Atlasz adataihoz is hozzáférhettem, így kapva még teljesebb képet a magyar nyelvjárások kapcsolatairól, közös elemeiről. Napjainkban ismét ébredezik az igény a nyelvjárások identitáshordozó minőségének felkutatására, elemzésére, esetenként revitalizációs tevékenységek működtetésére. Így dolgozatom egy nagyobb lélegzetvételű kutatás „előkutatásának” is tekinthető. A vizsgált jelenségekből arra lehet következtetni, hogy a nyelvjárás folyamatos mozgásban, kölcsönhatásban áll a szomszédos nyelvjárásokkal, a magyar és a regionális sztenderddel, így változások figyelhetőek meg mind hangtani, mint lexikológiai-szemantikai szinten.",
  "keywords": [
    "dialektológia",
    "Háromszék",
    "nyelvjárás",
    "Bihalbocs",
    "beszélt nyelv",
    "fonéma",
    "lexéma"
  ],
  "generated_keywords": [
    "nyelvjáráskutatás",
    "nyelvi változás",
    "adatgyűjtés"
  ]
},
 {
  "major": "Alkalmazott nyelvtudományok és kommunikáció",
  "year": 2013,
  "title": "Translating Humour across Cultures in Film Dubbing – “The Big Bang Theory”, a Case Study",
  "students": [
    {
      "name": "Horváth Attila Zoltán",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Gál F. Noémi",
      "university": ""
    }
  ],
  "content": "In my project I study the translation of humour across cultures and the history of dubbing in Romania and Hungary. In this case study I examine the Hungarian dubbing and Romanian subtitling of the popular American sitcom “The Big Bang Theory”, with a special regard to the strategies of translation of the verbally expressed humour. When necessary, I provide alternative translation solutions on both target languages.",
  "keywords": [
    "translating humour",
    "culture",
    "film dubbing",
    "The Big Bang Theory",
    "case study"
  ],
  "generated_keywords": [
    "kulturális fordítás",
    "humorértelmezés",
    "sorozatfordítás"
  ]
},
{
  "major": "Alkalmazott nyelvtudományok és kommunikáció",
  "year": 2013,
  "title": "Deiktikus elemek a politikai diskurzusokban",
  "students": [
    {
      "name": "Dézsi Renáta",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Suba Réka",
      "university": ""
    }
  ],
  "content": "Dolgozatomban erdélyi magyar politikusok diskurzusainak deiktikus elemeit tárgyalom. A politika tágabb meghatározásától kiindulva kitérek a politikai kommunikáció sajátosságaira. Ezt követve a deixis fogalmát és annak formáit mutatom be. Ezeket illusztrálva, két erdélyi magyar politikus két-két beszédét elemzem, annak érdekében, hogy nyilvánvalóbbá váljon, miként alkalmazzák a deiktikus elemeket a meggyőzés művészetében.",
  "keywords": [
    "deixis",
    "politikai diskurzus"
  ],
  "generated_keywords": [
    "diskurzuselemzés",
    "politikai kommunikáció",
    "nyelvi hatásmechanizmus"
  ]
},
{
  "major": "Alkalmazott nyelvtudományok és kommunikáció",
  "year": 2013,
  "title": "Translating cosmetic products",
  "students": [
    {
      "name": "Péter Orsolya",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Nagy Imola",
      "university": ""
    }
  ],
  "content": "In my dissertation I would like to show the importance of translation from the very beginning until the present day, its development, and the difficulties translators have to face even today. By highlighting the importance of translation I would like to emphasize how important it is to translate product information in the domain of cosmetics. I also attempt to cover issues such as the definition and historical aspects of cosmetic products, what cosmetics are, what they are used for, how the European Union and the United Kingdom regulate the cosmetic market, what regularizations they introduced regarding product information.",
  "keywords": [
    "Translation",
    "translation difficulties",
    "global language",
    "cosmetic products"
  ],
  "generated_keywords": [
    "kozmetikai fordítás",
    "termékinformáció",
    "szabályozás"
  ]
},
{
  "major": "Alkalmazott nyelvtudományok és kommunikáció",
  "year": 2013,
  "title": "‘The Grund’ – the playground of realia Translation of culture-specific words in the novel ‘The Paul Street boys’ by Ferenc Molnár",
  "students": [
    {
      "name": "Varga Barna",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Sárosi-Márdirosz Krisztina",
      "university": ""
    }
  ],
  "content": "One of my favourite Hungarian youth novels – which I read when I was a child – is ‘The Paul Street boys’ by Ferenc Molnár. While presenting the story the author uses many culture-specific words (realia) which are words or expressions (mainly nouns) denoting different characteristic elements of a culture such as foods, institutions, arts, etc. This is the reason why I have chosen this novel and its English and Romanian translation. I decided to analyse culture-specific words because it is very difficult to translate these elements due to the cultural and language differences. In the theoretical part of my project I have defined the concept of realia and I have presented the taxonomy of culture-specific words. Moreover, because of culture-specific words, the problem of untranslatability often occurs and therefore I have described 13 translation techniques which can be useful while translating realia. In the practical part I gathered all the culture-specific words from the novel and I matched them with their English and Romanian translations. Finally I identified 3x96 culture-specific words (288) which I inserted into a database. Using this database I started to analyse every realia one by one offering comments about how it was translated. When I finished this I created the list of strategies used during the translation process and I counted how frequently each strategy was used. These results offered me the required data to draw the conclusions which were very surprising. In many cases the translation of realia was carried out by using its target language equivalent which justifies the theory of globalization. Besides this the most frequently used strategies were: generalisation, cultural substitution and explicitation. On the other hand, thanks to the examples, I managed to find out which are the advantages and disadvantages of each translation strategy. All in all I hope that my research will be useful for every future translator and terminologist who deals with the translation of culture-specific words.",
  "keywords": [
    "‘The Grund’ – the playground of realia Translation of culture-specific words in the novel ‘The Paul street boys’ by Ferenc Molnár"
  ],
  "generated_keywords": [
    "reáliák fordítása",
    "kultúraspecifikus kifejezések",
    "fordítási stratégiák"
  ]
},
{
  "major": "Alkalmazott nyelvtudományok és kommunikáció",
  "year": 2013,
  "title": "Cognitive Aspects of Translation with a Special Regard to Word Associations",
  "students": [
    {
      "name": "Gegő Kadocsa",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Gál F. Noémi",
      "university": ""
    }
  ],
  "content": "My work is based on a type of speech act that is used on everyday basis by almost anyone, but little research is done to understand this highly complicated phenomenon. This is swearing. In order to understand swearing and its effects we have to move away from the field of linguistics and look into culture, society, behaviour, beliefs, taboos and trends. As Gandhi said: “The one contains the many and the many contains the one”. This quote stands perfectly for the understanding of swearing and it also gives good points of view to analyse the whole language as a tool of fulfilling our intentions. Moreover swearwords are difficult to translate in some cases and in extreme cases the translator has to make moral decisions about the translation of a respective swearing because of the cultural differences between two nations.",
  "keywords": [
    "Swearwords",
    "taboo",
    "personality",
    "education"
  ],
  "generated_keywords": [
    "szitokszavak fordítása",
    "kultúraközi különbségek",
    "tabusítás a nyelvben"
  ]
},
{
  "major": "Alkalmazott nyelvtudományok és kommunikáció",
  "year": 2013,
  "title": "Lexical Transfer Operations in Cartoon Dubbing",
  "students": [
    {
      "name": "Kovács Kinga",
      "major": ""
    },
    {
      "name": "Magyarosi Júlia",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Gál F. Noémi",
      "university": ""
    }
  ],
  "content": "Our study analyses the Hungarian dubbing of two English Disney cartoons from the point of view of Klaudy Kinga’s Lexical Transfer Operations. After a short introductory part we offer a detailed presentation of our research. Although in the past decade the audiences’ taste has changed, Hungary is still dubbing, which means that in the country a nationalistic system dominates. Based on our research we can conclude that total transformation is the most frequent LTO used in cartoon dubbing.",
  "keywords": [
    "dubbing",
    "subtitling",
    "cartoon",
    "LTO",
    "Hungary"
  ],
  "generated_keywords": [
    "rajzfilmek fordítása",
    "lexikai transzfer",
    "szinkrontechnika"
  ]
},
{
  "major": "Alkalmazott nyelvtudományok és kommunikáció",
  "year": 2013,
  "title": "Translating culture specific words - the case of tourism in Szeklerland",
  "students": [
    {
      "name": "Borsos Ágota",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Gál F. Noémi",
      "university": ""
    }
  ],
  "content": "My study analyses the translation of realia of some touristic webpages about the Szeklerland. I write about the characteristics of realia and about the most common difficulties the translators need to face when translating them, and I also mention the examples I have found on the websites. My opinion is that these webpages are the main instrument to appeal to tourists and hereby they are essential for improving the tourism in our region. Based on my research I conclude that in most cases the translated websites features greatly lack high standards and preciseness, and there is not a definite glossary which would help resolving these translation problems.",
  "keywords": [
    "realia",
    "webpage",
    "Szeklerland",
    "tourism"
  ],
  "generated_keywords": [
    "turisztikai fordítás",
    "honlapnyelv",
    "fordítási hibák"
  ]
},
{
  "major": "Alkalmazott nyelvtudományok és kommunikáció",
  "year": 2013,
  "title": "A játékbirodalom sötét oldala. Minimax reklámok elemzése.",
  "students": [
    {
      "name": "Fazekas Blanka-Petra",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Tőkés Gyöngyvér",
      "university": ""
    }
  ],
  "content": "A dolgozat témája a reklámipar legnagyobb vitákat generáló területe: a gyermekeknek készült reklámok. Kutatói munkám célja a gyermekreklámokban alkalmazott manipulatív eszközök feltárása. Empirikus anyagként a Minimax csatornán közvetített gyermekreklámokat használtam. A gyermekeknek létrehozott televíziós csatornákon az ártatlan dalok, a vidáman ugrándozó mesefigurák álarca mögött gigantikus marketingfogások állnak, amelyek napjainkban egyre nagyobb számban szedik áldozataikat. Témám érdekessége a tárgyalása kapcsán felmerülő ellentmondásban rejlik. A gyermekek a legvédtelenebbek a marketingfogásokkal szemben, mivel szellemi fejlettségi szintjük miatt nem tudnak az őket érő támadások ellen védekezni. Fel sem ismerik a csapdát. Ezzel egy időben őket bombázzák a legnagyobb mértékben reklámokkal. Ennek a támadásnak az eszközeit, kivitelezéseit vizsgálom.",
  "keywords": [
    "gyermekreklám",
    "televízió",
    "marketing",
    "reklámelemzés"
  ],
  "generated_keywords": [
    "gyermekpszichológia",
    "vizuális manipuláció",
    "reklámkritika"
  ]
},
{
  "major": "Alkalmazott nyelvtudományok és kommunikáció",
  "year": 2013,
  "title": "Könyvmúzeum vagy élő könyvtár? A Teleki Téka múltja, jelene, jövője",
  "students": [
    {
      "name": "Molnár Beáta",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Tőkés Gyöngyvér",
      "university": ""
    }
  ],
  "content": "Marosvásárhelyen számos olyan épület, intézmény található, amely évszázadokkal, évtizedekkel ezelőtt Európa-szerte rangos és kitüntetett szerepnek örvendett. A Teleki Téka egyben enciklopédikus tudománytár és bibliofil ritkaságok őrzője, ugyanakkor az európai könyvkultúra egyik leggazdagabb gyűjtőhelyének számít ma is. Magyar nyelvterületen az egyik első nyilvános, közkönyvtárként nyílt meg 1802-ben, azóta megszakítás nélkül működik. Alapítója, gróf széki Teleki Sámuel (1739–1822) korának egyik legképzettebb bibliofilja volt. Gyűjteményét kezdettől fogva közkönyvtárnak szánta, és haláláig a könyvtár gyarapításán dolgozott. Szoros kapcsolata volt az európai nyomdákkal, kiadókkal, így sikerült megvásárolnia a könyvnyomtatás kezdeteitől a 19. század elejéig kiadott legjelentősebb munkák nagy részét. Teleki Sámuel végrendeletében kötelezte örököseit a könyvtár továbbműködtetésére. Végrendeletének értelmében a könyvtár ma is működik, bár részben átalakult, az idő múlásával múzeummá (is) vált. Dolgozatom célja bemutatni a Teleki Téka múltban betöltött kulturális és közösségszervező funkcióját, rávilágítani a jelenben felvállalt (átalakult) szerepére. Ezen kívül pedig olyan rendezvények, performanszok, intézkedések ajánlása, amelyek segítségével közvetlenebb viszonyt tudna kialakítani a XXI. századi látogatóival/közönségével. Van-e áthidalás a múlt, jelen és jövő között, aktuális tud-e lenni a ma emberének e barokk könyvtár, és hogyan válhat könyvmúzeumból élő könyvtárrá a Teleki Téka?",
  "keywords": [
    "Teleki Téka",
    "kulthely",
    "kommunikáció"
  ],
  "generated_keywords": [
    "könyvtártörténet",
    "kulturális örökség",
    "közösségépítés"
  ]
},
{
  "major": "Alkalmazott nyelvtudományok és kommunikáció",
  "year": 2013,
  "title": "Lexical Transfer Operations and taboo expressions in J. D. Salinger’s novel, The Catcher in the Rye",
  "students": [
    {
      "name": "Ferenczi Éva-Rebeka",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Imre Attila",
      "university": ""
    }
  ],
  "content": "The theory of the project consists of two main parts: theoretical background of translation, taboo and slang. I defined the concept of translation (process of translation, problems in the process of translation), taboo and slang, and I enumerated the lexical transfer operations. In the practical part I examined the frequency of taboo usage in J.D. Salinger’s greatest novel, The Catcher in the Rye. Regarding this matter, I analysed how Hungarian and Romanian translators confronted this task. The Hungarian version of the novel was translated by Judit Gyepes and the Romanian translation by Catinca Ralea and Lucian Bratu. There is only one translation in Hungarian, but there have been several attempts to translate it into Romanian. Mainly I shall deal with the first translation. Moreover, I will compare the first Romanian translation with the newest one in order to observe any changes regarding taboo, by the passing of time. I chose the first translation that was published in 1964, because it is closer in year to the Hungarian translation, which was published in 1968 and it is also close to the publication of the original. I assumed that the newer translation would contain more taboo words, but so far, in the process of practice I realized it isn’t quite so. Also, I assume that the Romanian translations are more prude than the Hungarian one.",
  "keywords": [
    "theoretical background of translation",
    "LTO",
    "taboo",
    "slang",
    "The Catcher in the Rye",
    "word frequency"
  ],
  "generated_keywords": [
    "irodalmi fordítás",
    "tabuszavak elemzése",
    "kultúraközi összehasonlítás"
  ]
},
{
  "major": "Agrártudományok",
  "year": 2013,
  "title": "Fekete nyár rügy kivonat hatása a Phytophthora infestans ellen",
  "students": [
    {
      "name": "Turóczi Botond",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Bálint János",
      "university": ""
    },
    {
      "name": "Dr. Balog Adalbert",
      "university": ""
    },
    {
      "name": "Dr. Máthé István",
      "university": ""
    }
  ],
  "content": "A Solanaceae családba tartozó termesztett növények egyik legjelentősebb kórokozója az írországi burgonyavészt okozó Phytophthora infestans oospórás gomba. Újabb kutatások rávilágítottak arra, hogy a kórokozó igen nagy genomjának jelentős része ismétlődő DNS-szakaszokkal van tele. Ezek gyorsan átalakulnak, így teszik lehetővé a gének gyors alkalmazkodását a megtámadott növény ellenállásának legyőzésére, továbbá a rezisztencia kialakulását a különböző növényvédőszerek ellen. A kórokozó ellen igen nehézkes a védekezés, ezért szükséges alternatív lehetőségek kutatása. A kísérlet célja megvizsgálni a fekete nyár rügy (Gemmae populi nigri) kivonatának hatását a fitoftórára in vitro és in vivo körülmények között. Amennyiben gátló hatást észlelünk, igyekeztünk megállapítani azt a legkisebb koncentrációt, ahol még a befolyás érvényesül. A laboratóriumi vizsgálatokat a Sapientia-EMTE Biomérnöki Tanszékén végeztük mérgezett agarlemez módszerrel. Három koncentrációt vizsgáltunk, 1,3%-os, illetve 6%-os töménységű mérgezett agaron figyeltük a kórokozó fejlődését. Már az 1%-os koncentrációnál gátló hatás mutatkozott, a 3%-os és 6%-os agaron egyáltalán nem fejlődött a Phytophthora infestans. Az in vivo kísérlethez a burgonyát választottuk, a vizsgálatokat Kézdivásárhely mellett Nyújtódon állítottuk be. 12 ár területen 100 m²-es kisparcellákat alakítottunk ki, és random elhelyezésben négyet hagyományos növényvédőszerrel, négyet 1%-os fekete nyár rügy kivonattal kezeltünk.",
  "keywords": [
    "Phytophthora infestans"
  ],
  "generated_keywords": [
    "növényvédelem",
    "természetes kivonat",
    "biológiai védekezés"
  ]
},
{
  "major": "Agrártudományok",
  "year": 2013,
  "title": "Vadrózsatípusok változatosságának vizsgálata pomológiai és beltartalmi szempontok alapján",
  "students": [
    {
      "name": "Sztojka Bernadette",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Thiesz Rezső",
      "university": ""
    },
    {
      "name": "drd. Bandi Attila",
      "university": ""
    }
  ],
  "content": "A csipkerózsa a Kárpát-medence vad növényállományából a legnagyobb táplálkozási értékkel bír. Ez a faj kulcsszerepet tölthet be a fenntartható gyümölcstermesztésben, értékes megoldással szolgálva a gazdasági, szociális és környezeti problémákra. A vizsgálat tárgyát képező állomány a Kászoni-medencében található. Kutatásunk során több mint 90 típus értékelését végeztük el. A terepi felmérések során különös figyelmet fordítottunk a termőbokrok növekedési erejére, habitusára, termésberakódottságára. A laboratóriumi vizsgálatok során meghatároztuk a gyümölcsminták morfológiai és biokémiai tulajdonságait. A gyümölcsmorfológiai tulajdonságok közül elemeztük a bogyó tömegét, hosszát, átmérőjét, húsvastagságát, az aszmagok számát és a gyümölcshús-arányt. A beltartalmi mérések alkalmával meghatároztuk az összsavtartalmat, a vízoldható szárazanyag-tartalmat, az összcukortartalmat, a cukor-sav arányt és a C-vitamin tartalmat. A vizsgált állományban 14 szelekciónak 1,90 g feletti a bogyótömege, az áltermések hossza 15 típus esetében meghaladja a 21 mm-t, míg 16 típus átmérője 14 mm feletti. Gyümölcshús-arány tekintetében az egyedek több mint fele 65% fölötti értékkel rendelkezik. Többségében igen magas az egyedek gyümölcseinek oldható szárazanyag-tartalma, melyhez szinte minden esetben magas összsavtartalom társul. A kiemelkedő gyümölcsminőségi tulajdonságokkal rendelkező egyedek széles skálán változó C-vitamin tartalommal rendelkeznek, mely 34 és 5301 mg% között változott. Eredményeink alapján a Kászoni-medence csipkerózsa-populációit nagyfokú variabilitás jellemzi, mely lehetővé teszi magas biológiai értékkel rendelkező egyedek szelekcióját.",
  "keywords": [
    "Rosa canina L.",
    "populáció",
    "szelekció",
    "C-vitamin"
  ],
  "generated_keywords": [
    "pomológiai vizsgálat",
    "gyümölcsminőség",
    "vadgyümölcs szelekció"
  ]
},{
  "major": "Agrártudományok",
  "year": 2013,
  "title": "A Brandkamp cserepes krizantémfajták összehasonlító kísérlete Marosvásárhely környezeti viszonyai között",
  "students": [
    {
      "name": "Szász Gyula-Richárd",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Kentelky Endre",
      "university": ""
    }
  ],
  "content": "A krizantém (Chrysantemum sp.) a margarétafélékkel rokon, a fészkesek (Asteraceae) családjában tartozó nemzetség. Neve görög eredetű, aranyvirágot jelent. A krizantém változatossága szinte kimeríthetetlen, német, kínai, japán stb. nemesítők évről évre egyre merészebb újdonságokkal lepik meg a nagyközönséget. A XVII. században Hollandiába jutottak az első keleti krizantémok, és 1676-ban már hat különféle keleti krizantémot neveltek a leideni botanikus kertben. Az általam végzett kutatás fő célja, hogy Marosvásárhely környezeti viszonyai között összehasonlítsak 66 német Brandkamp cserepes krizantémfajtát virágméret, virághozam és növekedési erély szempontjából. Arra a kérdésre kerestem a választ, hogy melyek azok a fajták, amelyek a legjobban tudnak alkalmazkodni és díszíteni Marosvásárhely környezeti viszonyai között. A begyűjtött adatok, megfigyelések és irodalmi adatok alapján vontam le következtetéseimet.",
  "keywords": [],
  "generated_keywords": [
    "krizantémfajták",
    "dísznövény-termesztés",
    "helyi adaptáció"
  ]
},
{
  "major": "Agrártudományok",
  "year": 2013,
  "title": "Táplálékláncok vizsgálata a gilisztaűző varádics különböző kemotípusain",
  "students": [
    {
      "name": "Bogos Szabolcs",
      "major": ""
    },
    {
      "name": "Györffy Hunor",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Balog Adalbert",
      "university": ""
    }
  ],
  "content": "Jelen kutatás során a gilisztaűző varádics különböző kemotípusain vizsgáltuk a kialakuló táplálékláncokat. Feltételeztük, hogy a kemotípusok meghatározzák a táplálékláncok összetételét, a gyakori fajok eltérést mutathatnak az eltérő kemotípusokon. Feltételezzük ugyanakkor, hogy a levéltetvek táplálkozása révén a különböző kemotípusokból a környezetbe kerülő illóolajok eltérő ragadozó ízeltlábúakat (katicabogarak, ragadozó poloskák, pókok) vonzanak, amelyek a levéltetveket elpusztítva biztosítják a növények túlélését.",
  "keywords": [
    "varádics"
  ],
  "generated_keywords": [
    "tápláléklánc",
    "kemotípus",
    "ragadozó ízeltlábúak"
  ]
},
{
  "major": "Gépészmérnöki",
  "year": 2013,
  "title": "Mozgó gömb kinematikai vizsgálata kényszeregyenletek segítségével",
  "students": [
    {
      "name": "Derzsi Zoltán Árpád",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Papp István",
      "university": ""
    }
  ],
  "content": "TDK-dolgozatomban az államvizsgám témájának egy részét szeretném bemutatni, melynek célja egy gömbjármű megtervezése és annak kivitelezése. A projekt megvalósításában hatan veszünk részt, én csak a mechanikai részét dolgozom ki, és építem meg a járművet. Mindenki a neki leosztott feladat megvalósításával foglalkozik. De a dolgozatom csak a mozgó gömb kinematikai vizsgálatának az elkészítéséről szól a kényszeregyenletek segítségével. A kinematika a mozgások leírásával foglalkozik a mozgás okának keresése nélkül. Ez mindig a vonatkoztatási pont és a viszonyítási rendszer kijelölésével kezdődik. A viszonyítási rendszer általában egy Descartes-féle koordinátarendszer, amely lehet egy egyenes, síkbeli vagy térbeli koordinátarendszer a mozgás típusától függően. Egy test akkor áll kényszer hatása alatt, ha a helyzetét meghatározó koordináták nem vehetnek fel tetszőleges értéket, hanem közöttük meghatározott összefüggések állnak fenn. Ezek a kifejezések a kényszeregyenletek.",
  "keywords": [
    "gömb"
  ],
  "generated_keywords": [
    "kinematikai elemzés",
    "mechanikai modell",
    "kényszeregyenletek"
  ]
},
{
  "major": "Hardverfejlesztések",
  "year": 2013,
  "title": "Knight Rider futófény",
  "students": [
    {
      "name": "Kelemen Attila-Csaba",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Domokos József",
      "university": ""
    }
  ],
  "content": "A dolgozat egy futófény-alkalmazás, csóvahatással. Összesen 16 LED-et működtet. Két áramkörrel rendelkezik. Az egyik szolgáltatja a vezérlőjelet, a másik áramkör pedig kigyújtja a megfelelő LED-et és gondoskodik az azelőtti LED-ek csóvaszerű kioltásáról. Az áramkör alkalmazható személygépkocsik esztétikai kinézetének javítására, vagy akár lakásban éjjeli világításra.",
  "keywords": [
    "futófény",
    "LED vezérlő áramkör"
  ],
  "generated_keywords": [
    "elektronikai vezérlés",
    "fénytechnika",
    "áramkör tervezés"
  ]
},
{
  "major": "Hardverfejlesztések",
  "year": 2013,
  "title": "Négyrotoros helikopter tervezése és megépítése FPGA áramkörrel",
  "students": [
    {
      "name": "Tamás Tibor",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Brassai Sándor Tihamér",
      "university": ""
    }
  ],
  "content": "TDK-dolgozatom témája egyben az államvizsga-témám is, amely egy négyrotoros helikopter irányítási feladatainak a megoldását, a rendszer megépítését jelenti. A négyrotoros helikopterek vagy quadrotorok egyre népszerűbbek a hagyományos modellű helikopterek hátrányára, mivel stabilabbak, és könnyebb az irányításuk. A felhasználási területük egyre szélesebb, használhatók terepfelderítési feladatokra, katonai célokra és nem utolsósorban szórakoztatásra. A rendszer egy kereszt alakú vázra épül, aminek a négy végén egy-egy 110W-os Brushless motor található. A motorok páronként ellentétes irányban forognak, így kompenzálják a rotorok által létrehozott forgatónyomatékot. A pozíció és orientáció meghatározására egy háromtengelyes PmodACL gyorsulásmérő, egy PmodGYRO háromtengelyes giroszkóp és egy mágneses érzékelő található a rendszeren. Az irányítás első fázisban kézi, egy Art-Tech típusú hat csatornás távirányító-adóvevő párossal. A végső cél egy autonóm pályakövető algoritmus implementálása állapotteres modell alapján. Az érzékelők adatainak a beolvasása, feldolgozása, az adóvevő PWM jeleinek a beolvasása és a motorok vezérlése egy Spartan6 típusú FPGA áramkörrel ellátott Nexys3-as fejlesztőlappal van megoldva.",
  "keywords": [],
  "generated_keywords": [
    "FPGA vezérlés",
    "quadrotor irányítás",
    "szenzorintegráció"
  ]
},
{
  "major": "Hardverfejlesztések",
  "year": 2013,
  "title": "HMI technikával vezérelt gömbjármű távvezérlése",
  "students": [
    {
      "name": "Vass Sz. Szabolcs",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Brassai Sándor Tihamér",
      "university": ""
    },
    {
      "name": "Dr. Losonczi Lajos",
      "university": ""
    }
  ],
  "content": "TDK-dolgozatomban az államvizsgám témáját szeretném bemutatni, melynek célja egy gömbjármű távvezérlésének megoldása rádiófrekvenciás kommunikáció segítségével. A távvezérlés megoldása része egy nagyobb projektnek. (E projekt megvalósításában hatan veszünk részt.) Mindenki a neki leosztott feladat megvalósításával foglalkozik. Mit is jelent a HMI technika? HMI egy angol szókapcsolat rövidítése: Human Machine Interface vagyis magyarra lefordítva ember-gép kapcsolat. A mi esetünkben a HMI technika egy EEG mérőrendszer alkalmazásával valósul meg. Az EEG mérőrendszer az agy elektromos aktivitását méri. Célunk, hogy a gömbjárművet az EEG jelekből nyert információ által vezéreljük. A mért jeleket egy számítógép fogja feldolgozni, és ezek után vezérlőjelet küld a gömbjárműnek. Az én feladatom a gömbjármű és a PC közötti kommunikáció pontos megtervezése és kivitelezése, azaz két RF modul közötti rádiós frekvenciás kommunikáció vezérlése, megfelelő protokoll kiválasztása és kivitelezése. A gömbjárműbe épített RF modul és a számítógéphez csatolt RF modul között kétirányú kommunikáció zajlik.",
  "keywords": [],
  "generated_keywords": [
    "HMI vezérlés",
    "rádiófrekvenciás kommunikáció",
    "gömbjármű irányítás"
  ]
},
{
  "major": "Hardverfejlesztések",
  "year": 2013,
  "title": "HMI technika alkalmazása gömbjármű vezérlésére",
  "students": [
    {
      "name": "Kelemen Hajnal",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Márton László-Ferencz",
      "university": ""
    },
    {
      "name": "Dr. Losonczi Lajos",
      "university": ""
    }
  ],
  "content": "A TDK dolgozatom fő témája maga az államvizsgáink témája, egy gömbjármű vezérlése EEG jelek segítségével. A téma fel van osztva különböző részekre, melyből az én részem a HMI technika. Feladatom az EEG jelek mérési technológiája, elvi meghatározása a tér-időbeli dinamikáját és kinematikáját illetően. Fontos része a munkának a gömbjármű modellezése. Az EEG jelek a biológiai jelek csoportjába tartoznak, melyeknek forrása az agy. Az elektorenkefalográfia az agy működését kísérő idegsejtekhez köthető elektromos potenciálváltozások vizsgálatára szolgáló módszer, eszköze az elektorenkefalográf, amely által szolgáltatott majd ábrázolt idősor az elektroencefalogram (EEG). A mért EEG jeleket két szempontból értelmezem, értékelem: egyik szempont a technikai felhasználhatóság, a másik pedig az orvos-klinikai alkalmazhatóság. A technikai felhasználhatóság általában a mért jelekből kinyert információk vezérlő, szabályozó körökben való felhasználását jelenti, míg az orvosi alkalmazhatóság a különböző agyhoz köthető betegségek diagnosztikájára összpontosul.",
  "keywords": [],
  "generated_keywords": [
    "EEG vezérlés",
    "HMI technológia",
    "biológiai jelek feldolgozása"
  ]
},
{
  "major": "Hardverfejlesztések",
  "year": 2013,
  "title": "Mobilis robot vezérlés felülnézeti kamera alapján",
  "students": [
    {
      "name": "Nagy Csaba",
      "major": ""
    },
    {
      "name": "Sándor Hunor",
      "major": ""
    },
    {
      "name": "Szabó Tamás",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Haller Piroska",
      "university": "Petru Maior Egyetem, Informatika Tanszék"
    },
    {
      "name": "Szántó Zoltán",
      "university": "Kolozsvári Műszaki Egyetem"
    }
  ],
  "content": "Munkánk célja egy olyan kétkerekű mobil robot tervezése és építése volt, amely képes autonóm módon navigálni egy ismert pályán, mozgó ellenfelek között, és képes kisméretű mágnesrudakat elhelyezni, illetve eltávolítani a célterületekről egy felülnézeti kamera alapján. A tervezett rendszer két részből épül fel: ezek a fizikai robot és a számítógépen futó vezérlő szoftver. A robot egy kétkerekű differenciálmeghajtású kis jármű, amely bluetoothon vagy RF-en keresztül kommunikál a vezérlő számítógéppel, amely a navigációs adatokat szolgáltatja számára. Lokálisan a roboton két szabályzó kapott helyet, amelyek a kerekek fordulatszámát szabályozzák, illetve az architektúrából adódó instabilitást kompenzálják. A robot egy speciális tervezésű mágneslerakó és -felvevő mechanikával is rendelkezik. A vezérlő szoftver gyűjti be és elemzi a felülnézeti kamera képét, a robot tetején elhelyezett markereket detektálva meghatározza a robot pozícióját és haladási irányát, illetve érzékeli a pályán a mozgó elemeket (pl. ellenfelek). Az ismert pozíció alapján saját útkereső algoritmus tartja a robotot az előre meghatározott pályán, amely ugyancsak automatikusan generálódik. A vezérlő szoftver segítségével, grafikus felületen keresztül követhető a rendszer viselkedése, illetve ezen keresztül valósítható meg a rendszer hangolása is. A rendszer a „Magyarok a Marson” versenyfelhívásra készült, amelyen az „OutOfBalance” néven versenyző csapatunk 3. helyezést ért el.",
  "keywords": [
    "mobilis robot",
    "képfeldolgozás",
    "útkeresés"
  ],
  "generated_keywords": [
    "autonóm navigáció",
    "robotika",
    "kameraalapú vezérlés"
  ]
},
{
  "major": "Hardverfejlesztések",
  "year": 2013,
  "title": "HMI alapon vezérelt gömbjármű motor vezérlése és érzékelő rendszerének kiépítése",
  "students": [
    {
      "name": "Vass F. Szabolcs",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Brassai Sándor Tihamér",
      "university": ""
    },
    {
      "name": "Dr. Bakó László",
      "university": ""
    }
  ],
  "content": "Az én projektemen belül, ahogy a cím is említi, egy gömbrobot motorvezérlésének és érzékelő rendszerének a kidolgozását valósítom meg. A rendszernek rendelkezésére áll 3 érzékelő. Ezek a következők: giroszkóp – gyorsulásmérő – mágneses érzékelő. Az érzékelők esetében mindegyik háromtengelyes megoldású. A giroszkóp abban segít, hogy a kimenő adatok alapján megtudjuk, melyik tengely mentén történt kibillenés egy háromdimenziós koordinátarendszerben. A gyorsulásmérő és a mágneses érzékelő segítségével a két érzékelő koordinátarendszerei között homogén transzformáció végezhető, így pontosabban meghatározható a robot elhelyezkedése egy abszolút koordinátarendszerhez képest. Ez az információ lehetővé teszi, hogy különböző pályakövető szabályzásokat valósítsunk meg. A robot mozgását két elektromotor biztosítja: egy DC motor és egy szervomotor. Mindkét motor PWM jellel vezérelhető. A DC motor sebességet szabályoz, míg a szervomotor a haladási irányt és szöget. Egy inga és súly is rögzítésre kerül a szervomotor rotorjára, elősegítve a gömb mozgását.",
  "keywords": [],
  "generated_keywords": [
    "szenzorfúzió",
    "gömbrobot vezérlés",
    "mozgásérzékelés"
  ]
},
{
  "major": "Hardverfejlesztések",
  "year": 2013,
  "title": "Multifunkcionális mérőműszer",
  "students": [
    {
      "name": "Molnár Elemér",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Papp Sándor",
      "university": ""
    }
  ],
  "content": "Mindig is érdekeltek a mérőműszerek és a felépítésükben alkalmazott áramkörök, ezért is választottam dolgozatom témájául egy digitális mérőműszer megépítését. Egy másik célja a projekt megtervezésének az volt, hogy a hálózati jelformák alapos vizsgálatát lehetővé tegyem, mivel a jelformák különböző behatások miatt deformálódhatnak. Elképzelésem egy olyan mérőműszer megalkotásában állt, amely nagyban hasonlít az oszcilloszkóp működési elvéhez. Ilyen például a váltóáram esetén a csúcstól-csúcsig mért feszültség értékének meghatározása, vagy a jelformák megjelenítése. A mérőműszer főbb funkciói: feszültség mérése (mono- és háromfázisos rendszerekben); áramerősség mérése (mono- és háromfázisos rendszerekben); folytonosság mérése; dióda teszt; jelformák megjelenítése; szabályozható négyszögjel-generátor.",
  "keywords": [
    "mérőműszer"
  ],
  "generated_keywords": [
    "digitális oszcilloszkóp",
    "feszültség- és árammérés",
    "elektronikai tesztelés"
  ]
},
{
  "major": "Hardverfejlesztések",
  "year": 2013,
  "title": "Autonóm vonalkövető robot",
  "students": [
    {
      "name": "Tóth Zsolt",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Domokos József",
      "university": ""
    }
  ],
  "content": "Az autonóm vonalkövető mobilis robot lehet az alapja a jövő autóinak, amelyek a gépjárművezető beavatkozása nélkül is célba érhetnek. Hasonló robotok alkalmazására az iparban is találunk példát, a raktárakon belüli szállítmányozás feladatának megvalósításánál. Dolgozatomban egy ilyen autonóm robot építését fogom bemutatni, amely a vonalkövető üzemmód mellett távirányítással is vezérelhető. A robot vezérlését egy AVR típusú mikrokontroller végzi.",
  "keywords": [
    "Autonóm vonalkövető robot"
  ],
  "generated_keywords": [
    "mobilis robotika",
    "AVR mikrokontroller",
    "autonóm járművek"
  ]
},
{
  "major": "Hardverfejlesztések",
  "year": 2013,
  "title": "Dízelberendezések elektronikus vezérlése",
  "students": [
    {
      "name": "Madarász Róbert Rossi",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Kelemen András",
      "university": ""
    }
  ],
  "content": "A kutatásom fő célja a dízelszervizelés költségének a csökkentése. E cél érdekében próbáltam beépíteni saját ötleteimet olyan berendezésekbe, amelyek olcsóbbak, de ugyanakkor képesek teljesíteni. Az a két alkatrész a dízeltechnikában, melyeknek a szervizelése speciális eszközöket igényel, a magasnyomású szivattyú és a dízelporlasztó. A kettőnek az együttes működése valósítja meg az üzemanyag magas nyomáson való jutását az égéskamrába, avagy a munkahengerbe. Kísérleteimet az elterjedt Common-Rail rendszeren végeztem. Az általam választott rendszert a BOSCH fejlesztette ki. Az alapelvek elsajátítása után elkezdtem tervezni egy olyan gépet, mely valódi körülményeket képes szimulálni az alkatrészek helyes működése és bevizsgálása céljából. Ezt a feladatot kisebb részfeladatokra bontottam: nyomásvezérlés a Rail-ben; porlasztóvezérlés; a porlasztott üzemanyag mennyiség mérése; a porlasztási késés mérése. Egy oszcilloszkóp segítségével paraméterazonosítást végeztem piezokristállyal ellátott porlasztókon. Kiderült, hogy a porlasztó működése elektronikai szempontból nagyon hasonló egy kondenzátor működéséhez. A vezérlés valójában egy kondenzátortöltésen és kisütésen alapszik. Kutatásom során sikerült terveznem egy olyan rendszert, mely alkalmas a Common-Rail rendszer bevizsgálására különböző próbapadon. Sikerült mindezt kisebb költséggel megvalósítani, mint az elterjedt bevizsgáló eszközök.",
  "keywords": [
    "Dízelberendezések elektronikus vezérlése"
  ],
  "generated_keywords": [
    "Common-Rail rendszer",
    "porlasztóvezérlés",
    "üzemanyag-befecskendezés"
  ]
},
{
  "major": "Hardverfejlesztések",
  "year": 2013,
  "title": "Villamoshálózati kommunikáción alapuló lakásautomatizálás, modell prediktív hőmérsékletszabályozással",
  "students": [
    {
      "name": "Imre Barna-Sándor",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Kutasi Nimród-Dénes",
      "university": ""
    }
  ],
  "content": "A dolgozatomban bemutatok egy intelligens, modell alapú prediktív (MPC) szabályozási rendszert, amely a lakások hőmérsékletének szabályozására alkalmas. A dolgozatban egyaránt bemutatom a lakásmatematika modelljét, az MPC algoritmus tervezését és a szimulációs eredményeket. Az MPC algoritmus gyakorlati megvalósításához a lakásban létező villamos hálózatot használjuk (PLC – Power Line Communication). A hálózati kommunikációs rendszer tervezése és kivitelezése részletesen van tárgyalva, különösen az adó és vevő áramkör szűrőinek tervezése. A dolgozat bemutatja a TDA5051 modemmel megvalósított mester-szolga áramkörök működését, a hálózati szűrők méretezését, valamint az elméletet alátámasztó méréseket és a mikrovezérlőn futó program működését is.",
  "keywords": [
    "Lakásautomatizálás",
    "Power Line Communication",
    "TDA5051"
  ],
  "generated_keywords": [
    "MPC szabályozás",
    "villamoshálózati kommunikáció",
    "intelligens klímaszabályozás"
  ]
},
{
  "major": "Hardverfejlesztések",
  "year": 2013,
  "title": "Android on Wheels",
  "students": [
    {
      "name": "Moldovan Péter",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Moldován István",
      "university": "TMIT-BME"
    }
  ],
  "content": "Dolgozatom célja egy kisautó vezérlése egy Android telefon alkalmazásával úgy, hogy a vezérlésen kívül a mobilkészülék egy valós idejű kameraképet is szolgáltasson az irányított járműről. Így lehetővé válik az irányítása akár távolról, a járműre való direkt rálátás nélkül is. A valós idejű kép megjelenítésére, valamint a vezérlés megvalósítására szintén egy Android alapú táblagépet használok. A feladat megvalósítása során sokrétű kihívásokkal kell szembenézni: a jármű szervomotorjainak irányítása mikrokontrollerrel, a távoli vezérlés, illetve valós idejű képátvitel megvalósítása hálózati technológiákkal, valamint egy látványos vezérlő-megjelenítő felület kialakítása egy táblagépen.",
  "keywords": [
    "android"
  ],
  "generated_keywords": [
    "valós idejű távvezérlés",
    "robot jármű irányítás",
    "mobil alkalmazás integráció"
  ]
},
{
  "major": "Hardverfejlesztések",
  "year": 2013,
  "title": "Terepfelderítésre való mobilis robot hardveres felépítése",
  "students": [
    {
      "name": "Füzes Attila",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Brassai Sándor Tihamér",
      "university": ""
    }
  ],
  "content": "Egy terepfelderítésre szánt mobilis robot hardveres felépítését, valamint a különböző részegységek működését mutatja be a dolgozat. A robot FPGA alapú, mivel a későbbiekben neuronháló implementálása is tervbe van véve. Nagyon lényeges volt az eszközök tesztelése is a roboton, ugyanis amennyiben nem működnek megfelelően, a teljesen integrált rendszerből nehéz a hibákat megállapítani, ezért a bemutató ezzel is foglalkozik. A dolgozat arra is kitér, hogy miért pont ezekre a hardveres kiegészítőkre, illetve részegységekre esett a választás.",
  "keywords": [
    "mobilis robot",
    "FPGA",
    "terepfelderítés"
  ],
  "generated_keywords": [
    "robotikai rendszerintegráció",
    "FPGA-alapú vezérlés",
    "hardveres diagnosztika"
  ]
},
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2013,
  "title": "Android alapú pénzfelismerés látássérültek számára",
  "students": [
    {
      "name": "Szigeti Péter",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "dr. Antal Margit",
      "university": ""
    }
  ],
  "content": "Az utóbbi időben ugrásszerűen megnőtt a fogyatékos emberek életét megkönnyítő szoftverek száma. Nagyon fontos, hogy ezek az emberek is részesüljenek az információs társadalom előnyeiből, férjenek hozzá a fontos információkhoz, illetve legyen lehetőségük tanulásra. A vak és látássérült emberek a képernyőn megjelenő információkból semmit vagy csak nagyon keveset érzékelnek, ezért fontos, hogy ezeket átalakítsuk számukra is érzékelhető jelekké: tapintható vagy hallható információvá. A számítógépes látás sokféleképpen segítheti a vakok és gyengénlátók életét, például bankjegyek automatikus felismerésében. A dolgozatban egy Android eszközzel megvalósított bankjegyfelismerő alkalmazás kerül bemutatásra. A készülék kamerája rögzít egy képet, amit összehasonlít a bankjegyek elő- és hátoldalával, majd hangosan jelzi a legjobb találatot a felhasználónak. A képek összehasonlítását az OpenCV segítségével végzi. Képelemzést végezve felismeri a fontos képpontokat, majd összehasonlítja az adatbázisban tároltakkal.",
  "keywords": [
    "Android",
    "képfeldolgozás",
    "bankjegyek felismerése"
  ],
  "generated_keywords": [
    "látássérültek segítése",
    "mobil számítógépes látás",
    "audió visszajelzés"
  ]
},
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2013,
  "title": "EEG típusú biológiai jelek feldolgozása ASZI technikával",
  "students": [
    {
      "name": "Katona Norbert",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "dr. Márton László-Ferencz",
      "university": ""
    }
  ],
  "content": "Az agy a legkomplexebb emberi testrész, mivel még a mai napig sem ismert az alkotó idegsejtek közötti kommunikáció mikéntje, csak annyi biztos, hogy kész csoda a több milliárd idegsejt egymással való kommunikálása, amely minket igazán emberré tesz. A kutatók már régen felderítették, hogy az agysejtek közötti kommunikációk valójában elektromos impulzusok, elektromos jelek. Az ilyen típusú jelek összessége alkotja az EEG jeleket. Az elektroencefalogramok nagyon kis amplitúdójú elektromos jelek, amelyeket képesek vagyunk még mérni elektródákkal, a jelenlegi technológiákat alkalmazva. Dolgozatom célja egy olyan agy-számítógép interfész megvalósítása, amely az EEG jelekből kinyert információk alapján képes vezérelni például egy guruló gömböt. A feldolgozás során osztályozom az EEG jeleket, és meghatározom a számunkra hasznos főbb komponenseket. A dolgozat kitér az EEG jelfeldolgozás kihívásaira és a korszerű idő-frekvencia analízis technikák, például a Wavelet és Hilbert-Huang transzformáció alkalmazására.",
  "keywords": [],
  "generated_keywords": [
    "EEG jelfeldolgozás",
    "agy-számítógép interfész",
    "idő-frekvencia analízis"
  ]
},
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2013,
  "title": "EEG jelek értelmezése megjelenítése vizuális felületen",
  "students": [
    {
      "name": "Szigeti Péter",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "dr. Márton László-Ferencz",
      "university": ""
    },
    {
      "name": "dr. Bakó László",
      "university": ""
    }
  ],
  "content": "Az agy vezérli az egész szervezetet. Információt gyűjt be, feldolgozza őket, és jeleket küld ki a szervezet minden alkotó részéhez. Jelek, olyan idősorok, amelyeket a technika újabb eredményei mérhetővé tettek. A fejtetőn speciális érzékelők és jelátalakítók segítségével mért jeleket EEG jeleknek nevezzük. Ezen jelek közül a szem mozgatása által keletkezett jeleket, EOG-nek, vagyis Elektro Oculogramoknak nevezzük. Ezek a legkönnyebben mérhető EEG komponensek közé tartoznak. Dolgozatomban ezen jelek érzékelésére, értelmezésére fektettem a hangsúlyt. A Brain Master készülék segítségével két EEG csatorna mérése valósul meg. Ezek az agy jobb és bal féltekéről mérnek jeleket, amelyek kis amplitúdójú feszültség formájában hordoznak információt. Ezen jelcsatornák tartalmazzák a fontos információt, mely értelmezésével vezérlőjeleket tudunk létrehozni. Az alkalmazás a jelek előfeldolgozásával, formafelismeréssel és osztályozással történik. Ezek alapján síkban kivitelezett irányokká alakítva vezérlőjeleket hoz létre. Számítógépes vezérlés használja ezeket az információkat.",
  "keywords": [],
  "generated_keywords": [
    "EEG vizualizáció",
    "formaelemzés",
    "vezérlőjel generálás"
  ]
},
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2013,
  "title": "Web USB Key",
  "students": [
    {
      "name": "Szép László-Zoltán",
      "major": ""
    },
    {
      "name": "Menyhárt Csaba",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "dr. Joó András",
      "university": ""
    }
  ],
  "content": "Napjainkban óriási teret hódítanak a webalkalmazások. Rengeteg webalkalmazást veszünk igénybe, valamint megfigyelhető, hogy mind több és több hasznos webalkalmazás kerül a piacra és a fogyasztók száma is egyre növekszik. Azonban minden egyes webalkalmazásnak van egy közös, negatív pontja, ami nem más, mint a felhasználók azonosításához szükséges felhasználónév és jelszó megadása. Biztonsági okokból tanácsos, hogy ne használjuk ugyanazt a felhasználónevet és jelszót több webalkalmazásnál, sőt, a jelszó minél összetettebb legyen, sok karaktert tartalmazzon, legyen benne szám, betű és speciális karakter is. Egy idő után már nagy kihívás ezen azonosítók észben tartása. Nos, ennek a problémának egy megoldására készítettük el a Web USB Key (WUK) alkalmazást, mely tárolja a különböző webalkalmazásokhoz a felhasználóneveket és a jelszavakat, annak érdekében, hogy ezek megjegyzése ne jelentsen gondot. Akár egy hordozható eszközön is tárolható az alkalmazásunk, amihez csupán egyetlen jelszót kell megadnunk, és máris minden tárolt webalkalmazásba bejelentkezhetünk az azonosítóink megadása nélkül, a WUK megteszi ezt helyettünk. Használata egyszerű, biztonságos, hasznossága minden bizonnyal jelentős.",
  "keywords": [
    "bejelentkezés",
    "usb kulcs",
    "webalkalmazás"
  ],
  "generated_keywords": [
    "jelszómenedzsment",
    "autentikáció automatizálás",
    "hordozható biztonság"
  ]
},
{
  "major": "Közegészségügy és egészségügyi szakpolitikák",
  "year": 2013,
  "title": "Facebook-szindróma gyerekek és fiatalok körében",
  "students": [
    {
      "name": "Kiss Andrea Beáta",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Krizbai Tímea",
      "university": ""
    }
  ],
  "content": "Napjainkban a Facebook egyre nagyobb teret hódít mindannyiunk életében. A mai gyerekek és fiatalok képezik az ún. Facebook-generációt. Dolgozatom fő célja az, hogy felmérjem, milyen hatással van a Facebook erre az új generációra. Nekik már manapság nem úgy telnek a napjaik, hogy kimennek a szabadba játszani, sportolni vagy éppen csak relaxálni, hanem egész nap bent ülnek a házban, s idejük nagy részét a számítógép előtt töltik, s különböző szocializációs oldalakon próbálnak új barátokra szert tenni. S ha ez még nem volna elég, akkor azt sem szabad figyelmen kívül hagyni, hogy milyen káros a Facebook az egészséges testi és főleg lelki fejlődésre. A kérdőív segítségével arra keresem a választ, hogy a gyerekek és a fiatalok hány órát töltenek a Facebook előtt naponta; hogy mire használják; mennyire publikusak az adataik; odafigyelnek-e arra, hogy milyen jellegű képeket töltenek fel magukról; s főként, hogy ez mennyire hat ki a hétköznapjaikra? A túlzott Facebook-használat meggátolja a valódi emberi kapcsolatok és érzések kialakulását, valamint elveszi azt az értékes szabadidőt, amit sportolással tölthetnénk, s ugyanakkor sokszor az egészséges étkezésünkre is kihat. A kutatás során elért eredmények megdöbbentőek, mivel egyesek nagyon sok időt töltenek a Facebook előtt, s sokan még az ételüket is a számítógép előtt fogyasztják el. Emellett nagy különbségek vannak, mert olyan is van, akinek egyáltalán nincsen Facebook profilja.",
  "keywords": [
    "Facebook-szindróma gyerekek és fiatalok körében"
  ],
  "generated_keywords": [
    "internethasználat hatása",
    "gyermekpszichológia",
    "digitális szokások"
  ]
},
{
  "major": "Közegészségügy és egészségügyi szakpolitikák",
  "year": 2013,
  "title": "Otthon és kintlakásban élő egyetemisták táplálkozási szokásai",
  "students": [
    {
      "name": "Szilágyi Kriszta",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Krizbai Tímea",
      "university": ""
    }
  ],
  "content": "A táplálkozás egy tanult folyamat, ami már gyermekkorban kialakul az egyénben. Az, hogy valaki egészségtudatos-e vagy sem, az nagyban függ a neveltetéstől. A kutatások, amelyeket amerikai egyetemeken végeztek, kimutatták, hogy a hallgatók nagyon kevés mennyiségben fogyasztanak zöldséget és gyümölcsöt, viszont annál nagyobb mennyiségben fogyasztanak magas zsírtartalmú ételeket. És ugyanez a helyzet Európában is. A vizsgálati populáció 30 fiatalból állt (15 otthon, illetve 15 kintlakásban, azaz albérletben élő egyetemista). A vizsgálati minta átlagéletkora 21,16 év. A vizsgálati eszköz egy olyan kérdőív, amely táplálkozási szokásokat illetve egészségmagatartással kapcsolatos kérdéseket tartalmaz. A kapott eredményekből kitűnik az, hogy az otthon élő tanulók nagyobb számban betartják a főbb étkezéseket, mint a kintlakásban élő társaik. A kintlakásban élő diákok alacsonyabb értékekről számoltak be táplálkozási szokásaikat tekintve. Az eredményeket megvizsgálva a hipotézis igaznak tekinthető, miszerint az otthon élő egyetemisták rendszeresebben és egészségesebben táplálkoznak, illetve jobban odafigyelnek az étkezésükre, mint a kintlakásban élő diákok. A kintlakásban élő diákok részére fontos lenne, ha olyan prevenciós programokon tudnának részt venni, amelyek az egészséges táplálkozásról szólnak, hogy minél jobban odafigyeljenek az egészségükre.",
  "keywords": [
    "táplálkozás"
  ],
  "generated_keywords": [
    "egyetemisták életmódja",
    "lakhatási körülmények",
    "egészséges táplálkozás"
  ]
},
{
  "major": "Közegészségügy és egészségügyi szakpolitikák",
  "year": 2013,
  "title": "Egyetemi hallgatók pénzmenedzsmentje",
  "students": [
    {
      "name": "Pozsony Alpár",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Krizbai Tímea",
      "university": ""
    }
  ],
  "content": "Sok tanulmány készült arról, hogy az egyetemi hallgatók honnan kapnak és mire költenek pénzt egyetemi éveik alatt. Ez különböző a bentlakó egyetemistáknál és azoknál, akik bérelnek egy lakást. Akinek kevés pénz áll a rendelkezésére diákévei alatt, megtanul kicsit visszafogottabban élni, spórolni kezd, aminek később nagy előnyét élvezheti az életében. A vizsgálati populáció 32 egyetemi hallgatóból állt, átlagéletkoruk 21,09 év. A vizsgálati eszköz egy olyan kérdőív, amelyben demográfiai kérdések mellett pénzköltési szokásaikat is felméri. Az egyetemisták bevétele fordítottan arányos a kiadásukkal, innen látszik, hogy nem jól bánnak a pénzükkel. Aki jövőorientált, sokkal jobban bánik a pénzével, mint azok a társaik, akik jelenorientáltak. A kutatás eredményei alapján hasznos lenne pénzmenedzsmenti tréningeket tartani az egyetemistáknak, és tudatosítani bennük, hogyan gazdálkodjanak felelősebben a rendelkezésükre álló pénzzel.",
  "keywords": [
    "pénzmenedzsment"
  ],
  "generated_keywords": [
    "egyetemisták pénzügyi szokásai",
    "tudatos gazdálkodás",
    "jövőorientált viselkedés"
  ]
},
{
  "major": "Közegészségügy és egészségügyi szakpolitikák",
  "year": 2013,
  "title": "A pszichológiai immunrendszer vizsgálata mozgáskorlátozott egyéneknél",
  "students": [
    {
      "name": "Székely Emília",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Szentes Erzsébet",
      "university": ""
    }
  ],
  "content": "A fogyatékossághoz való viszonyulás kérdése, illetve a fogyatékosok helyzete a világ minden részén foglalkoztatja az embereket. Magyarországi tanulmányokban például gyakran foglalkoznak az esélyegyenlőség kérdéskörével, illetve a fogyatékosokra vonatkozó jogokkal és kötelezettségekkel. Továbbá több ízben is folynak olyan egészségügyi kutatások, amelyek a fogyatékosok életminőségének javítását tűzték ki célul. Abból kiindulva, hogy amikor a betegség szemmel látható és hosszú ideig eltart, akkor a környezet, a társadalom betegnek minősíti azt a személyt, valamint a személy is betegnek ítéli meg magát, fontosnak tartottuk a mozgásfogyatékossággal élő egyének pszichológiai immunrendszerének, megküzdésének és lelki egészségének vizsgálatát. A vizsgálat kérdőíves felmérés alapján készült, a résztvevők között 10 férfi és 10 nő szerepelt. A szociológiai adatokon túl standardizált pszichológiai immunrendszer kérdőívet is alkalmaztunk. Azt találtuk, hogy a férfiak szignifikánsan nagyobb kontrollérzéssel rendelkeztek, mint a nők. A fogyatékosság szintje is befolyásolta az eredményeket: az enyhébb szintű fogyatékkal élők nagyobb növekedésérzést és koherenciaérzést mutattak. A vizsgált személyek pozitív hozzáállása azonban sok esetben kompenzálta a nehézségeket.",
  "keywords": [
    "mozgáskorlátozott",
    "fogyatékos",
    "pszichológiai immunrendszer",
    "megküzdés"
  ],
  "generated_keywords": [
    "lelki egészség",
    "fogyatékkal élők vizsgálata",
    "kontrollérzés nemek szerint"
  ]
},
{
  "major": "Közegészségügy és egészségügyi szakpolitikák",
  "year": 2013,
  "title": "Internetfelhasznók és MMORPG játékosok személyiség dimenzióinak elemzése",
  "students": [
    {
      "name": "Pál Nándor",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Krizbai Tímea",
      "university": ""
    }
  ],
  "content": "Mindennapi életünkben egyre nagyobb szerepet játszanak a számítógépek, életünk fontos része lett az internet, mely hatalmas mennyiségű információhoz juttatja a felhasználókat. Az internetfelhasználók másképp viselkednek és kommunikálnak a többi felhasználóval, mint ahogy a kinti világban viselkednének. A kutatás célja felmérni ezen felhasználók személyiség dimenzióját, és azt kategóriákba csoportosítani. Ugyanakkor a tézis különbséget feltételez az MMORPG-ket játszók és a nem felhasználók között. A kutatás irodalmi háttere számos olyan szakember kutatásain alapszik, akik a világ vezető pszichológusai, szociológusai és rendszerelmélet szakértői. A kutatás a kérdőíves módszert használta, amely megkülönbözteti a felhasználókat aszerint, hogy játékosok-e, illetve különböző kategóriákba csoportosítja őket. A kutatásban felhasznált második kérdőív a Big-Five 5 Domain kérdőív. A kutatásban részt vett 55 személy, ebből 25 nő és 30 férfi. A kérdezettek által kitöltött Big-Five 5 Domain kérdőívben a személyiségtípusokra mért pontszámok kimutatták a különbségeket a nemek és a felhasználói szokások szerint. A kutatás eredményei szerint van szignifikáns különbség a rendszeres internetfelhasználók és az aktív MMORPG játékosok között. Kiderült, hogy a játékos személyiségének van köze az általa betöltött szerephez. Ugyanakkor nincs szignifikáns különbség az internetezéssel töltött idő mennyiségében a két csoport között.",
  "keywords": [],
  "generated_keywords": [
    "személyiségdimenziók",
    "internetes szokások",
    "MMORPG játékosprofil"
  ]
},
{
  "major": "Közegészségügy és egészségügyi szakpolitikák",
  "year": 2013,
  "title": "Barátnő hatása a testsúly-elégedettségre serdülőkorban",
  "students": [
    {
      "name": "Nagy Timea",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Krizbai Tímea",
      "university": ""
    }
  ],
  "content": "Bevezetés: Serdülőkorban csökken a felnőttekkel töltött idő, a fiatalok többet vannak barátaikkal, mint családtagjaikkal, vagy akár egyedül. A barátokkal töltött időt a serdülők mindennél többre becsülik. A serdülőkori barátságok a fejlődésben hasonló szerepet játszanak, akár a csecsemőknél a kötődés. A jelen vizsgálat célja az, hogy megtudjuk, befolyásolja-e a barátnő véleménye a serdülőkorú lányok testsúly-elégedettségét.\n\nMódszerek és eszközök: A vizsgálati populáció 30, 11. osztályos serdülő lányból állt. A kérdőív a saját testtel való elégedettségre vonatkozott, 8 fő kérdést és 2 alkérdést tartalmazott, zárt és nyitott formában.\n\nEredmények: A lányok 53%-a elégedett volt testsúlyával, míg 43%-uk nem, és közülük 31% próbálja testét elrejteni. A 30 válaszadó közül 19 főnek kicsit, 10-nek nagyon számít a barátnő véleménye, míg 1 főnek nem számít. A serdülők 57%-a fogyókúrázna, ha barátnője azt mondaná, hogy kövér.",
  "keywords": [
    "testsúly elégedettség",
    "barátnő hatása"
  ],
  "generated_keywords": [
    "serdülőkori önkép",
    "szociális befolyás",
    "lányok testképe"
  ]
},
{
  "major": "Közegészségügy és egészségügyi szakpolitikák",
  "year": 2013,
  "title": "Az egypetéjű, illetve kétpetéjű ikerpárok táplálkozási szokásainak, egészségmagatartásának, testsúly-elégedettségének, valamint jövőorientáltságának vizsgálata",
  "students": [
    {
      "name": "Bartha Timea",
      "major": ""
    },
    {
      "name": "Kalapács Dalma",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Krizbai Timea",
      "university": ""
    }
  ],
  "content": "Az egypetéjű, illetve kétpetéjű ikerpárok táplálkozási szokásainak, egészségmagatartásának, testsúly-elégedettségének, valamint jövőorientáltságának vizsgálata.",
  "keywords": [
    "ikerpárok",
    "egészségmagatartás",
    "jövőorientáltság",
    "testsúly-elégedettség"
  ],
  "generated_keywords": [
    "ikervizsgálat",
    "életmód összehasonlítás",
    "pszichológiai tényezők"
  ]
},
{
  "major": "Közegészségügy és egészségügyi szakpolitikák",
  "year": 2013,
  "title": "A passzív dohányzás kedvezőtlen hatása a légzőrendszerre gyermekkorban",
  "students": [
    {
      "name": "Kéri Johanna",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Horváth Adrienne",
      "university": "Marosvásárhelyi II. Gyermekgyógyászati Klinika"
    }
  ],
  "content": "Az emberi szenvedélybetegségek leggyakoribb példája a dohányzás. Ennek passzív formája nagymértékben veszélyezteti a gyermekeket is, mégis sokan vannak kitéve ennek világszerte. Dr. Panagiotis Behrakis szerint „A passzív dohányzás a gyermekbántalmazás leggyakoribb formája. Az emberi jogok megsértésének kellene tekinteni.” Dolgozatomban arra keresek választ, hogy az erőteljes dohányzásellenes propaganda ellenére a gyerekek milyen mértékben vannak kitéve passzív dohányzásnak, és ez mennyire befolyásolhatja egészségüket. Tanulmányoztam a passzív dohányzással összefüggésbe hozható gyakoribb légzőszervi tüneteket, ezek megjelenési gyakoriságát, súlyossági formáját. A marosvásárhelyi II. Gyermekgyógyászati klinikán, valamint városi és falusi gyermekközösségekben végeztem kérdőíves felmérést 1–8 éves gyermekek körében. A 94 vizsgált gyermek közül 31%-uk közvetlenül ki volt téve a passzív dohányzásnak, 15%-uk harmadlagos dohányfüsttel érintkezett, míg 53%-uk nem. A passzív dohányzásnak kitett gyermekek 43%-a szenvedett három hónapon át légzőszervi megbetegedésben, szemben a nem érintettek 12%-ával. A beutalt gyermekek körében a leggyakoribb diagnózis a tüdőgyulladás és akut hörghurut volt.",
  "keywords": [],
  "generated_keywords": [
    "passzív dohányzás",
    "gyermekkori légúti megbetegedések",
    "egészségügyi kockázatok"
  ]
},
{
  "major": "Közegészségügy és egészségügyi szakpolitikák",
  "year": 2013,
  "title": "Egyedül, illetve családban élő idős emberek táplálkozási szokásai",
  "students": [
    {
      "name": "Keszler Hanna",
      "major": ""
    },
    {
      "name": "Albert Henrietta",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Krizbai Tímea",
      "university": ""
    }
  ],
  "content": "Bevezetés: Számtalan kutatás foglalkozik a fiatalok helytelen táplálkozásával, ennél jóval kisebb figyelem irányul az idősebb korosztályra, noha a minőségi életnek ebben az életszakaszban is döntő feltétele a megfelelő táplálkozás.\n\nCélkitűzések: Jelen vizsgálat célja felmérni és elemezni az idős (60 év feletti) emberek táplálkozási szokásait és összehasonlítani ezen szokásokat az egyedül illetve a családban élő idős emberek körében.\n\nMódszerek és eszközök: A vizsgálati populáció 50 idősből állt (25 egyedül élő, illetve 25 családban élő). A vizsgálati eljárást kérdőív segítségével végeztük, mely a demográfiai adatok mellett a táplálkozási preferenciákra, életvitelre és egészségi állapotra kérdez rá.\n\nEredmények: A felmérésből kiderült, hogy az idős emberek táplálkozási szokásai egyaránt összefüggésben állnak a családi állapottal, a fizikai aktivitással, és kihatással vannak az egészségi állapotra. Habár nagymértékű eltérést nem észleltünk, megállapítható, hogy az egyedül élők kisebb gondot fordítanak a táplálkozásukra.\n\nKövetkeztetés: A eredmények tükrében fontosnak tartjuk hangsúlyozni, hogy az idősebb korosztály körében is szükség van az egészséges táplálkozás és életmód népszerűsítésére.",
  "keywords": [
    "táplálkozás",
    "egészség",
    "idősek"
  ],
  "generated_keywords": [
    "életkor szerinti táplálkozás",
    "családi állapot hatása",
    "időskori prevenció"
  ]
},
{
  "major": "Közegészségügy és egészségügyi szakpolitikák",
  "year": 2013,
  "title": "TÁPLÁLKOZÁSI SZOKÁSOK KÖVETÉSE ERDÉLYI MAGYAR FELNŐTT LAKOSSÁG KÖRÉBEN",
  "students": [
    {
      "name": "Kovács Noémi Anasztázia",
      "major": ""
    },
    {
      "name": "Mátyás Kinga Noémi",
      "major": ""
    },
    {
      "name": "Komancsik József Hunor",
      "major": ""
    }
  ],
  "teachers": [
    {
      "name": "Dr. Ábrám Zoltán",
      "university": "MOGYE, Közegészségtani Tanszék / Sapientia-EMTE (óraadó)"
    },
    {
      "name": "Dr. Domokos Lajos",
      "university": "Pszichiátriai Klinika"
    }
  ],
  "content": "Az Egészségügyi Világszervezet (World Health Organization, WHO) egy közelmúltban napvilágot látott közleménye szerint Magyarország az Európai Unió egyik legegészségtelenebb országa Bulgária és Románia mellett. A szakemberek többsége egyetért abban, hogy a „nyugati betegségek”, vagy más néven a nem fertőző krónikus megbetegedések (szívinfarktus, magas vérnyomás, érelmeszesedés, elhízás stb.) elkerülésére akkor van a legnagyobb esély, ha az egészséghez kapcsolódó magatartás, ezen belül a táplálkozás helyes irányba változik. Kutatásunk során az erdélyi magyar lakosság táplálkozási szokásait vizsgáltuk kérdőíves módszerrel. Összesen húsz élelemcsoport és nyolc alkoholmentes ital fogyasztásának a gyakoriságát követtük. A kutatás eredményei szerint nagynak bizonyul (62%) a rendszertelenül étkezők aránya, különösen a fiatal felnőttek körében. A táplálkozás minőségére vonatkozó adatok szerint a napi rendszerességgel gyümölcsöt fogyasztók aránya összességében 27%, a zöldségeket fogyasztók aránya 19%, a tejtermékeket fogyasztók aránya 59%. Magas a telített zsírok és alkohol fogyasztása középkorúak és idősek körében, míg az édességek és cukrozott italok fogyasztása inkább a fiatalok körében jellemző. Mindezek figyelembevételével a kutatás eredményei egészségnevelési programok kidolgozásánál hasznosíthatók.",
  "keywords": [],
  "generated_keywords": [
    "táplálkozási szokások",
    "életmód kutatás",
    "erdélyi magyar lakosság"
  ]
}
]