[
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2015,
    "title": "A politikai korrektség nyelvi megvalósulása a mai magyar online sajtóban",
    "students": [
      {
        "name": "Barabás Blanka",
        "major": "Sapientia EMTE, Fordító és tolmács szak, II. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A XXI. század igyekszik a minden téren megvalósuló egyenjogúság nagykövete lenni. Azonban az elvek gyakorlatba ültetéséhez eszközökre van szükség. A politikai korrektség mint kulturális magatartás a nyelvet használja arra, hogy valamiféle (társadalmi, viselkedési) normát mutasson fel. Ennek leghatékonyabb terjesztési módját minden bizonnyal a tömegkommunikáció, azon belül az online sajtó jelenti. Kutatásom során elsősorban arra voltam kíváncsi, hogy magyar nyelvterületen milyen tartalmi feltételeket támaszt a politikailag korrekt nyelv. Továbbá azt vizsgáltam, hogy a magyarországi és erdélyi online sajtófelületeken milyen mértékben és módon használják a politikailag korrekt nyelvet.",
    "keywords": [],
    "generated_keywords": [
      "módon használják",
      "normát mutasson",
      "nyelvet",
      "tömegkommunikáció"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2015,
    "title": "Translation Difficulties of Arthur Conan Doyle’s The Adventure of the Lion’s Mane",
    "students": [
      {
        "name": "Molnár Andrea",
        "major": "Sapientia EMTE, Fordító és tolmács szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Imre Attila",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "My project focuses on the difficulties of translating a short story of detective fiction genre, written in the 1920s in England by the Victorian author, Arthur Conan Doyle, namely The Adventure of the Lion’s Mane (1927). I study the original text in comparison with its Hungarian translation (Az oroszlánsörény esete, translated by Péter Tiborszky, 2007) and Romanian translation (Coama leului, translated by Adina Begu, 2014) I have chosen to study a short story written by Arthur Conan Doyle because he created the famous detective Sherlock Holmes, who fascinates me with his ability of logical reasoning and because I would like to find out how and why the author’s style of writing is unique. Doyle’s style of writing is unique due to the variety of past tenses he uses, the colourful and descriptive vocabulary, and extensive use of adjectives. His way of conveying information to the reader is very polite, sophisticated and especially twisted. It is typically British. The theoretical part of the project discusses the difficulties of translating literature and discusses the decisions a literary translator has to make in order to produce the same effect on the reader. It includes issues of creativity, faithfulness, invisibility, the translator’s freedom, transparency, the translator’s style, register and tone. My main hypothesis is that Doyle’s translators are faced with difficulties when trying to render his unique style, especially when the variety of past tenses contribute to the storyline, and the Hungarian translator has to rely much more on time adverbials to convey the meaning compared to the Romanian version with more past tense possibilities. In the practical part of the project I present the short story, then I focus on sentence structures, offering a comparison of the English past tenses and adjective use with their Hungarian and Romanian translations. In the conclusion I will try to offer an explanation why the Hungarian and Romanian translations are considered successful or not in rendering the style of the original.",
    "keywords": [],
    "generated_keywords": [
      "Adina Begu",
      "Arthur Conan Doyle",
      "British",
      "Doyle",
      "England"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2015,
    "title": "A nyelvi norma kialakítása és formálása nyelvjárási hátterű iskolai oktatásban",
    "students": [
      {
        "name": "Fogarasi Melinda",
        "major": "Sapientia EMTE, Fordító és tolmács szak, II. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Az anyanyelvi oktatás nyelvjárási hátterű tanulók számára olyan kihívásokkal szembesíti az anyanyelvet oktató pedagógust, amelyek rámutatnak a köznyelvi norma szerinti nyelvhasználat elsajátításának nehézségeire. A nyelvi normák elsajátítása során a nyelvjárási köznyelvet beszélő tanulók már eleve egyfajta hátránnyal indulnak azokkal szemben, akik a köznyelvet használják elsődleges nyelvváltozatként. Ezt a hátrányt kell leküzdenie az oktatónak a normakövető nyelvhasználat, illetve a beszéd- és helyesírási készség kialakítása érdekében. Jelen dolgozat rávilágít a mezőségi nyelvjárásban beszélő tanulók és a köznyelven történő iskolai oktatás között felmerülő konfliktushelyzetekre, a tanulók viszonyulására a normakövető nyelvhasználathoz, illetve megoldási lehetőségeket keres ezekre a nyelvi konfliktusokra. A kutatás hipotézise az, hogy a nyelvjárási hátterű tanulók az otthonról tanult nyelvváltozatot alkalmazzák minden élethelyzetben, emiatt a normatív nyelvhasználat elsajátítása számukra nehézséget jelent. Ennek egyik következménye, hogy kevesen folytatják tanulmányaikat.",
    "keywords": [],
    "generated_keywords": [
      "Ennek",
      "Jelen",
      "felmerülő konfliktushelyzetekre"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2015,
    "title": "Linguistic Superstitions",
    "students": [
      {
        "name": "Agyagási Anasztázia",
        "major": "Sapientia EMTE, Fordító és tolmács szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "In my project I am writing about linguistic superstitions. I chose this topic because I find it really interesting how they work within a language, how people use it if they even recognize it. In the theoretical part of my project I present the English and Hungarian language ideologies. I also present the myths, their characteristics and the differences between myths, superstitions and misbeliefs, because they are not the same. In the practical part of my project I analysed some language myths both in English and Hungarian languages.",
    "keywords": [],
    "generated_keywords": [
      "English",
      "Hungarian",
      "Hungarian language"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2015,
    "title": "Javítani és javítva lenni",
    "students": [
      {
        "name": "Puskás Eszter",
        "major": "Sapientia EMTE, fordító és tolmács szak, II. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A nyelvi norma kérdése egy olyan aktuális téma, ami szerintem sosem megy ki divatból. A társadalom állandó változásban van, újabb és újabb jelenségek megfigyelhetőek, naponta találnak fel újabb és újabb eszközöket, alakulnak ki új betegségek, mindezekről beszélni kell. Így képezzük le a világot. Természetesen ezeknek a változásoknak köszönhetően szükséges a nyelv adaptálódása a változásokhoz. A nyelv állandó változása természetes dolog nemcsak időben, hanem térben is. Tájnyelveink vannak, szlengek, zsargonok, szaknyelvek, és természetesen van egy sztenderd nyelvváltozat is, mindezeket a szituációnak megfelelően használjuk. Dolgozatomban arra a kérdésre kerestem a választ, hogy a Sapientia EMTE kommunikáció szakos diákjai hogyan kérik számon a nyelvi normát a mindennapi nyelvhasználatban, illetve hogy tőlük hogyan kérik számon ugyanezt. Azokra a kérdésekre keresem a választ, hogy kijavítják-e mások hibáit, hogy őket kijavították-e már, hogy milyen nyelvtani hibákat tartanak zavarónak vagy éppen nem zavarónak, ugyanakkor kíváncsi voltam arra is, hogy alakult-e valaha vita ki abból, ha kijavítottak valakit, vagy éppen őket javították ki.",
    "keywords": [],
    "generated_keywords": [
      "Azokra",
      "Sapientia EMTE",
      "Természetesen",
      "javították ki",
      "választ"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2015,
    "title": "Terminologia din domeniul cardiologiei reflectată în dicționarele medicale",
    "students": [
      {
        "name": "Vass Kata",
        "major": "Sapientia EMTE, Fordító és tolmács, I. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Butiurcă Doina",
        "university": "Sapientia EMTE, egyetemi docens"
      },
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "În studiul “Terminologia din domeniul cardiologiei reflectată în dicționarele medicale”, propunem o cercetare a terminologiei din domeniul cardiologiei. Propunem o analiză contrastivă a termenilor-titlu și a definițiilor în limbile maghiară și română, ca prim obiectiv. Cel de-al doilea obiectiv este acomodarea lingvisticii în terminologia maghiară respectiv, română. Metoda de cercetare este descriptiv- lingvistică sau semasiologică și contrastivă. Dintre aspectele abordate amintim: studiul termenilor-cheie pe baza cărora s-a format terminologia din domeniul cardiologiei, al sintagmelelor terminologice, studiul sensurilor/ structura acestora, cercetarea tipurilor de abreviere etc. Studiul îsi propune, de asemenea, cercetarea comunicării specializate în limba maghiară/română, precum și adaptarea limbajului medical la specificul limbii. Concluzia studiului nostru este că la nivelul termenilor-titlu ambele limbi mențin, cu excepțiile necesare, terminologia cvasi-universală medicală, spre deosebire de nivelul definițiilor unde se realizează echivalarea denominativă, respectându-se specificul limbilor naturale, în general, al limbii maghiare în special. Cuvinte cheie: cardiologie, termini-cheie, definiție, limba maghiară, limba română, contrastive.",
    "keywords": [],
    "generated_keywords": [
      "Concluzia",
      "Propunem",
      "Studiul"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2015,
    "title": "Proper Use of If Clause",
    "students": [
      {
        "name": "Popa Margit",
        "major": "Sapientia EMTE, Fordító és tolmács, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Imre Attila",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "There is a hypothesis that people with Latin origin mother tongue speak more correct English from the grammatical point of view than speakers of non-Latin languages. If this is true, then something should be done in order to ease the learning of grammar. Thirty Romanian and thirty Hungarian pupils were tested to prove this theory wrong or right. In the light of the proper use of English grammar they translated and corrected several types of if-clauses. Due to the fact that if-clauses are present in everyday language use, they are necessary to be discussed. Several ways to recognize the necessary if clauses will be presented, together with their proper use.",
    "keywords": [],
    "generated_keywords": [
      "English",
      "Hungarian",
      "Latin",
      "Romanian"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2015,
    "title": "Az evolvens trigonometria második alapegyenletéből származó összefüggések felhasználása grafikus szoftver környezetben",
    "students": [
      {
        "name": "Márton Loránd",
        "major": "Sapientia EMTE, Mechatronika szak, II. év"
      },
      {
        "name": "Tar Csaba",
        "major": "Sapientia EMTE, Mechatronika szak, II. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Máté Márton",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "A dolgozatunk egy olyan átfogó kutatási projekt része, amelynek tárgya a metszőkerék konstruktív és geometriai méreteinek hatékony, grafo-analitikus módszerrel történő, tehát vizuális környezet által segített meghatározása. A grafo-analitikus tervezési modell az evolvenstrigonometriai összefüggésekre alapoz. A metszőkerék lényeges eleme a legnagyobb profileltolás, melynek grafikus környezet segítségével történő meghatározása a dolgozat tárgya. A minimális fejköri ívhosszhoz rendelt fejkörsugár- és profileltolás-érték lépésről-lépésre történő kiszerkesztése a módszerünk lényege. Az ábrázolás hűségének érdekében különös fontosságú az evolvens ív egyenlő hosszúságú szakaszokra való felosztása, melynek számítását részletesen közöljük. A programot Autolisp programozási nyelvben írtuk meg. A modellt Autocad környezetben építjük. Erre építjük a következőkben a metszőkerék fogának határfelületeit. Ezzel lehetőséget biztosítunk új élezési stratégiák kidolgozására és hatékony vizsgálatára a jelenleg használtnál jobb geometriai kialakítás céljából.",
    "keywords": [],
    "generated_keywords": [
      "Autocad",
      "Autolisp",
      "Erre",
      "Ezzel",
      "grafo-analitikus"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2015,
    "title": "Laskavágás mesterfokon",
    "students": [
      {
        "name": "Lőrinczi Attila",
        "major": "Sapientia EMTE, Mechatronika szak, II. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Egyed-Faluvégi Erzsébet",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Több évtizede már, hogy a műszaki középiskolák, főiskolák és egyetemek hallgatói tésztahidakkal versenyeznek, ahol a cél a legnagyobb terhelhetőség elérése a kereskedelemben kapható laskák alkalmazásával. Természetesen az így beszerezhető laskák nem teljesen szabályosak, ezért különböző vágásokat, csiszolásokat kell rajtuk végezni, hogy fel lehessen használni azokat. Jelen dolgozat egy mechatronikai elemekkel ellátott szerkezetet szemléltet, mely a tésztahídépítő versenyen felhasznált laska vágására alkalmas. Az ötlet a durva vágási eljárásból származó felületből adódott, mivel e felületen repedések jelentek meg. A szerkezet felépítése egyszerű megfigyeléseken alapszik, mely két mozgás összehangolásából áll: haladás és forgás. Eredményként egy repedésmentes, pontosabb vágást kapunk, amelyet mikroszkópos vizsgálatok is bizonyítanak.",
    "keywords": [],
    "generated_keywords": [
      "Jelen",
      "Természetesen",
      "csiszolásokat kell"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2015,
    "title": "Laskahíd-terhelő berendezés",
    "students": [
      {
        "name": "Kisgyörgy Árpád",
        "major": "Sapientia EMTE, Mechatronika szak, IV. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Egyed-Faluvégi Erzsébet",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Spagettiből hidat építeni? Játék ez, vagy tényleg komoly dolog? Nos, a válasz egyértelmű: egy erős és szép híd megépítése, függetlenül attól, hogy milyen anyagból készül, komoly mérnöki feladat. De mivel is tudjuk mérni a tésztahidak teherbíró-képességét? Jelen dolgozat egy tésztahíd-terhelő berendezés mutat be, melynek célja, hogy az Óbudai Egyetem által minden évben szervezett „RECCS” elnevezésű versenyre elősegítse a felkészülést, valamint hogy a Sapientia Erdélyi Magyar Tudományegyetem tésztahídépítő versenyt szervezhessen középiskolás diákok és egyetemi hallgatók részére. A berendezés egy masszív váz, mely zártszelvényből készült, hogy 1 tonna terhelést is elbírjon. E terhelés egy egyenáramú motortól egy jól megtervezett fogaskerékhajtáson keresztül jut el a vizsgált hídra, mely egy bizonyos értéknél széttörik. A maximális terhelés nagysága, melyet a vizsgált híd kibírt, egy erőmérőcella segítségével kerül elmentésre. A diákok megismerhetik a mérnöki szakma szépségeit rámutatva arra, hogy pontos tervezés és kivitelezés által 1 kg tészta akár fél tonnát is elbírhat.",
    "keywords": [],
    "generated_keywords": [
      "Jelen",
      "Sapientia Erdélyi Magyar Tudományegyetem",
      "fél tonnát",
      "megtervezett fogaskerékhajtáson",
      "melyet"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2015,
    "title": "Konvekciós gyertyakályha vizsgálata",
    "students": [
      {
        "name": "Máthé Levente",
        "major": "Sapientia EMTE, Mechatronika szak, III. év"
      },
      {
        "name": "Ambrus Alpár",
        "major": "Sapientia EMTE, Mechatronika szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Pásztor Judit",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatunkban bemutatjuk a konvekciós gyertyakályha felépítését és működését. Vizsgáljuk és összehasonlítjuk a gyertyakályha és a gyertyák által leadott hő terjedést. Mérjük a gyertyakályha felületén a hőmérsékletet, és a hőforrásoktól 20 cm-re elhelyezett hőmérsékletmérő szenzorok által jelzett feszültségeket, amelyekből hőmérsékletet számolunk. Választ keresünk arra, miért tekintik a kályhát egy alternatív fűtési megoldásnak. Kiszámoljuk a gyertyakályha teljesítményét és a gyertyaszükségletet egy adott tér fűtéséhez. Továbbá vizsgáljuk a különböző paraméterek (kályha mérete, kéményátmérő) változtatásának hatását a hőforrások közelében észlelt hőmérsékletre, amelyek segítségével javítani kívánjuk a gyertyakályha működését.",
    "keywords": [],
    "generated_keywords": [
      "Dolgozatunkban",
      "Választ",
      "hőmérsékletre",
      "javítani"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2015,
    "title": "Forgácsolási erő mérése induktív jelátalakítóval",
    "students": [
      {
        "name": "Ferencz Árpád",
        "major": "Sapientia EMTE, Mechatronika szak, IV. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Egyed-Faluvégi Erzsébet",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A forgácsoló megmunkálások idején a szerszám egy bizonyos erővel hat a forgácsolandó anyagra, ezáltal az anyagtöbblet forgács formájában válik le a megmunkálandó anyagról. Ez az erő elég nagy kell legyen ahhoz, hogy képes legyen legyőzni a megmunkálandó anyag által tanúsított összes ellenálló erőt. Isaac Newton harmadik törvényéből ismeretes, hogy két testnek egymásra gyakorolt kölcsönös hatása mindig egyenlő és ellentétes, vagyis a munkadarab is hat egy ugyanolyan nagyságú, de ellentétes irányítású erővel a forgácsoló szerszámra. E kettőből a forgácsolási erő az, amely a munkadarabra hat és a forgácsoló szerszámot igénybe veszi. Jelen dolgozat a forgácsoló erő mérésére egy induktív érzékelővel ellátott berendezés tervezését és kivitelezését mutatja be. Az induktív érzékelők működése egy tranzisztoros oszcillátoron alapszik, amivel működtethető egy ferritmagos tekercs. A ferritmagok közötti légrés csökkenése, illetve növelése során változik a tekercs öninduktivitása. Ez a változás adja a forgácsolási erő nagyságát.",
    "keywords": [],
    "generated_keywords": [
      "Isaac Newton",
      "Jelen",
      "kell legyen ahhoz",
      "legyen legyőzni"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2015,
    "title": "Spirális fogirány-vonalú hengeres fogaskerekek marófej betétkéseinek köszörülése",
    "students": [
      {
        "name": "Gyéresi Hunor",
        "major": "Sapientia EMTE, Mechatronika szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Máté Márton",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Az Arkhimédész-féle spirális fogirányvonalú hengeres fogaskerékhajtások jobban terhelhetőek, nagyobb nyomatékot képesek átadni azonos tömeg mellett. A fogazat megmunkálása betétkéses marófejjel történik. A fogazat utólagos köszörülése igen költséges lenne, ezért a betétkéseket úgy kell létrehozni, hogy újraélezés után az alakhűség maximális legyen. A dolgozat tárgyalja a köszörüléssel előállított betétkések profilhibáit különböző köszörülési paraméterek függvényében.",
    "keywords": [],
    "generated_keywords": [
      "Az Arkhimédész-féle",
      "előállított betétkések",
      "kell létrehozni",
      "köszörüléssel"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2015,
    "title": "LEGO-alakzat kirakása robotizált szerelőcella segítségével",
    "students": [
      {
        "name": "Német Huba",
        "major": "Sapientia EMTE, Mechatronika, IV. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Forgó Zoltán",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A TDK dolgozatomban egy robotizált szerelőcellát mutatok be, amelyben egy FANUC M-1iA típusú robot LEGO kockákból egy alakzatot rak ki. A LEGO kockák egy rezgő spiráladagoló edényébe vannak rendezetlenül behelyezve, majd ez a készülék rendezi őket azonos helyzetbe. A kockák a rezgő spiráladagoló kivezetésére sorakoznak fel a kívánt, azonos pozícióba, hogy a robot egy befogószerszám segítségével egyenként elvegye őket, és egy kialakított munkafelületen összerakja belőlük az előre meghatározott alakzatot. A rezgő spiráladagoló kivezetőjén levő kockák jelenlétéről és mennyiségéről szenzorok fognak információt nyújtani a robot és a spiráladagoló vezérlőjének. A dolgozatom célja a modern termelési folyamatokhoz tartozó robotizált összeszerelés egyszerű szemléltetése.",
    "keywords": [],
    "generated_keywords": [
      "LEGO",
      "M-1iA",
      "TDK",
      "levő kockák"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2015,
    "title": "12 elektródás EKG-becslés 4 elektródás méréssel",
    "students": [
      {
        "name": "Fehér Áron",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika szak, IV. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Kutasi Dénes Nimród",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      },
      {
        "name": "Fekete Albert Zsombor",
        "university": "Sapientia EMTE, egyetemi tanársegéd"
      }
    ],
    "content": "A dolgozat célja egy 12 elektródás orvosi mérést megközelítő EASI 4 elektródás mérésen alapuló biológiai mintavételező rendszer bemutatása. A használt hardware egy saját készítésű, PIC24 mikrovezérlőt tartalmazó, akkumulátoros fejlesztőlap. Az EKG-jeleket differenciális elektródákkal mérem, szűröm és erősítem. Az előkészített jelet a PIC24 belső analóg-digitális átalakítójával mintavételezem, ismét szűröm, előállítom, majd soros kommunikációval továbbítom az adatokat. A számítógépoldalon egy C# alkalmazás fogadja az adatokat, és valós időben dolgozza fel a jelet (ábrázolja, menti az értékeket, és további szűréseket végez). A dolgozat bemutatja a fejlesztőrendszer tervezését, az analóg mérőáramkör tervezését és megvalósítását, a szűrők tervezését, a mérési elvet, valamint a gyakorlati méréseket. A négycsatornás mérés alapján bemutatom a 12 elektródás mérést megközelítő EASI módszer alapján becsült derivációkat. A kifejlesztett rendszer egy mobil-EKG mérőrendszer szerves része.",
    "keywords": [],
    "generated_keywords": [
      "C#",
      "EASI",
      "EASI 4",
      "EKG-jeleket differenciális",
      "PIC24"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2015,
    "title": "Stirling-motoros naperőmű",
    "students": [
      {
        "name": "Máriás Nimród",
        "major": "Sapientia EMTE, Mechatronika szak, IV. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Tolvaly-Rosca Ferenc",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A Stirling-motor egy magas hatásfokú, ciklikus, zárt rendszerben lévő változó hőmérsékletű gáz összenyomásán és kiterjedésen alapuló hőerőgép. A rendszer szinte bármilyen típusú energiaforrást alkalmazhat a melegítésre, így a napenergiát is. Egy hélium gázzal töltött Stirling-motoros naperőmű- rendszer tervezése és kivitelezése kerül bemutatásra. Meggyőződésem, hogy a fosszilis energiaforrások fogyásával a Stirling-motor külső hőforrásaként a megújuló napenergiát használva teljesen környezetkímélő műszaki megoldást eredményez, amely az elkövetkező években folyamatosan növekvő fontosságra fog szert tenni.",
    "keywords": [],
    "generated_keywords": [
      "Stirling-motor",
      "Stirling-motoros naperőmű- rendszer tervezése",
      "hőmérsékletű gáz",
      "környezetkímélő műszaki",
      "így"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2015,
    "title": "Androidos eszközhöz csatlakoztatható ébresztőóra",
    "students": [
      {
        "name": "Kelemen Attila-Csaba",
        "major": "Sapientia EMTE, Számítástechnika szak, IV. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Domokos József",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozat egy ébresztőóráról szól, amely lényege, hogy Bluetooth segítségével Androidos készülékhez csatlakozik, amelyen az ébresztési időpontokat a felhasználó beállítja. Az óra rezgő jelzéssel ébreszt, így nem ébreszti fel a teljes családot. A vezérlést egy PIC18-as családú mikrovezérlő biztosítja. A kommunikációt egy Bluetooth modul vezérli. Az ébresztések tárolása Google Calendar segítségével történik, így akár személyi számítógépről is beállítható egy vagy több ébresztés. A szinkronizációról az okostelefon vagy táblagép gondoskodik. Az órától mindössze egy fogadás szükséges, ami a felhasználónak egy gombnyomásba kerül.",
    "keywords": [],
    "generated_keywords": [
      "Androidos",
      "Bluetooth",
      "Google Calendar",
      "így",
      "így akár személyi számítógépről"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2015,
    "title": "Modellrepülő autonóm vezérlési feladatának a megvalósítása",
    "students": [
      {
        "name": "Hegedűs Zsolt",
        "major": "Sapientia EMTE, Számítástechnika szak, IV. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Brassai Sándor Tihamér",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozat fő célja egy repülőmodellre integrált beágyazott rendszer és érzékelők segítségével meghatározni a repülő pozícióját és orientációját. Az orientáció és pozíció meghatározásának fontos szerepe van az autonóm pályakövetési feladatok megvalósításában. Beágyazott rendszerként egy SoC típusú újrakonfigurálható magot is tartalmazó Xilinx Zynq-7000 (Z- 7010) áramkör kerül alkalmazásra, az érzékelők a beágyazott processzor sínrendszerére vannak csatolva. A gyorsulásmérő, giroszkóp és magnetométer segítségével, figyelembe véve a Föld mágneses terét és a gravitációt, meghatározható a repülő orientációja a világkoordináta-rendszerhez képest. A pozíció meghatározásában alapvető szerepe van a rendszerbe integrált GPS-vevőnek és gyorsulásmérőnek. A két koordinátarendszernek a repülőhöz rendelt, illetve a világkoordináta-rendszer közötti elfordulását Euler- szögekkel írtam le. A pozíciót a Föld felszínén felvett NED (North-East-Down) azaz Észak-Kelet-Le koordinátarendszerhez viszonyított GPS-jelekkel határoztam meg. A dolgozatban bemutatásra kerül a kialakított hardver, az érzékelőknek a rendszerbe való integrálása, valamint az adatok beolvasása. A repülőgépről az érzékelők adatai egy rádiófrekvenciás modul segítségével kerülnek továbbításra az adatfeldolgozást végző számítógépre, ahol gradiens módszerrel történik a repülő orientációjának a meghatározása.",
    "keywords": [],
    "generated_keywords": [
      "Beágyazott",
      "Föld",
      "North-East-Down",
      "Xilinx Zynq-7000",
      "beágyazott processzor sínrendszerére"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2015,
    "title": "Tojásfestő robot",
    "students": [
      {
        "name": "Bala Zsolt",
        "major": "Sapientia EMTE, Számítástechnika szak, II. év"
      },
      {
        "name": "Kakucs Gergő",
        "major": "Sapientia EMTE, Számítástechnika szak, II. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Vajda Tamás",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozatunk célja egy tojásfestő robot megvalósítása. A robotot Lego Mindstorms NXT 2.0 felhasználásával valósítjuk meg. Három motort és nyomásérzékelőket használtunk a tojás forgatásához, az írószer mozgatásához, valamint a tojás formájának érzékeléséhez. Így a tojás tengelye körüli forgatásával, valamint az írószer vízszintes és horizontális mozgatásával festi fel a robot a kívánt mintát a tojás felületére. A robot egyszerre egy tojást tud kezelni. A robot vezérlésének a céljából egy Lego Mindstorms NXT 2.0 mikrokontrollert használtunk. Nyomáskapcsolók segítségével határozzuk meg a tojás felületének görbületét, amire szükségünk van a formák pontos kirajzolásához. Ugyancsak fontos a robot indítás előtti kalibrációja is. Az NXT kontrollert BricxCC -ben programozzuk, amely szintaxisában a C nyelvre hasonlít.",
    "keywords": [],
    "generated_keywords": [
      "BricxCC",
      "C",
      "Lego Mindstorms NXT",
      "NXT",
      "Így"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2015,
    "title": "LED-es toronyóra",
    "students": [
      {
        "name": "Szász Tamás-Attila",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika szak, II. év"
      },
      {
        "name": "Máthé Barna",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika szak, II. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Papp Sándor",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A LED-es toronyóránk a híres düsseldorfi tévétornyon látható óráról van mintázva, amelyen az időt egy LED- sorról olvashatjuk le. Azért választottuk ezt az órát makettünk alanyaként, mert nagyon látványos, ennek ellenére nem szokványos formában jeleníti meg a pontos időt. A makettünk a LED-sor mellett még fog tartalmazni egy LCD-kijelzőt is, amin szintén leolvashatjuk majd az időt, megkönnyítve a tanulási folyamatot. Az óra alapja egy 18F87k22-típusú PIC mikrovezérlő, amelyből az ADC modult, az MSSP modult, az EUSART modult, valamint a CCP modult fogjuk használni a makettünk elkészítésénél. A mikrovezérlő analóg-digitális átalakító egyik bemenetére egy fényérzékelő ellenállást kapcsolunk, így a környezeti fényerősség függvényében impulzusszélesség-modulációval változtatható a kijelző fényereje. A mikrovezérlő I2C Mester módban kommunikál egy DS1307 típusú Valós Idejű Órával (RTC), amelyből kiolvassa, illetve beírja a kívánt időt. Az órát számítógépről tudjuk beállítani a mikrovezérlő soros átviteli modulját felhasználva, valamint egy FT232-típusú USB-RS232 illesztő áramkört. Reményeink szerint, ha munkánk alapján az óra elnyeri az egyetemi közösség tetszését, felszerelhetjük nagy méretben az egyetemünk épületére.",
    "keywords": [],
    "generated_keywords": [
      "ADC",
      "Azért",
      "CCP",
      "DS1307",
      "EUSART"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2015,
    "title": "KUKA youBot manipulátor vezérlése saját tervezésű robotprogramozási nyelv segítségével",
    "students": [
      {
        "name": "Faluvégi Zsolt",
        "major": "Sapientia EMTE, Automatizálás szak, IV. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Márton Lőrinc",
        "university": "Sapientia EMTE, egyetemi docens"
      },
      {
        "name": "Szántó Zoltán",
        "university": "Sapientia EMTE, egyetemi tanársegéd"
      }
    ],
    "content": "A dolgozat célja egy olyan robotirányítási program megvalósításának bemutatása, amely a KUKA youBot mobilis platformra illesztett 5 szabadságfokú manipulátort egy saját fejlesztésű robotprogramozási nyelv segítségével vezérli. A megvalósított robotprogramozási nyelvben leírjuk a robot előírt mozgásszekvenciáját, megadjuk a csuklósebességeket, illetve csuklógyorsulásokat. Ezen adatok felhasználásával a megvalósított szoftver kigenerálja a robot előírt pályáját, amely egy követő szabályzó referencia jeleként szolgál. A pályakövetést megvalósító szabályozó biztosítja, hogy a robot végighaladjon az előírt pályán. A kifejlesztett robotirányítási program hatékonyságát valós idejű mérésekkel igazoljuk.",
    "keywords": [],
    "generated_keywords": [
      "Ezen",
      "KUKA"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2015,
    "title": "Phase Measurment alapú rádiós távolságmérés megvalósítása",
    "students": [
      {
        "name": "Szász Norbert-Attila",
        "major": "Sapientia EMTE, Távközlés szak, IV. év"
      }
    ],
    "teachers": [
      {
        "name": "Moldován István",
        "university": "Budapesti Műszaki és Gazdaságtudományi Egyetem, óraadó tanár"
      }
    ],
    "content": "A GPS elterjedésével egyre nő az igény a beltéri helymeghatározás iránt. Sajnos a GPS beltéren nem használható, ezért alternatív technológiára van szükség. A jelerősség alapú helymeghatározás az egyik alternatíva, azonban a többutas terjedés miatt technológiai korlátokba ütközik, és pontossága nem kielégítő. Ennél pontosabb helymeghatározás hardveres támogatást igényel. A gyártók felismerték ezt, így jött létre az Atmel AT86RF233 megoldása, amely ToA és PM technológiával jóval nagyobb pontosságot ígér. Dolgozatomban megépítek egy AT86RF233 alapú ISM sávban működő rádiós rendszert, amely képes Phase Measurment alapú távolságmérésre. A dolgozat célja a távolságmérési technológia kipróbálása, kiértékelése. Ennek a rendszernek a továbbfejlesztéseként egy beltéri helymeghatározási rendszernek a kiépítését vonhatja maga után. Kipróbálom a technológia alkalmazhatóságát, pontosságát különböző környezetekben, és meghatározom a korlátait. A mérések alapján kijelenthető, hogy a technológia a gyakorlatban a legtöbb alkalmazás számára kielégítő mérési pontosságot biztosít.",
    "keywords": [],
    "generated_keywords": [
      "AT86RF233",
      "Atmel AT86RF233",
      "ISM",
      "Phase Measurment",
      "ToA"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2015,
    "title": "iRoobo",
    "students": [
      {
        "name": "Gábor Szabolcs-László",
        "major": "Sapientia EMTE, Automatizálás szak, IV. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Brassai Sándor Tihamér",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozat célja mobilis tereprobot tervezése és megépítése. A mechanikai rendszer Autodesk Inventor- ban került megtervezésre, és az elkészített terv alapján kivitelezve. A következő részfeladat a vezérlő elektronika kialakításának a tervezése és a szenzoroknak a rendszerbe való integrálása volt. A rendszeren különböző szenzorok találhatók, amelyek közül talán a legfontosabb a sebesség és pozíció mérésére alkalmazott inkrementális jeladó, amelyeknek a tárcsáját INSKAPE vektorgrafikus programban szerkesztettem meg. A rendszeren megtalálható két FPGA fejlesztő lap, egy nagyobb erőforrásokkal rendelkező Zybo (beépített ARM processzorral), amely a matematikai számítások elvégzésére hivatott, és egy modell alapján a referenciajelet számolja a kisebb kapacitású FPGA lapon (SPARTAN3e500) hardveresen megvalósított szabályzóknak. A Spartan alapú FPGA lapon egy Microblaze processzor mellett fut 8 db. hardveresen megvalósított PID szabályozó, amelyek 8 db. 12V DC motor sebességét vagy pozícióját szabályozzák. A Microblaze processzor feladata az adatok fogadása a Zybo rendszerről, majd egy egyszerű feldolgozás után a megfelelő hardveres szabályzó osztónak a regiszterébe való írása. A Spartan laphoz van illesztve 8 db. inkrementális érzékelő, amelyek a motorok pozícióját, illetve sebességét mérik. A szenzorok adatait a Spartan lap egy gyors SPI kommunikáción keresztül küldi tovább a Zybo lapnak. A gyors hardveres PID szabályzó megvalósítása FPGA fejlesztőlapon Xilinx System Generator tervezőeszközzel készült, a szimulációkat hardver co-szimulációval végeztem el.",
    "keywords": [],
    "generated_keywords": [
      "ARM",
      "Autodesk Inventor-",
      "DC",
      "INSKAPE",
      "Microblaze"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2015,
    "title": "NI Elvis II didaktikai standra tervezett laborgyakorlatok",
    "students": [
      {
        "name": "Kovács Szabina Zsuzsanna",
        "major": "Sapientia EMTE, Távközlés szak, II. év"
      },
      {
        "name": "Varga Barna",
        "major": "Sapientia EMTE, Távközlés szak, II. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Domokos József",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      },
      {
        "name": "Dr. Papp Sándor",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozat célja olyan didaktikai elektronikus áramköröket tervezni, amelyek segítségével tanulmányozni lehet a műveleti erősítők különböző alapkapcsolásait: fázisfordító és nem fordító erősítők, invertáló és nem invertáló Schmitt-triggerek, valamint deriváló és integráló áramkörök. A dolgozatban bemutatjuk az NI Elvis didaktikai stand használatát és az NI ELVISmx szoftver nyújtotta lehetőségeket. Ugyanakkor bemutatjuk a nyomtatott áramkörök tervezésének és kivételezésének lépéseit, és elkészítjük a mérések elvégzéséhez szükséges dokumentációt.",
    "keywords": [],
    "generated_keywords": [
      "NI ELVISmx",
      "NI Elvis",
      "Ugyanakkor",
      "mérések"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2015,
    "title": "Felharmonikusok hatásai és mérése háromfázisú rendszerekben",
    "students": [
      {
        "name": "Molnár Elemér",
        "major": "Sapientia EMTE, Automatizálás szak, IV. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Kutasi Nimród",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      },
      {
        "name": "Dr. Papp Sándor",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Mindig is érdekeltek azok a jelenségek, amelyek valamilyen fizikai törvényszerűség miatt villamos készülékben alakulnak ki, olyan hatást kifejtve, hogy egy adott közegen továbbhaladva kisebb-nagyobb károkat, illetve meghibásodásokat eredményeznek. Napjainkban nagy erőfeszítéseket tesznek ezen jelenségek kiküszöbölésére, csökkentésére. Dolgozatom témájaként egy olyan rendszer megépítését választottam, amely során ezek a hatások mérések segítségével kimutathatóvá válnak. A mérési eredmények segítségével olyan rendszerek tervezése válik lehetővé, amelyek kiküszöbölik e jelenségeket. A készülék, amelyet megépítettünk, egy spektrumanalizátor. A mérőkészüléket háromfázisos rendszerekre terveztük. A dolgozatban olyan mérőeszközöket mutatok be, amelyek igen elterjedtek az automatikában, valamint ezek illesztési módszereit. Továbbá olyan fejlesztő eszköz is bemutatásra kerül, amely szükséges az adott mért jelek digitalizálására.",
    "keywords": [],
    "generated_keywords": [
      "alakulnak ki",
      "bemutatásra kerül",
      "jelek digitalizálására",
      "olyan hatást",
      "olyan rendszerek tervezése válik lehetővé"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2015,
    "title": "Wifi alapú tolmácsrendszer",
    "students": [
      {
        "name": "Szilágyi Ervin",
        "major": "Sapientia EMTE, Számítástechnika, IV. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Vajda Tamás",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozat célja egy költséghatékony tolmácsrendszer megvalósítása. A tolmácsrendszernek biztosítania kell, hogy a konferenciatermekben egyidejűleg több nyelven is hallgathassuk az ott elhangzó előadásokat. Ez úgy valósul meg, hogy az előadó által elmondottakat több tolmács azonnal fordítja különböző nyelvekre. A tolmácsrendszer a különböző nyelvekre lefordított hanganyagot kell eljuttassa a hallgatósághoz. Ahhoz, hogy költséghatékony legyen a rendszer, kialakítása során felhasználunk minden olyan eszközt, ami egy konferenciateremben amúgy is rendelkezésre áll. A tolmács szoftver egy platformfüggetlen kliensszerver architektúrára épül. A kommunikáció a szerver és a kliens között vezeték nélküli kapcsolaton keresztül történik, hagyományos bázisállomásokat (AccesPoint) felhasználva. A rendszer különböző kliensalkalmazásokat biztosít az előadás vételezésére a tolmácsoknak, valamint a hallgatóság részre. Ezeket a kliensalkalmazásokat a szerveralkalmazás szervezi rendszerré, valamint vezérli a kommunikációt úgy, hogy biztosítja a hangsávok minőségét egy olyan kapcsolat esetében is, amelyet internetezésre is használhatnak.",
    "keywords": [],
    "generated_keywords": [
      "AccesPoint",
      "Ahhoz",
      "biztosítja",
      "lefordított hanganyagot kell eljuttassa",
      "nélküli kapcsolaton"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2015,
    "title": "Remote Desktop Services és virtualizációs megoldások tesztelése költséghatékony számítógépes infrastruktúra kivitelezésére",
    "students": [
      {
        "name": "Darabont Örs",
        "major": "Sapientia EMTE, Távközlés, IV. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Domokos József",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A kutatás célja egy költséghatékony számítógépes infrastruktúra kialakítása. Ennek érdekében dolgozatomban bemutatom a megvalósított tesztkörnyezetet, és összehasonlítom technikai szempontból a Microsoft Remote Desktop Services szolgáltatást különböző virtualizációs megoldásokkal. A tesztek során a processzor terhelését, a memória lefoglalását és a merevlemezek teljesítményét mértem. A teszteléshez a Windows Server 2012 R2 operációs rendszerbe ágyazott Performance Monitor programot használtam a Remote Desktop Services és a Hyper-V virtualizáció esetében. A VMWare ESXI 6 és Citrix XenServer virtualizációs környezetek tesztelésekor a belső teljesítménymérőket vettem figyelembe. A mérési forgatókönyv a virtuális gépek indítását és a Matlab szoftvercsomag indítását foglalta magába. A dolgozat összefoglalója előtérbe helyezi a különböző megoldások közti különbséget, és kimutatja a technikailag legmegfelelőbb konfigurációt az infrastruktúra kivitelezésére.",
    "keywords": [],
    "generated_keywords": [
      "Citrix XenServer",
      "Matlab",
      "Microsoft Remote Desktop Services",
      "Performance Monitor",
      "Remote Desktop Services és a Hyper-V"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2015,
    "title": "Modellezés a matematika eszközeivel",
    "students": [
      {
        "name": "Lőrinczi Zoltán",
        "major": "Sapientia EMTE, Informatika szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Farkas Csaba",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatom témája a matematikai modellezés számítógép segítsége által. Napjainkban, de akár a közelmúltban számos olyan probléma merült fel a természetben vagy a különböző tudományágakban, amelyek nem oldhatóak meg egyszerű matematikai módszerekkel. Ezeknek a problémáknak a megoldására használunk absztrakt modelleket, e modellek megalkotásához fontos, hogy előzetes ismereteink legyenek (jellemzők, számokkal kifejezhető mutatók), amelyek leírják a problémát, annak változását az idő függvényében. Ilyen előzetes ismeretek segítségével eljutunk a probléma matematikai modelljéhez, amely rendszerint egy differenciálegyenlet vagy differenciálegyenlet-rendszer lesz. Az adott probléma megoldásához szükséges a kapott differenciálegyenlet(ek) megoldása is, ami egyes esetekben nem könnyű feladat, mivel ezeknek az egyenleteknek nagyon kis százaléka oldható meg integrálási módszerekkel (nem rendelkeznek képlettel felírható megoldással). Ekkor a számítógép segítségével különböző fokozatos közelítő módszerekkel, numerikus eljárásokkal próbálom a megoldás közelítő értékeit meghatározni. Végül ezen módszerek által adott megoldásokat, eredményeket tanulmányozom és vizsgálom.",
    "keywords": [],
    "generated_keywords": [
      "Dolgozatom",
      "Ekkor",
      "Ilyen",
      "Napjainkban",
      "leírják"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2015,
    "title": "Párhuzamos morfológiai vékonyítás sejtautomatákkal",
    "students": [
      {
        "name": "Keresztes Szabolcs",
        "major": "Sapientia EMTE, Informatika szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Iclănzan David",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Sok digitális képfeldolgozási algoritmus (pl. formafelismerés) alapja a morfológiai vékonyítás, melynek segítségével különböző alakzatokat egyszerűbb módon, vázszerűen lehet leírni. Egy objektum váza képpont vastagságú, és jól kell követnie az objektum alakját, annak közepén haladva, megőrizve a topologikus viszonyokat. A standard vázkijelölő algoritmusok bináris képeket dolgoznak fel. A binarizálás során számos lokális információ elvesztődhet. A dolgozatban a feladatot a sejtautomaták keretrendszerében tanulmányozom, mely megengedi egy gazdagabb diszkrét modell használatát, ahol a képpontokat feldolgozó sejteknek több mint két különféle állapotuk lehet. Ugyanakkor a hatékony párhuzamosítást is vizsgálom. Összegzésként, a vázkeresés problémája megközelíthető sejtautomatákkal, és a párhuzamosítás miatt kivitelezhető egy gyors algoritmus.",
    "keywords": [],
    "generated_keywords": [
      "Ugyanakkor",
      "egyszerűbb módon",
      "kell követnie",
      "morfológiai vékonyítás"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2015,
    "title": "Képválogatás okostelefonon",
    "students": [
      {
        "name": "Szabó Attila",
        "major": "Sapientia EMTE, Informatika szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Egyed-Zsigmond Előd",
        "university": "INSA Lyon, Franciaország, egyetemi adjunktus"
      }
    ],
    "content": "A mai mobiltelefonok egyik fontos tulajdonsága, hogy könnyen, gyorsan meg lehet örökíteni velük egy-egy pillanatot, eseményt. Ezekbe a készülékekbe egyre nagyobb és jobb kamerát igyekeznek bepréselni a gyártók; időközben egyre több a lehetőség és egyre egyszerűbb (főleg az okostelefonokon) a képeket módosítani, megosztani, biztonsági mentéseket létrehozni. Sok embernél az amatőr digitális kamerát már leváltotta a telefon, így mindössze egy érintésbe kerül egy kép elkészítése. Ami sokszor gondot okoz, az ezeknek a képeknek a rendszerezése és válogatása. A képhalmaz méretével arányosan nehezedik a feladat. Érdemes azt is figyelembe venni, hogy egy esemény (például egy kirándulás) után valószínűleg különböző személyeknek különböző képeket szeretnénk megmutatni, így a nehézség megtöbbszöröződik. Ki kell szűrni a sikertelen képeket, a hasonló vagy több példányban készült képeket, az alkalomhoz nem fűződő képeket, és ezek után kiválogatni személyre szólóan őket. Dolgozatom egy olyan alkalmazásról szól, amely a képválogatás folyamatát automatizálja, miközben a felhasználó szabadon befolyásolhatja a folyamat végkimenetelét. Ezt a kép készítésének körülményei, a kép tartalma, a célszeméllyel való kapcsolat alapján, illetve szemantikus források segítségével érem el. Mindemellett az alkalmazás a felhasználó visszacsatolása alapján alkalmazkodik a felhasználó elvárásaihoz. Első lépésként az arc- és személyfelismerés funkciókra összpontosítottam. Egy 2014-es felmérés alapján az okostelefonok 76,6%-án Android operációs rendszer fut. A rendszer népszerűsége, illetve a táborhoz tartozásom miatt az alkalmazást Androidos telefonra implementáltam.",
    "keywords": [],
    "generated_keywords": [
      "Android",
      "Androidos",
      "Ezekbe",
      "Mindemellett",
      "egy kirándulás"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2015,
    "title": "Online aláírás-felismerés",
    "students": [
      {
        "name": "Nagy Arthur",
        "major": "Sapientia EMTE, Informatika szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Antal Margit",
        "university": "Sapientia EMTE, Marosvásárhely, adjunktus"
      }
    ],
    "content": "A technológia fejlődésével rohamosan megnőtt az okos mobileszközt használók és így a megvédendő személyes adatok száma. Ezért kialakult az igény egy új módszerre, ami ezek megvédésére alkalmas (biometria). A modern, érintőképernyős okostelefonok lehetővé teszik az ujjal történő aláírások digitalizálását, továbbá az aláírás képi jellemzőin túl ennek dinamikai jellemzőit is rögzítik. A dolgozat célja egy olyan aláírás-ellenőrző szoftver bemutatása, amely alkalmazható a mai érintőképernyős eszközökön. Ennek megvalósítása érdekében különböző forma-felismerési módszerekkel próbálkoztam. A biometrikus felismerési módszereknek egy fontos előnyük van a klasszikus jelszavakkal szemben, éspedig az, hogy több információt tartalmaznak, mint az egyszerű jelszavak, ezért nehezebb lemásolni vagy feltörni. Az általam készített aláírás-ellenőrző szoftver formai és dinamikus jellemzők segítségével végzi az aláírás hitelesítését. Az aláírás látható (képi, formai) jellemzői lényegesen könnyebben utánozhatóak, mint a többnyire láthatatlan dinamikus jellemzők (sebesség, gyorsulás, ujjméret, idő, nyomás stb.), ezért a dinamikus jellemzők felhasználása az azonosításban várhatóan stabilabb, és ezért megbízhatóbb azonosítási eredményre vezet. Összefoglalva, az általam alkalmazott módszerek segítségével lehetőség nyílik érintőképernyős okostelefonokon a felhasználó hitelesítésére ujjal végzett aláírás alapján.",
    "keywords": [],
    "generated_keywords": [
      "Ezért",
      "aláírás alapján",
      "aláírás képi",
      "dinamikai jellemzőit",
      "gyorsulás"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2015,
    "title": "Markov clustering on CUDA",
    "students": [
      {
        "name": "Nagy Lajos Loránd",
        "major": "Sapientia EMTE, Számítástechnika szak, IV. év"
      },
      {
        "name": "Kali Gabriella",
        "major": "Sapientia EMTE, Számítástechnika szak, IV. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Szilágyi László",
        "university": "Sapientia EMTE, egyetemi tanár"
      }
    ],
    "content": "A dolgozat célja a processzoron már futó Markov-klaszterezés megvalósítása videokártyán. A Markov-klaszterezés proteineknek családokba, klaszterekbe való szervezését jelenti. A proteinek négyzetes mátrixokban vannak tárolva, float típusú számokként. A mátrixon normalizálást, inflációt, expanziót és szimmetrizálást végzünk több cikluson keresztül, és bizonyos számú ciklus után a mátrixban kisebb mátrixok különíthetőek el. Ezek a kisebb mátrixok a klaszterek. A CUDA-ban megírt Markov-klaszterezésnek két verziója van. Az első verzió nem tartalmaz semmilyen optimalizálást, kivéve a párhuzamosítást. Már ez a verzió is hatékonyabb idő alatt fut le, mint a processzorra megírt hasonló verzió. A második verzióban ritka mátrix van használva, amely miatt sokkal kevesebb idő alatt fut le a program. A ritka mátrix lényege, hogy csökkentjük a mátrix méretét, kizárjuk a nullásokat. A CUDA-n megírt programok hátránya a memória. Jelenleg a legnagyobb mátrix méretek 12032, míg a processzoron megírt programok képesek akár 100.000-es mátrixokat is lefuttatni.",
    "keywords": [],
    "generated_keywords": [
      "Jelenleg",
      "Markov-klaszterezés",
      "Markov-klaszterezésnek"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2015,
    "title": "Személyiségtípusok és az érintőképernyő használata közötti összefüggések",
    "students": [
      {
        "name": "Krausz Lóránt Szilveszter",
        "major": "Sapientia EMTE, Informatika szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Antal Margit",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatom célja megvizsgálni a személyiségtípusok és az érintőképernyő használata közötti összefüggéseket. Erre a célra egy olyan Android alkalmazást készítettem, amely az Eysenck-féle személyiségteszt kitöltése során rögzíti a felhasználók érintőképernyős interakcióit (érintési pozíció, nyomás, ujjal érintett terület mérete stb.). A teszt kitöltése kiértékeléssel zárul, és négy személyiségi kategória szerint értékeljük a felhasználót: extroverzió, neurocitás, rigiditás és őszinteség. A személyiségteszt összesen 58 kérdést tartalmaz. Minden egyes kérdés megválaszolása során a felhasználó egy vízszintes vonással adta meg, hogy milyen mértékben igaz rá vonatkozóan az adott állítás. Így minden felhasználótól legalább 58 vízszintes vonás keletkezett. Ezekből a vonásokból jellemzőket vontunk ki, amelyeket összevetünk a négy személyiségi kategóriával. A személyiségi kategóriákon túlmenően azt is vizsgáltuk, hogy a személy azonossága milyen pontossággal állapítható meg egy vonás alapján. A tesztet eddig 35 személy töltötte ki, és a Random Forests osztályozó egyetlen vízszintes vonás alapján 95%-os pontossággal azonosította a felhasználókat.",
    "keywords": [],
    "generated_keywords": [
      "Android",
      "Eysenck-féle",
      "Minden",
      "Random Forests",
      "igaz rá vonatkozóan"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2015,
    "title": "Közösségi háló elemzése",
    "students": [
      {
        "name": "Ozsváth Csilla",
        "major": "Sapientia EMTE, Informatika szak, III. év"
      },
      {
        "name": "Bogosi Roland",
        "major": "Sapientia EMTE, Számítástechnika szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Jánosi Rancz Katalin Tünde",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Fejlődő világunkban egyre nagyobb népszerűségnek örvend a közösségi hálók világa. Egyre több ember használja őket szórakozásra, kapcsolattartásra vagy csak egyszerű időtöltésre. Innen jött az ötlet, hogy ezen emberek érzelmi világát elemezzük a közösségi hálón keresztül. A sokféle közösségi háló közül a Facebookot választottuk erre a célra. A kutatás célja egy sentiment-analysis (érzelem-elemző) alkalmazás, amely a szociális halók felhasználói által generált tartalomról, amelyek valamilyen szubjektív véleményt tartalmaznak, eldönti, hogy milyen érzetet/érzéseket kelt a címzettben. A módszer feltérképezi a bejegyzéseket, elhelyezi valamilyen skálán, majd összesíti az eredményeket. Az adathalmaz elemzése az üzenetek pozitív vagy negatív töltetének automatikus eldöntésén alapszik, amit feltérképezni, esetleg manipulálni kulcsfontosságú lehet. Célunk egy sokoldalú eszköz kifejlesztése. Felhasználási területei közt szerepelhet egy új piaci termék népszerűségének meghatározása, társadalompszichológiai kutatások segítsége vagy lelki segélyre szoruló emberek kiszűrése a szociális hálóból.",
    "keywords": [],
    "generated_keywords": [
      "Egyre",
      "Facebookot",
      "Felhasználási",
      "eldöntésén alapszik",
      "emberek kiszűrése"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2015,
    "title": "Szemantikus adatletöltés",
    "students": [
      {
        "name": "Gergely Barna",
        "major": "Sapientia EMTE, Informatika szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Jánosi-Rancz Katalin Tünde",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjainkban egyre elterjedtebb az internet használata a mindennapi életben. Megközelítőleg 1,5 milliárd ember van rácsatlakozva nap mint nap a 20. századvég eme csodájára, amely a megfelelő felhasználással megkönnyíti hétköznapi életünket. Az internet tágas körű lehetőséget tár elénk, ilyen például a közösségi háló, távoli rokonokkal, illetve barátokkal való kapcsolattartás, gyors információáramlás, online vásárlás. Ezek az adatok mind-mind el vannak valahol tárolva. Dolgozatom célja ezen adatokból fontos információk kinyerése, rendezett eltárolása, rangsorolása és információ gyűjtése. Az adatok gyűjtése során különböző weboldalakról gyűjtök információkat. Ezt követően az adatok rangsorolásra kerülnek, amelyekből következtetéseket fogok levonni. A dolgozat lényege az, hogy megkönnyítse a weboldalakon való keresgélést azáltal, hogy az általam előzőleg összegyűjtött, majd rendezett adatok között kutatok. Időt és energiát spórolva megtalálhatom a keresett adatokat ahelyett, hogy számos weboldalt átböngésznék.",
    "keywords": [],
    "generated_keywords": [
      "Napjainkban",
      "rendezett adatok között kutatok",
      "rendezett eltárolása"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2015,
    "title": "Szinusz függvény megközelítése értéktáblázatok felhasználásával",
    "students": [
      {
        "name": "Kántor Zsolt",
        "major": "Sapientia EMTE, Számítástechnika szak, I. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Kupán Pál",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "A kutatás célja a szinusz függvény kiértékelésének gyorsítása olyan helyzetekben, ahol a pontosságnál fontosabb a sebesség. Ennek alapját egy értéktáblázat (lookup table) képezi, erre épülnek a különféle interpolációs megoldások. A kutatás több programozási környezetet vizsgál, és a lehetséges felhasználási köröket is tárgyalja.",
    "keywords": [],
    "generated_keywords": [
      "olyan"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2015,
    "title": "„sapiFal” - üzenőfal alkalmazás Androidos telefonokra",
    "students": [
      {
        "name": "Árvai Szabolcs",
        "major": "Sapientia EMTE, Informatika szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Jánosi-Rancz Katalin Tünde",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "22 évvel ezelőtt egy fiatalember először küldött szöveges üzenetet mobiltelefonra. Az első rövid szöveges üzenet elküldése új irányba terelte a mobiltelefon-piacot, amely a telefonálás mellett megannyi funkcióval rendelkezik. Telefonunk a mindennapi életünk részévé vált, akár a hagyományos telefonálásra, chatelésre, esetleg a közösségi háló használatára gondolunk. Okostelefonjainkról chatprogramok színes skáláján válogatva, hatalmas távolságokból üzenhetünk családtagjainknak, barátainknak. Dolgozatom célja egy Android applikáció, amely közelebb hozza egymáshoz a Sapientiás diákokat, illetve megold néhány régi problémát. Az alkalmazásom neve „sapiFal”, ami üzenőfalhoz hasonló módon teszi lehetővé az információ megosztását az egyetemi közösséggel, évfolyamokkal, vagy akár baráti társaságokkal. Ki ne szeretné tudni éppen, mi újság van a kampuszon, mikor osztják az ösztöndíjat, érdemes-e kimenni a buszhoz, van-e még ebéd a menzán. Az Android adta lehetőségek segítségével ez mind elérhetővé válik. A Sapientia kampuszán történő regisztrálás, bejelentkezés után azonnal lehetőség nyílik új „falat” létrehozni, vagy csatlakozni a már meglévőkre, továbbá lehetőség van beállítani, mely falakról szeretnénk azonnali értesítéseket kapni. Az alkalmazás használatára Android 4.0, illetve újabb operációs rendszerrel rendelkező okostelefonra van szükség.",
    "keywords": [],
    "generated_keywords": [
      "Android",
      "Az Android",
      "Sapientia",
      "Sapientiás",
      "Telefonunk"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2015,
    "title": "Automata fonetikus átírás és hangsúlybecslés",
    "students": [
      {
        "name": "Bondor Dávid",
        "major": "Sapientia EMTE, Távközlés szak, II. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Domokos József",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozat célja egy véges állapotú szekvenciális automatákból álló rendszer betanítása fonetikus átírásra. A fonetikai átírás mellet a célunk az, hogy ugyanaz a rendszer képes legyen a szavak szintjén a hangsúly pozíciójának a becslésére is. A dolgozatban bemutatjuk a Phonetisaurus fonetikus átíró alkalmazást, a véges állapotú szekvenciális automata tanítását román nyelvű szavak átírására, illetve a betanított modell tesztelését. Ugyanakkor teszteljük, hogy a Phonetisaurus alkalmazás mennyire hatékonyan tudja elvégezni a szavak szintjén a hangsúly pozíciójának a becslését.",
    "keywords": [],
    "generated_keywords": [
      "Phonetisaurus",
      "Ugyanakkor"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2015,
    "title": "A placc, amely teret ad",
    "students": [
      {
        "name": "André Krisztina Sarolta",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, I. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gagyi József",
        "university": "Sapientia EMTE, egyetemi tanár"
      }
    ],
    "content": "Dolgozatom célja a Sapientia EMTE marosvásárhelyi kampusz büfé előtti tere, azaz a „placc” kommunikatív szerepének a bemutatása, a terület hallgatók életében betöltött szerepének vizsgálata. A hallgatók térhasználatát, a placc kommunikatív szerepét megfigyelés, illetve fókuszcsoportos interjú segítségével vizsgáltam. Megfigyelés során öt napon keresztül háromszor, délben, egykor és kettőkor fényképeket készítettem a placc életéről. Ezeket a képeken a hallgatók dohányzási szokásait, az egyének és a csoportok működését, a nonverbális kommunikációt és ezek üzenetét vizsgáltam. Egyetemünk hallgatóinak mindennapjaiban a placc nagy jelentőséggel bír: mind a térhasználatot, mint az egyéni, illetve csoportos megnyilvánulásokat tekintve másként működik, mint a kampusz egyéb terei.",
    "keywords": [],
    "generated_keywords": [
      "Egyetemünk",
      "Sapientia",
      "csoportok",
      "kampusz egyéb terei",
      "nonverbális kommunikációt"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2015,
    "title": "Egyetemi hallgatók a Facebookon",
    "students": [
      {
        "name": "Portik Tímea Andrea",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, I. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Tőkés Gyöngyvér",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozatom célja a Sapientiás hallgatók online és offline identitásának a vizsgálata, illetve ezen identitások hasonlóságának és különbségének megfigyelése. A problémakatalógus összeállításához a Sapientia egyetem Műszaki és Humántudományok Karának három évfolyamáról 12 személyt választottam ki, 6 fiút és 6 lányt. A vizsgálatot minőségi módszer segítségével végeztem el. Első körben strukturálatlan interjú kapcsán beszélgettem az alanyokkal, második körben tartalomelemzést végeztem a felkért hallgatók Facebook-profilján, emellett egy személyiségteszt kitöltésére is sor került. Hipotéziseim alapján a kutatás eredménye kimutatja majd, hogy a felkért egyetemi hallgatók online identitása tükrözi-e az offline identitásukat.",
    "keywords": [],
    "generated_keywords": [
      "Facebook-profilján",
      "Humántudományok Karának",
      "Műszaki",
      "Sapientia",
      "Sapientiás"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2015,
    "title": "Platánok, örökség, szimbólum. A platánok szerepe a barokk kertekben és a modern városi terek alakításában",
    "students": [
      {
        "name": "Orbán Kincső Tünde",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, II. év"
      },
      {
        "name": "Szegedi Henrietta",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, II. év"
      },
      {
        "name": "Deák Zsombor Levente",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, II. év"
      },
      {
        "name": "Stefan Renáta",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, II. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gagyi József",
        "university": "Sapientia EMTE, egyetemi tanár"
      }
    ],
    "content": "Dolgozatunk egy csoportos akciósorozat része, amely közel fél évet ölelt fel, és több ember munkáját foglalja magába. Célunk az volt, hogy a környezetünkben még fellelhető platánfák kilétét felkutassuk és megvizsgáljuk szerepüket, vagyis hogy miként is kommunikálnak a városok betonrengetegei, a sétányok és a tiszteletet parancsoló több évtizedes múltra visszatekintő környezetekben. Örökségként értelmezzük mindazon szellemi és tárgyi javakat, hagyományokat, amelyeket az idők hosszú során elődeink hagytak ránk. A minket körülvevő környezet is mind örökségként értelmezhető, a múltunk hamvából sarjad a jövő, amelyekben a platánfák a városok megszelídített őrzőiként magasodnak fölénk évtizedek óta.",
    "keywords": [],
    "generated_keywords": [
      "fél",
      "évtizedek óta"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2015,
    "title": "Grafikai és felhasználóbarát megoldások weboldalak sikerességének szolgálatában",
    "students": [
      {
        "name": "Miska Brigitta",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fülöp Otília",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A XXI. századba lépve mind a magánszemélyeknek, mind pedig a különböző szervezeteknek, szövetségeknek és cégeknek fontossá vált, hogy vállalkozásuk az online marketing segítségével az interneten is versenyre kellhessen a konkurenciával. Egyre sokrétűbb audiovizuális technikák váltak elérhetővé, így ezen módszerek elterjedésével egy időben a gondosan megtervezett felépítésű weboldalakra is megnőtt az igény. Manapság nagy szerepet játszik a weboldalaknál a megjelenés, a külső. Dolgozatom célja volt megmutatni két nagy sportszövetség weboldalának pozitív és negatív oldalát, ezeket szembeállítva pedig kontrasztot teremteni a design és a használatóság terén. Egy weboldal működésének sikere nagyban függ az általa képviselt tartalomtól, az azt irányító csoporttól. Az online felületen való jelenlét azonban ennél sokkal többről szól, egy weboldal fenntartása komplex és odafigyelést, hozzáértést igényel. Igyekeztem fényt deríteni a grafikai és a felhasználóbarát weboldalak sikerességének hátterére. Az olvasott szakirodalom szerint meghatározott szempontrendszer alapján elemeztem a Nemzeti Kosárlabda Szövetség (NBA) és a World Snooker honlapját. Az elemzés után arra a következtetésre jutottam, hogy az NBA honlapja messzemenően meghaladja a World Snooker weblapját, így nem kérdés, hogy nagyon sok olyan felhasználóbarát és figyelemfelkeltő elemet használ, melyeket más honlapok üzemeltetőinek is ajánlott lenne alkalmazni a felhasználók számának növelése érdekében.",
    "keywords": [],
    "generated_keywords": [
      "Dolgozatom",
      "Manapság",
      "NBA",
      "Nemzeti Kosárlabda Szövetség",
      "World Snooker"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2015,
    "title": "Reklámkampány-tervezet egy induló Waldorf-óvoda népszerűsítésére",
    "students": [
      {
        "name": "Toriay Szidónia",
        "major": "Sapientia, Kommunikáció és közkapcsolatok szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Zsigmond István",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozatomban egy reklámkampányt készítek Gyergyószentmiklós első Waldorf- és egyben első magánóvodájának, a Fenyőmag Gyerekfoglalkoztató Központnak. A kampány célja az intézmény népszerűsítése, az emberek tájékoztatása. Első lépesben összeállítottam egy interjút, elkészítettem azt az alapítókkal, Eperjessy Kinga Margittal és Sajgó Vormair Kamillával. Ezekből az interjúkból kaptam meg a számomra lényeges információkat, mint például hogy mik az óvoda erősségei, vagy hogy mi a tulajdonosok víziója és missziója. Az anyaggyűjtés és az elméleti rész megírása után következett a konkrét reklámkampány megtervezése. A kampány három tömegkommunikációs eszközön keresztül fog eljutni az emberekhez. Ezek az eszközök nem mások, mint a televízió, a rádió és a nyomatott plakát. Egy helyi televíziós csatorna, a Gyergyó Tv, valamint egy helyi rádió, a MixFm fogja közvetíteni a reklámokat. A plakátok megjelennek majd a város minden pontján, és a Fenyőmag Facebook oldalán is. Így teljes lesz a lefedettség, és várhatóan a célközönséget teljes mértékben el tudjuk érni. Amennyiben a kampány sikeres lesz, az emberek érdeklődése megnő az óvoda felé, és várhatóan felkeresik az intézményt vagy az ott tanító pedagógusokat. Ugyanakkor, ha a reklámkampány eléri célját, az óvoda megnyithatja kapuit, és számtalan gyereket vezethet be a Waldorf-oktatás különleges és játékos világába.",
    "keywords": [],
    "generated_keywords": [
      "Eperjessy Kinga Margittal",
      "Fenyőmag Facebook",
      "Fenyőmag Gyerekfoglalkoztató Központnak",
      "Gyergyó Tv",
      "Gyergyószentmiklós"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2015,
    "title": "Mátyás király a népi kultúrában, a populáris kultúrában és a reklámban",
    "students": [
      {
        "name": "Márton Kinga Izabella",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gagyi József Pál",
        "university": "Sapientia EMTE, egyetemi tanár"
      }
    ],
    "content": "A Mátyás-hagyomány állandó megújulásának, aktualizálásának és mindig a legújabb médiumokon keresztül való terjesztésének köszönhetően évszázadokon át képes volt élni, fennmaradni. Ennek eredményeként Hunyadi Mátyás király alakja kiemelkedő szerepet tölt be mind a magyar népi és populáris kultúrában, mind a kollektív köztudatban. Jelen dolgozat célja nagy vonalakban felvázolni a Mátyás-kultusz kialakulását a népi kultúrában, valamint e kultusz mediatizálását a populáris kultúra néhány műfajában (film, rajzfilm, képregény stb.), majd ezt összehasonlítani egy elemzett, 2008-as Erste-reklámmal, melynek főszereplője a király. A reklám elemzésére tartalomelemzés módszerével kerül sor, mely alkalmazása során vizsgálni és értelmezni fogom a reklám üzenetét, narratíváit, sztereotip képeit. A dolgozat emellett bemutatja a népi és a populáris kultúra érintkezését az adott reklámban.",
    "keywords": [],
    "generated_keywords": [
      "Hunyadi Mátyás",
      "Jelen",
      "Mátyás-hagyomány",
      "Mátyás-kultusz kialakulását",
      "kultusz mediatizálását"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2015,
    "title": "magyar. Több mint konyha: a közösség szíve",
    "students": [
      {
        "name": "Szőcs Tamara",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, I. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gagyi József",
        "university": "Sapientia EMTE, egyetemi tanár"
      }
    ],
    "content": "Dolgozatom témája a marosvásárhelyi Sapientia Erdélyi Magyar Tudományegyetem újonnan épült bentlakásának első emeleti konyhája. Kutatásom célja ezen helyiség közösségformáló erejének, valamint kommunikatív szerepének felderítése. Munkámat öt egységre bontottam. Az első részben bemutatom magát az épületet, a második részben sor kerül az általam kiválasztott témára, annak elméleti hátterére; a harmadik részben a terepmunka bemutatására, a negyedik részben pedig a kutatásom eredményeire, kiértékelésére kerül sor. Végezetül az ötödik részben saját konklúzióimat ismertetem. Megfigyeléseim során kiderült, mennyire fontos szerepet tölt be ez a helyiség a bentlakók életében, nemcsak kulturális, hanem szociális és társadalmi tevékenységekre nézve is.",
    "keywords": [],
    "generated_keywords": [
      "Dolgozatom",
      "Megfigyeléseim",
      "Sapientia Erdélyi Magyar Tudományegyetem",
      "Végezetül",
      "hanem szociális"
    ]
  },
  {
    "major": "Közegészségügy és egészségügyi szakpolitikák",
    "year": 2015,
    "title": "Az apák szerepe a szülés utáni depresszió megelőzésében",
    "students": [
      {
        "name": "Szalay Tünde",
        "major": "Sapientia EMTE, Közegészségügyi szakpolitikák és szolgáltatások szak, II. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Lukács-Márton Réka",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A szülés utáni állapot különösen megterhelő az anyának, ugyanakkor ez az új élethelyzet az apa irányába is sok elvárást állít. Mint tudjuk, a szülés utáni depresszió kialakulásában számos tényező játszik szerepet (az anya életkora, társadalmi helyzete, szociális támogatottsága, depressziós előélet stb.), de ugyanakkor a támogató rendszerek megléte különös szerepet kap a depresszió elleni küzdelemben. Egy ilyen támogató rendszer az apa aktív jelenléte a gyereknevelési folyamatban. Az általam vizsgált populáció 40 marosvásárhelyi és gernyeszegi apa, akiknek 10 éven aluli gyerekük van. A vizsgálati alanyok kiválasztása véletlenszerűen történt, kérdőíves módszert alkalmazva az apák gyereknevelési szokásait, valamint támogató részvételüket tekintve. Vizsgálatom célja felmérni azt a tényt, hogy az apák milyen szintű részvételt vállalnak a gyereknevelésben.",
    "keywords": [],
    "generated_keywords": [
      "előélet stb.",
      "játszik szerepet",
      "különös szerepet"
    ]
  },
  {
    "major": "Közegészségügy és egészségügyi szakpolitikák",
    "year": 2015,
    "title": "Kovászna megyei fiatalok élettel és egészségükkel való elégedettségének vizsgálata",
    "students": [
      {
        "name": "Máté Szende",
        "major": "Sapientia EMTE, Közegészségügyi szakpolitikák és szolgáltatások szak, II. év"
      }
    ],
    "teachers": [
      {
        "name": "Horváth Zsófia",
        "university": "Sapientia EMTE, egyetemi tanársegéd"
      }
    ],
    "content": "Vizsgálatom célja a Kovászna megyében élő fiatalok és felnőttek élettel való elégedettségének mérése, valamint az életkori, iskolázottsági szintből adódó különbségeknek feltárása. Az egyén egészséggel összefüggő életminősége azt fejezi ki, hogy a személy hogyan értékeli és mennyire elégedett jelenlegi funkcióival (tevékenységeivel és életvezetésével) ahhoz viszonyítva, hogy mit tart lehetségesnek vagy ideálisnak (Kopp és Strabski, 1992). Tapasztalataim azt mutatják, hogy az idő előrehaladtával a reménytelenség, kilátástalanság állapota egyre inkább előtérbe kerül, elvesztődik a kontroll az élet irányítása felett, és ebből az állapotból való kilépés esélytelennek tűnik. Dolgozatomban vizsgálom a fiatalok jövőre irányuló életcéljait, illetve ezek összefüggését az élettel és egészséggel való elégedettséggel. A vizsgálati minta 80 személyből áll, közülük 40 fiatal felnőtt (20-30 év) és 40 felnőtt (30-40 év). Eszközként a Crumbaugh és Maholick-féle Életcél Kérdőívet használtam, és az adatokat az SPSS statisztikai programban elemezve dolgozom fel.",
    "keywords": [],
    "generated_keywords": [
      "Crumbaugh",
      "Kopp és Strabski",
      "Kovászna",
      "SPSS",
      "fejezi ki"
    ]
  },
  {
    "major": "Közegészségügy és egészségügyi szakpolitikák",
    "year": 2015,
    "title": "Fiatalok cukor- és édességfogyasztási szokásainak vizsgálata",
    "students": [
      {
        "name": "Cîmpean Klementina",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és szakpolitikák szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Horváth Zsófia",
        "university": "Sapientia EMTE, egyetemi tanársegéd"
      }
    ],
    "content": "Dolgozatomban a középiskolás és egyetemista diákok cukor- és édességfogyasztási szokásait vizsgálom. Napjainkban megnőtt a cukor használata, mivel egyre több élelmiszer, üdítőital tartalmaz valamilyen édesítőszert, és ez a későbbiekben elhízáshoz, a fogak romlásához, különböző krónikus betegségek kialakulásához vezethet. Vizsgálatom empirikus részét a marosvásárhelyi Bolyai Farkas Elméleti Líceum és az Elektromaros Technológiai Líceum kilenc és tizedik osztályos diákjai, illetve a Sapientia Erdélyi Magyar Tudományegyetem Műszaki és Humántudományok Kar és a Marosvásárhelyi Orvosi és Gyógyszerészeti Egyetem hallgatói körében végeztem 2015-ben. Célom, hogy felmérjem és megvizsgáljam a marosvásárhelyi fiatalok cukor- és édességfogyasztási szokásait. Kérdőíves módszerrel vizsgáltam a 200 személyből álló mintát, az eredményeket az SPSS statisztikai program segítségével dolgoztam fel. Eredményeim alapján kijelenthetem, hogy a marosvásárhelyi középiskolások és az egyetemista diákok gyakran fogyasztanak cukrot, illetve édességet: a megkérdezett diákok 79,5%-a fogyaszt édességet étkezések után, 71,4%-a étkezések között, 84,0%-a fogyaszt üdítőitalt, míg az egyetemisták 51,5%-a három vagy annál több kiskanál cukorral fogyasztja teáját, kávéját. Egy kis odafigyeléssel korlátozni lehet a cukorbeviteli mennyiséget, mely egy egészséges életmód alapjait képezi.",
    "keywords": [],
    "generated_keywords": [
      "Bolyai Farkas Elméleti Líceum",
      "Elektromaros Technológiai Líceum",
      "Eredményeim",
      "Gyógyszerészeti Egyetem",
      "Humántudományok Kar"
    ]
  },
  {
    "major": "Közegészségügy és egészségügyi szakpolitikák",
    "year": 2015,
    "title": "Egyetemisták pályaorientációja az elhivatottság tükrében",
    "students": [
      {
        "name": "Kovács Noémi Anasztázia",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és szakpolitikák szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Sántha Ágnes",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezető: Az emberi lét velejárója a fejlődés, a tanulás, önmagunk képzése. Mindenki életében eljön a pillanat, amikor döntenie kell arról, hogy felnőttként hogyan fog élni, mivel fogja tölteni mindennapjait. A pályaválasztás életünk egyik legnehezebb, ugyanakkor legmeghatározóbb döntése. Befolyásolhatják megérzések, élettapasztalatok, az érdeklődési kör, de akár a szülők vagy ismerősök is. Módszerek: A pontosabb megismerés érdekében kétféle módszerrel dolgoztam. Kvantitatív vizsgálatomhoz kérdőívet állítottam össze a pályaválasztásról, példaképekről, tanulási-, illetve óralátogatási szokásokról, amelyre közel 200 hallgató válaszolt. A kérdőíves kutatás megalapozásához, illetve kiegészítéséhez, néhány befolyásoló tényező behatóbb megismeréséhez interjúkat vettem fel egyetemi hallgatókkal. Eredmények: A kutatás során kiderült, hogy a megkérdezett egyetemisták több mint felének van példaképe, aki az orvostanhallgatók esetében gyakran maga is orvos. Az orvostanhallgatók közel 90%-a rendszeresen bejár a tanórákra, és több mint fele önkéntes munkát végez leendő szakmájában. A műszakis diákok döntését nagyban befolyásolta a szakma iránti érdeklődés, a számítógépek szeretete, illetve a munkájukért járó magas juttatás reménye is. Következtetések: A kutatásban résztvevők válaszai alapján arra a következtetésre jutottam, hogy az elhivatottság és az érdeklődés fontos szereppel bír a pályaválasztási döntés meghozatalában, illetve az orvostanhallgatók esetében fontos megemlíteni a családi minta jelenlétének erejét is.",
    "keywords": [],
    "generated_keywords": [
      "Befolyásolhatják",
      "Kvantitatív",
      "Következtetések",
      "Mindenki",
      "Módszerek"
    ]
  },
  {
    "major": "Közegészségügy és egészségügyi szakpolitikák",
    "year": 2015,
    "title": "mérnök, programozó Az idősek életminősége",
    "students": [
      {
        "name": "Simon Izabella-Erika",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és szakpolitikák szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Sántha Ágnes",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A világ fejlett országaiban növekszik az idősek népességbeli aránya, az időskor ezáltal megkülönböztetett fontosságú életszakasszá válik. Ebben a kiszolgáltatottsággal is járó életkorban nagy odafigyelést igényelnek idős embertársaink. Kutatásom célja az időskorúak életminőségének vizsgálata. Az életminőség összetevői között a következőkre fektetek különös hangsúlyt: a társas kapcsolatok mennyisége és minősége, a közösségi integráció, a mindennapi környezetben betöltött szerep megélése, valamint az egyéni élethelyzet megítélése, nem utolsó sorban az élettel és az egészségi állapottal való általános elégedettség. Az empirikus felmérés kérdőíves módszerrel készült. Az adatgyűjtés a 65 éven felüli, városi és falusi környezetben élő idősek körében történt. Vizsgálati populációm 150 alanyból áll, melyben a nők aránya nagyobb. Kutatásom egyik fő eredménye, hogy az átlagosnál gyengébb anyagi helyzetű idősek társas aktivitása sokkal alacsonyabb szintű, közösségi integrációjuk gyengébb, mint azoké, akik átlagos vagy annál is jobb anyagi helyzetről számolnak be.",
    "keywords": [],
    "generated_keywords": [
      "Kutatásom",
      "betöltött szerep megélése",
      "átlagosnál gyengébb anyagi"
    ]
  },
  {
    "major": "Közegészségügy és egészségügyi szakpolitikák",
    "year": 2015,
    "title": "állapot Munka és a család összeegyeztetése az anyák életében",
    "students": [
      {
        "name": "Mátyás Kinga- Noémi",
        "major": "Sapientia EMTE, Egészségügyi szakpolitikák és szolgáltatások szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Sántha Ágnes",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A munka és a család két olyan összetevője az életünknek, amely a legnagyobb formáló erővel bír (Mészáros, 2006). Dolgozatom elméleti hátterében a nők társadalmi szerepét valamint a kettős – munkahelyi és magánéleti – szerep egymásra ható tényezőit, koronkénti megnyilvánulásait tártam fel. Kérdőíves módszerrel vizsgáltam a munka és a család összeegyeztetésének körülményeit 160 olyan édesanya körében, akik munkaviszonyban állnak, ugyanakkor 0-10 év közötti gyermek(ek)et nevelnek. Az eredményeket SPSS statisztikai program segítségével dolgoztam fel. Vizsgálatom értékes eredményének tartom, hogy sikerült feltárni a gyermeknevelésben nyújtott családi segítség meghatározó jelentőségét a munka és magánélet egyensúlyának kialakításában, továbbá az értelmiségi apák szerepvállalását a családi életben, mely az anyák túlterheltségét mérsékeli. Vizsgálatom révén számokban is kifejezhetővé válik a dolgozó édesanyák napjainkban megtapasztalt helyzete a kettős szerep teljesítése során.",
    "keywords": [],
    "generated_keywords": [
      "Kérdőíves",
      "Mészáros",
      "SPSS",
      "koronkénti",
      "teljesítése során"
    ]
  },
  {
    "major": "Közegészségügy és egészségügyi szakpolitikák",
    "year": 2015,
    "title": "A marosvásárhelyi egyetemisták életminősége",
    "students": [
      {
        "name": "Kocsis Enikő-Orsolya",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és szakpolitikák szak, III. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Vaslobán Éva",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Az életminőség fogalmának a meghatározása bonyolult feladat, nincs egy általánosan elfogadott meghatározása. Ugyanakkor egy többdimenziójú fogalom, amely magába foglalja az egészségi állapot testi- lelki és szociális összetevőit (Kopp, 2006). Jelen vizsgálat célja a marosvásárhelyi egyetemisták életminőségének a felmérése, valamint annak a feltérképezése, hogy az egyetem elvégzése után itthon, Romániában, vagy külföldön képzelik el a jövőjüket. A megkérdezettek a következő egyetemekről kerültek ki: Marosvásárhelyi Orvosi és Gyógyszerészeti Egyetem, Petru Maior Tudományegyetem, Sapientia EMTE, Dimitrie Cantemir Tudományegyetem, Marosvásárhelyi Művészeti Egyetem. A 100 személyből álló mintát kérdőíves módszerrel vizsgáltam. Következtetésként elmondhatom, hogy az élettel való elégedettséget a szubjektív anyagi helyzet befolyásolja. Mottó: „A legnagyobb érték nem az, hogy élünk, hanem az, hogy jól élünk.” Szókratész",
    "keywords": [],
    "generated_keywords": [
      "Dimitrie Cantemir Tudományegyetem",
      "Gyógyszerészeti Egyetem",
      "Jelen",
      "Kopp",
      "Marosvásárhelyi Művészeti Egyetem"
    ]
  },
  {
    "major": "Közegészségügy és egészségügyi szakpolitikák",
    "year": 2015,
    "title": "A Facebook hatása a párkapcsolatokra",
    "students": [
      {
        "name": "Burian Erika",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, II. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Kovács Réka Rozália",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Mottó:„Egy jó kapcsolatban ötször annyi a pozitív érzelmi interakció, mint a negatív. (...) Nem számít, hogy egy pár naponta tízszer hajba kap-e vagy sem, a lényeg ez az arány. Hogy ötször annyi időt töltsenek együtt szeretetben, gyengédségben, humorral és kedvességgel.”(Tari Annamária) Dolgozatomban azt vizsgálom meg, hogy milyen mértékben hat a Facebook a párkapcsolatok alakulására. Főként a fiatalok nap mint nap, rendszeresen használják a Facebookot, itt posztolják ki, hogy mi történt velük, hogy érzik magukat, vagy éppen hol vannak, és mivel foglalkoznak. A Facebook azonban káros hatással is lehet ránk, befolyásolhatja gondolatmenetünket, érzelemvilágunkat vagy akár párkapcsolatunkat is. Kutatásom során a fiatal párok párkapcsolataira, ezen belül pedig a Facebook hatására fókuszálok. Az elméleti bevezetőben részletezem a párkapcsolatra való alkalmasság kialakulását, taglalom egy jól működő párkapcsolat lehetséges alapjait, majd kitérek a párkapcsolati érettség fontosságára, ugyanakkor figyelembe veszem azt is, hogy milyen hatással van a Facebook a párkapcsolatok minőségére, esetleg befolyásolja-e a párkapcsolatok alakulását, végül a kérdőíves vizsgálat bemutatása következik.",
    "keywords": [],
    "generated_keywords": [
      "Facebook",
      "Facebookot",
      "Főként",
      "Kutatásom",
      "Mottó:„Egy"
    ]
  },
  {
    "major": "Közegészségügy és egészségügyi szakpolitikák",
    "year": 2015,
    "title": "Facebook. Az emlődaganatok szűrésének fontossága a középkorú nők körében",
    "students": [
      {
        "name": "Adorjáni Emese",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, II. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Molnár-Sántha Ágnes",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatom célja felhívni a figyelmet az orvosi szűrővizsgálatok fontosságára. A tanulmány középpontjában az emlődaganatok szűrésének jelentősége áll, ugyanis a középkorú nők körében a rosszindulatú emlődaganat a leggyakoribb haláloki tényező a daganatos megbetegedések közül. Egy egészséges társadalom létrehozásához nagyobb hangsúlyt kellene fektetni az egészségtudatosság kialakítására, a betegségek megelőzésére, illetve a korszerű egészségügyi technikák (pl. szűrőberendezések) megfelelő gyakorlati alkalmazására. Dolgozatom első részében az emlődaganatok tulajdonságairól, valamint annak egyik lehetséges felismerési formájáról, a szűrővizsgálatokról beszélek. A második, empirikus adatok alapján készült részben az emlődaganatos nők körében mélyinterjúk segítségével végzett elemzésem eredményeit ismertetem. Felmérésem alátámasztja az időben elvégzett szűrések, a megelőző vizsgálatok jelentőségét.",
    "keywords": [],
    "generated_keywords": [
      "Felmérésem",
      "megelőző vizsgálatok jelentőségét",
      "nők"
    ]
  }
]