[
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2016,
    "title": "Székelyföldi turisztikai szolgáltatások nyelvi vonatkozásai",
    "students": [
      {
        "name": "Molnár Emese-Júlia",
        "major": "Sapientia Erdélyi Magyar Tudományegyetem, Fordító és tolmács szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: Napjainkban az idegennyelvek ismerete fontos szerepet játszik a szolgáltatásnyújtásban a turizmus terén. Célkitűzés: Célunk felmérni és összehasonlítani a székelyföldi szállodák által nyújtott idegennyelvű szolgáltatásokat, azok megjelenési formáit, minőségét Hargita, illetőleg Maros megyében. Anyag és módszer: Felmértük Hargita, illetve Maros megye egyes vendéglátóegységei által nyújtott angol nyelvű szolgáltatásokat 2016 februárjában. A kutatást követően összegeztük a kapott eredményeket, valamint összehasonlítottuk a két megye erősségeit, gyengeségeit. Különösen nagy hangsúlyt fektettünk a honlapok, szórólapok, brosúrák fordítási módszereire, illetve azon személyek angol nyelvtudására, akik a vendégekkel való kapcsolattartásért felelnek. Eredmények: A megkeresett 30 vendéglátóegységből 25-től kaptunk válaszokat (14 Hargita megyéből, 11 Maros megyéből). Az előzetes eredmények azt mutatják, hogy a legtöbb esetben a személyzet nagy része alap-, illetve középfokú angol nyelvi kompetenciákkal rendelkezik (bár Maros megyében ezek a mutatók jobb helyzetet körvonalaznak), illetve a honlapok, brosúrák nyelvi szerkesztésében eltérő stratégiákat alkalmaznak.",
    "keywords": [],
    "generated_keywords": [
      "Célkitűzés",
      "Felmértük Hargita",
      "Hargita",
      "Különösen",
      "Maros"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2016,
    "title": "Jane Austen Büszkeség és balítélet c. regénye magyar fordításainak kultúrspecifikus szempontú összehasonlítása",
    "students": [
      {
        "name": "Kövecsi Katalin",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Jane Austen Büszkeség és balítélet című regényének (1813) ez idáig öt fordítása látott napvilágot: a fordítók Szenczi Miklós (1958), Loósz Vera (2006), Bánki Dezső (2006), Hegedűs Emőke (2007) és Weisz Böbe (2013). Dolgozatunkban az egyes fordítások közti eltéréseket vizsgáljuk a kultúrspecifikus elemek szempontjából. A kutatás során egy párhuzamos korpuszt hoztunk létre, mely tartalmazza az angol eredeti (nem fordított) szöveg általunk kiválasztott részeit, illetve ezek öt különböző fordítását. Vizsgálatunk elsősorban a kultúrspecifikus elemek fordítási stratégiáira irányul (főleg a szókincs szintjén), de érintjük a társalgási normák átültetésének különböző megvalósulásait is.",
    "keywords": [],
    "generated_keywords": [
      "Bánki Dezső",
      "Dolgozatunkban",
      "Hegedűs Emőke",
      "Jane Austen Büszkeség",
      "Loósz Vera"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2016,
    "title": "The Role of Memory in Interpreting",
    "students": [
      {
        "name": "György-Kovács Bernadett",
        "major": "Sapientia Erdélyi Magyar Tudományegyetem, Fordító és tolmács, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Interpreting is the facilitating of oral or sign-language communication, either simultaneously or consecutively, between users of different languages. However, knowing two different languages is just one requirement of this profession, interpreting is a much more complex activity. Besides knowledge in as many fields as possible, a good memory is very important for interpreters. Memory is the ability to encode, retain and recall previously stored information and past experiences from the human brain. Our paper discusses the different types of interpreting and the role memory has in various interpreting situations. We also include the results of an online questionnaire we have designed. The questions were answered by professional and training interpreters and focus on the strategies these use in their practice of encoding, retaining and recalling previous experiences and information, with special regard to the tools they use.",
    "keywords": [],
    "generated_keywords": []
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2016,
    "title": "Translation across Genres: a case study",
    "students": [
      {
        "name": "Barabás Noémi",
        "major": "Sapientia EMTE, Fordító és tolmács, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "The paper follows the creation of the storyline of the movie Mamma mia! based on several songs written and performed by the legendary band, ABBA. The first part of the paper gives a short history of the band and of the songs themselves, the way they were transposed and used in the original West End musical, as well as in the movie with the same title. The paper also focuses on the strategies the song lyrics were translated (or not) in the Hungarian and Romanian versions of the Mamma mia! movie that was originally released in 2008. We wish to identify the ways the songs were used to create a narrative, as well as the translation strategies that can be connected to literary translation of songs and song lyrics.",
    "keywords": [],
    "generated_keywords": [
      "ABBA",
      "Hungarian",
      "Mamma mia!",
      "Romanian",
      "West End"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2016,
    "title": "Quality assessment in subtitling",
    "students": [
      {
        "name": "Kovács Ildikó Melinda",
        "major": "Sapientia EMTE, Fordító és tolmács, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Our paper focuses on the issues of quality assessment in the translation and subtitling of a popular show, Castle. In our research we built a parallel corpora of the original English text, the official Hungarian translation (as dubbing), as well as several so-called fan-translations as subtitles, where non-professional translators create a non-official subtitle for the show before it airs on Hungarian television. Our research outlines the aspects of quality assessment, with a special regard to the issues of immediacy (the subtitles are created shortly after the episodes air on American television). One of our hypotheses is that fan-translations have their strengths as they are the manifestations of a growing community of non-professional translators, where immediacy is more important than other aspects of quality assessment.",
    "keywords": [],
    "generated_keywords": [
      "American",
      "Castle",
      "English",
      "Hungarian"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2016,
    "title": "(De)constructing Gender Stereotypes in Language Use",
    "students": [
      {
        "name": "Barabás Blanka",
        "major": "Sapientia Erdélyi Magyar Tudományegyetem, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "As a result of the feminist movements of the 20th century, the concept of gender was created, giving birth to the new discipline of gender linguistics in the second part of the century. In contrast to previous conceptions according to which the language use and communication of men was superior to that of women, it shifts towards a more descriptive understanding of ways and means of communication. Thus it focuses on the linguistic aspects of gender as a social construct, and the ways identity is constructed in discourse. Our paper discusses the way gender stereotypes are outlined, defined and re-defined in everyday conversations. We apply the method of mediated discourse analysis (MDA) in which we move past the analysis of texts and consider the actions people take with them and the social consequences these actions have (cf. Norris-Jones 2005). We use recordings of everyday conversations in which we did not take part: they were recorded by the participants themselves. We are interested in the way gender-related stereotypes are constructed or deconstructed in these conversations with a special regard to language use. Reference: Norris, Sigrid - Rodney H. Jones 2005. Discourse in Action. Introducing mediated discourse analysis. Routledge: London-New York.",
    "keywords": [],
    "generated_keywords": [
      "Action",
      "London-New York",
      "MDA",
      "Norris",
      "Norris-Jones"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2016,
    "title": "An Examination of the Fictional Language of Nadsat from the Novel A Clockwork Orange by Anthony Burgess",
    "students": [
      {
        "name": "Nagy Norbert",
        "major": "Sapientia EMTE, Fordító és tolmács, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Our paper focuses on the fictional language of Nadsat devised by Anthony Burgess for his novel A Clockwork Orange published in 1962. We start with an overview of the history of artificial or invented languages, some of which were created for the purpose of international communication or computer programming, others purely for the sake of enriching fictional worlds found in the books of many authors, such as Newspeak (Orwell), Quenya or Sindarin (Tolkien). We primarily emphasize the linguistic characteristics of Nadsat, a fictional language based on English with a strong Russian or Slavic influence. In the context of the narrative, Nadsat bears the characteristics of slang and argot, functioning as the language of choice of a troubled group of teenagers. Our paper applies two approaches in analyzing this particular language, conceptualizing it both as an artificial language as well as slang. We argue that within the context of the novel it functions as slang or argot, while retaining the features of an artificial language from a wider perspective",
    "keywords": [],
    "generated_keywords": [
      "A Clockwork Orange",
      "Anthony Burgess",
      "English",
      "Nadsat",
      "Newspeak"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2016,
    "title": "Mistranslations and Translation Errors in Dubbing: a Case Study",
    "students": [
      {
        "name": "Tudor Szilárd",
        "major": "Sapientia EMTE, fordító és tolmács, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Our paper deals with the issue of mistranslations and translation errors in the dubbing of a popular television show, Arrow. After a short introduction to the theoretical issues of dubbing and translating elements related to popular culture, we focus on the case study of the way Arrow has been translated and localized into the Hungarian language, emphasizing translation errors on the lexical and conceptual level, as well as some pragmatic aspects. We analyze a database which includes the original English text and the problematic Hungarian variant. We also suggest alternative translations in the case of such mistranslations.",
    "keywords": [],
    "generated_keywords": [
      "Arrow",
      "English",
      "Hungarian",
      "Hungarian language"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2016,
    "title": "Requirements of a Professional Interpreter",
    "students": [
      {
        "name": "Izsák Éva",
        "major": "Sapientia EMTE, fordító és tolmács, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Our paper deals with the requirements that interpreters are faced with on their road to becoming professionals. Our aim is to discover the secrets of this profession, to see how qualified interpreters outline the challenges of becoming and being a full-time interpreter as opposed to those who are not qualified in this field. Our methodology is based on the content analysis of interviews conducted with several professional and non-professional interpreters working with several languages. We assume that professional interpreters have undergone institutional language training and are more proficient regarding the scholarly and non-scholarly literature. We also hypothesize that they have different attitudes towards being corrected by their audience.",
    "keywords": [],
    "generated_keywords": []
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2016,
    "title": "Sms- és chat-nyelvi megnyilatkozások erdélyi magyar fiatalok nyelvhasználatában",
    "students": [
      {
        "name": "Kolozsi Szidónia",
        "major": "Sapientia EMTE, fordító és tolmács, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatomban a 21. század egy érdekes nyelvhasználati terét vizsgálom, az sms és az internetes chat nyelvét. Vizsgálatomban elsősorban a fiatal, középiskolás és egyetemista nyelvhasználók nyelvi szokásait körvonalazom. Kutatásom módszertana egy kérdőívet tartalmaz, amelyben a fiatalok sms-ben és chat során használt nyelvi sajátosságaira kérdezek rá, illetve arra, hogy mi a véleményük arról, hogy mindennek milyen hatása van a nyelvhasználat többi területére. Hipotézisem szerint az sms- és a chatnyelv döntő módon hatással van arra, ahogy a fiatalok kommunikálnak.",
    "keywords": [],
    "generated_keywords": [
      "Vizsgálatomban",
      "kérdezek rá",
      "módon hatással van arra",
      "század egy érdekes"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2016,
    "title": "Egyenes fogú metszőkerék profilhibájának hatása a lefejtett fogaskerék profiljára",
    "students": [
      {
        "name": "Kántor Anna-Erzsébet",
        "major": "Sapientia EMTE, Gépészmérnöki, 2. év"
      },
      {
        "name": "Laczkó-Benedek Brigitta",
        "major": "Sapientia EMTE, Gépészmérnöki, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Máté Márton",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "A fogaskerékgyártás elméletéből ismert tény, hogy ha metszőkerékkel alakítunk ki evolvens profilú fogaskereket, akkor a generálási folyamat során számolnunk kell egy elméleti profilhibával, amely a metszőkerék sajátos, egyenes profilú lécszerszámmal való leképzéséből adódik. Ezt a hibát úgy tartják a megengedett tűrésmező határain belül, hogy a metszőkerék homlok- és csúcshátszögét alacsony értékeken tartják. A szakirodalom szerint elfogadott az elméleti profilhiba, mivel a szerszám fogfej- és fogláblenyesést hajt végre a burkoló profilon. A dolgozatunk célja a metszőkerékkel generált profil összehasonlítása egy, a metszőkerék fogszámával megegyező fogszámú evolvens fogaskerék fogprofiljával. Az eltérést normálirányban definiáljuk. Ez a hibát is jelenti. Vizsgálatunk során geometriai modellt állítottunk fel, amelyet számítógépes ábrázolással vizsgáltunk. A metszőkerék éle által generálható ellenprofilt a Siskov-féle módszer alkalmazásával számítjuk ki. A valós fogprofil és az elméleti fogaskerék evolvens eltérését is vizsgáljuk.",
    "keywords": [],
    "generated_keywords": [
      "Siskov-féle",
      "elméleti profilhiba",
      "elméleti profilhibával",
      "generálási",
      "kell"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2016,
    "title": "Mechatronikai elemekkel felszerelt osztófej tervezése és kivitelezése",
    "students": [
      {
        "name": "Török András",
        "major": "Sapientia EMTE, Mechatronika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Egyed-Faluvégi Erzsébet",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Osztófejet akkor alkalmazunk, amikor egy hengeres test felületén szabályos, előre meghatározott közökben ugyanazt a marási műveletet kell elvégeznünk. A dolgozatban bemutatásra kerülnek a marógépeken használatos osztófejek, ezen osztófejekkel történő osztási műveletek, továbbá egy már meglévő osztófej átalakításának lépései, az átalakított osztófejjel történő osztás pontossága, valamit a vezérlőrendszer.",
    "keywords": [
      "osztófej",
      "automatizálás",
      "vezérlés Kúpos menet marása esztergapadon Szerző(k): Gábor Áron (Sapientia EMTE",
      "Gépészmérnöki",
      "4. év) Irányító tanár(ok): Dr. Máté Márton (Sapientia EMTE",
      "egyetemi docens) Kivonat: A dolgozat a kúpos menetek gyártásának egy újfajta",
      "lehetséges megmunkálási módjának matematikai modelljét tárja fel",
      "amely eltér a hagyományos esztergakéssel végzett menetvágástól. A gyártás úgy valósul meg",
      "hogy az esztergapadon levő késtartó szán helyére egy marókészüléket tervezünk",
      "amely a hosszanti és keresztirányú előtolás vezetőléccel való egyesítésének lehetőségét használja ki. A kúpos menetfelületet tárcsamaró segítségével alakítjuk ki. A kúpos menetek használata olyan helyeken történik",
      "ahol nagy nyomatékátadás valósul meg",
      "és esetlegesen jó tömítésre van szükség. A matematikai modell magába foglalja a koordináta-transzformációkat",
      "a generált felületek egyenleteit és ezek grafikus képeit",
      "valamint a kontaktgörbék leírását és grafikus képeit. A létrejött valós pontseregre alkalmazott geometriai transzformáció (ráforgatás) segítségével meghatározzuk a tárcsamaró elméleti profilját",
      "amelyet sikerült egy legjobban közelítő egyenessel helyettesíteni. Vizsgáltam az eltéréseket az elméleti tengelyszelvény és a linearizálással kapott közelítő egyenes között. A felállított modell az eljárás alkalmazhatóságát igazolja. Kulcsszavak: Hengeres felületű alkatrészek marásának gazdasági és technológiai lehetőségei (marás esztergapadon) Szerző(k): Biró Csaba-András (Sapientia EMTE",
      "Gépészmérnöki",
      "4. év) Irányító tanár(ok): Dr. Máté Márton (Sapientia EMTE",
      "egyetemi docens) Kivonat: Manapság a fémmegmunkálás területén igen elterjedt a számvezérlésű úgynevezett CNC-gépeken történő megmunkálás. Valóban ez a technológia kínálja a legfejlettebb és a legtöbb lehetőséget a gyártóknak a formagenerálás területén. Azonban ne feledkezzünk meg a jól bevált",
      "hagyományos mechanikus vezérélésű szerszámgépekről sem. Felruházhatjuk e gépeket olyan készülékekkel",
      "amelyek segítségével megnövelhető a kihasználtsági tényezőjük. Számos esetben lehet hasznos a javasolt megoldás: a modern",
      "számvezérlésű gépünk javításra szorul",
      "a kemény forgácsolási körülmények miatt kímélni akarjuk a CNC-gépet stb. Dolgozatom témája a hagyományos esztergán történő hengeres felületek megmunkálási lehetőségeinek a tanulmányozása úgy",
      "hogy ötvözöm az esztergálási és a marási műveletet. Az eljárás lényegét az esztergatokmányba befogott",
      "hengeres felületű munkadarab a késtartó helyére tervezett marókészülék segítségével való megmunkálása képezi. A kitűzött célok a matematikai modell felállítása",
      "és ennek Mathcad környezetben való kiértékelése. A matematikai modell magába foglalja a koordináta-transzformációkat",
      "valamint a generált felületek egyenleteit. Ezek segítségével választjuk ki a hengeres felület esztergán történő marásához az optimális marószerszámot",
      "tanulmányozzuk a szerszám élei által leírt görbéket és felületeket a megfelelő forgácsolási paraméterek meghatározása érdekében. Olyan marókészüléket tervezünk",
      "amely fölszerelhető az esztergapad keresztszánjára. Kulcsszavak: Háromtengelyes stabilizátor Szerző(k): Fazakas Csaba Sándor (Sapientia EMTE",
      "Mechatronika",
      "4. év) Irányító tanár(ok): Dr. Forgó Zoltán (Sapientia EMTE",
      "egyetemi adjunktus) Kivonat: A dolgozat egy háromtengelyes stabilizátor fejlesztését és megvalósítását tartalmazza. Egy ilyen berendezés alkalmas mozgás közbeni rezgések kiegyenlítésére. A stabilizátor három szabadságfokú rendszer",
      "melynek tengelyeit egymástól függetlenül vezérelhetjük. A tengelyek forgatására szénkefe nélküli szervomotorokat használunk",
      "melyek vezérléséről egy 32 bites mikrovezérlő gondoskodik. A pozíció visszacsatolás két giroszkópról történik",
      "amely a váz elmozdulását figyeli. Kulcsszavak: Automatizált címkézőgép Szerző(k): Gábor László (Sapientia EMTE",
      "Mechatronika",
      "3. év) Nagy Mátyás (Sapientia EMTE",
      "Mechatronika",
      "3. év) Irányító tanár(ok): Dr. Forgó Zoltán (Sapientia EMTE",
      "egyetemi adjunktus) Kivonat: A folyamatgyártás során a gyártónak kötelezettsége a termékek címkézése",
      "melyek segítségével megállapítható azok gyártási helye és ideje. Nagy termeléseknél a cégek hatékonyan és gyorsan akarnak eljárni",
      "melyhez a címkézés automatizálása nagyban hozzájárul. Dolgozatunk egy címkézőgép tervezését foglalja magába",
      "melyet címkenyomtatóból és pneumatikus munkahengerekből épített berendezés segítségével valósítunk meg. A címkéket Zebra Z4M típusú nyomtatóval nyomtatjuk",
      "amelyeket a berendezés szívóhatással felemeli",
      "majd pozicionálás után a termék tetejére helyezi. Ezt a folyamatot ismételve a gép képes a sorozatos címkézésre. A munkahengerek vezérlését egy külön arra tervezett áramkörrel valósítjuk meg. Dolgozatunk célja tehát egy olyan berendezés megépítése",
      "amely kisebb cégek számára költséghatékony megoldást nyújt a különböző termékek automatizált címkézésére",
      "így hosszú távon a berendezésre fektetett ráfordítás megtérül",
      "és pozitív hatással lehet az év végi mérlegükre. Kulcsszavak: címkézőgép",
      "mechatronika",
      "munkahenger",
      "automatizálás Ciklois profilú bolygómű Szerző(k): Mátyás Álmos (Sapientia EMTE",
      "Mechatronika",
      "2. év) Irányító tanár(ok): Dr. Tolvaly-Rosca Ferenc (Sapientia EMTE",
      "egyetemi adjunktus) Kivonat: Nagy áttétel megvalósítására alkalmas bolygóművek jellemzője a kis fogszámkülönbség a bolygókerék és a gyűrűkerék között. Ez evolvens fogprofil esetén gondot jelent",
      "viszont nyújtott epiciklois fogazattal készült bolygókerekek segítségével megoldható. Az így megalkotott hajtómű (bolygómű) terhelhetőség mellett jó hatásfokon is működik. A dolgozat célja egy ciklois profilú bolygómű működését szemléltető háromdimenziós modell megépítése. A modellezéshez szükséges profilok generálása AutoLisp program segítségével",
      "a test és szerelési modellezés Autodesk Inventor környezetben készült el. Kulcsszavak: Üvegcső darabolására használatos berendezés tervezése és kivitelezése Szerző(k): Süket Levente-Hunor (Sapientia EMTE",
      "Mechatronika",
      "2. év) Irányító tanár(ok): Dr. Forgó Zoltán (Sapientia EMTE",
      "egyetemi adjunktus) Kivonat: A dolgozat célja egy kézzel működtethető",
      "kis sorozat gyártására alkalmas üvegcső-daraboló megtervezése",
      "számítógépes modellezése és megvalósítása. Kritérium",
      "hogy elérhető legyen az eszközzel a tized milliméteres pontosság",
      "a 10-1000 mm-es vágáshossz",
      "és 10-100 mm-es csőátmérőre használható legyen. Szempont",
      "hogy jövőbeli fejlesztésre",
      "automatizálásra alkalmas legyen a szerkezet. A csövek tengelyre merőleges síkban történő darabolása úgy valósul meg",
      "hogy először egy körkörös karcolást ejtünk a felszínen",
      "majd belülről sugárirányú gázlánggal melegítjük a karcolásnál. A cső a hőtágulás okozta feszültségtől elpattan. Kulcsszavak:"
    ],
    "generated_keywords": [
      "az átalakított"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2016,
    "title": "Harang Automatizálás",
    "students": [
      {
        "name": "Bartha Balázs",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Csernáth Géza",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozatom témája egy általam készített harangmodell szabályozása és vezérlése. A modellt egy valós rendszerről mintáztam. A távvezérlést egy mikrovezérlőn futó webszerveren keresztül valósítom meg. A szabályozás tulajdonképpen a harang kilendülési szögének szabályozása úgy, hogy a harang fizikai felépítéséből adódó természetes lengése megmaradjon. Ez azt jelenti, hogy a kilendülési szög nem haladhat meg egy bizonyos előírt referenciát, melynek az elérése biztosítja a legmegfelelőbb hangzást. Dolgozatomnak továbbá kísérleti célja is van, ez azt jelenti, hogy vizsgálni szeretném a harang működését különböző szabályozók alkalmazásával, valamint rendszeridentifikációs módszerekkel meghatározni a harang rendszermodelljét, melynek segítségével még pontosabb szabályozók tervezhetők.",
    "keywords": [],
    "generated_keywords": [
      "melynek",
      "úgy"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2016,
    "title": "Porlasztóberendezések magasfeszültségű, impulzusüzemű tápegységeinek a tanulmányozása, tervezése és gyakorlati kivitelezése",
    "students": [
      {
        "name": "Madarász Róbert Rossi",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Kelemen András",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A kutatásom célja a vékonyréteg-képző porlasztóberendezések magasfeszültségű, impulzusüzemű tápegységeinek a tanulmányozása, tervezése és gyakorlati kivitelezése. Dolgozatom a teljesítményelektronikai konverter felépítése és tervezése során felmerülő kivitelezési problémákat elemzi. Bemutatok egy áramköri topológiát, amely lehetővé teszi a reaktív magnetronos porlasztási folyamathoz szükséges nagyfeszültségű és nagyfrekvenciás aszimmetrikus bipoláris feszültség létrehozását. A tanulmány során olyan elveket rögzítek, amelyek figyelembe vétele elengedhetetlen a javasolt aszimmetrikus hídkapcsolás biztonságos működtetéséhez. Elemzem a konverterben alkalmazott nagyfeszültségű, nagy sebességű kapcsolók létrehozásának lehetőségét sorba kötött kapcsolóeszközökkel. Megvizsgálom ezek egyidejű kapcsolásának szükségességét és annak nehézségeit. Javaslok egy MOS rácsmeghajtási módszert, amely minimális számú alkatrész felhasználásával lehetővé teszi mind a nagyfrekvenciás működtetést, mind a védelmi kikapcsolást. Szimulálom és tesztelem a deszaturáción alapuló zárlatérzékelést és az ezt követő szinkron kikapcsolást. Vizsgálom az ívkisülések elhárításának módszereit, és egy olyan ívelhárító kapcsolást javasolok, amelynek működése a parazita áramköri elemek jelenlétén alapszik.",
    "keywords": [
      "magasfeszültség",
      "nagyfrekvencia",
      "aszimmetrikus bipoláris feszültség",
      "sorba kötött kapcsolóeszközök",
      "deszaturáción alapuló zárlatvédelem",
      "ívelhárítás"
    ],
    "generated_keywords": []
  },
  {
  "major": "Hardverfejlesztések",
  "year": 2016,
  "title": "KUKA youBot mobilis robot irányítása akadályok jelenlétében",
  "students": [
    {
      "name": "Szatmári Zsolt",
      "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 4. év"
    },
    {
      "name": "Csegedi Szabolcs",
      "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Márton Lőrinc",
      "university": "Sapientia EMTE, egyetemi docens"
    },
    {
      "name": "Szántó Zoltán",
      "university": "Sapientia EMTE, egyetemi tanársegéd"
    }
  ],
  "content": "Napjainkban az akadálykerülésnek, és a távvezérlésnek számos alkalmazása van, ezért korszerű robotirányítási algoritmusokra van szükség, melyek ezeket a feladatokat hivatottak kellőképpen megoldani. A tanulmány célja a Kuka youBot mobilis platform irányítása akadályok jelenlétében két megközelítés alapján. Az egyik megvalósításban távolságmérő szenzorokat, a másikban pedig egy lézerkamerát használunk az akadályok feltérképezésére. Az első általunk megvalósított alternatívában egy Raspberry Pi számítógépet felhasználva TCP-n továbbítjuk a robot felé a távolságszenzorok által észlelt adatokat. A robot a távolságok alapján autonóm akadálykerülést végez, miközben az előírt pozíció felé halad. A második módszer alapján a robotot egy három szabadságfokú haptikus eszközzel (Novint Falcon) lehet koordinálni. A roboton elhelyezkedő Hokuyo lézerkamera egy megközelítőleg 240°-os látómezőt lefedve egy meghatározott mintavételi periódussal méri a távolságokat és az azoknak megfelelő szögeket, melyek alapján egy erő-visszacsatolást küld a robotot a haptikus eszközzel irányító felhasználó számára. A felhasználó által érzékelt erő arányos a robot – akadály távolsággal. Mindkét akadálykerülési algoritmus előnyeit és hátrányait egyaránt bemutatjuk, és következtetéseinket valós idejű mérésekkel is alátámasztjuk.",
  "keywords": [
    "mobilis robot",
    "robotvezérlés",
    "akadálykerülés",
    "erő-visszacsatolás"
  ],
  "generated_keywords": [
    "KUKA youBot",
    "akadálykerülés",
    "távolságmérő szenzor",
    "lézerkamera",
    "haptikus eszköz"
  ]
},
{
  "major": "Hardverfejlesztések",
  "year": 2016,
  "title": "Optimumkereső algoritmusok numerikus megvalósítása és azok alkalmazása a szabályozásban",
  "students": [
    {
      "name": "Koós Norbert Elemér",
      "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. György Katalin",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    }
  ],
  "content": "Dolgozatom témája elsősorban az optimumkereső eljárások numerikus megvalósításának a tanulmányozása. A dolgozatban külön foglalkozom a korlát nélküli feladatok és külön a korláttal rendelkező feladatok megoldásával. A nem korlátos feladatokon belül a hangsúlyt a gradiens típusú algoritmusokra helyeztem, ennek keretében vizsgáltam az első-, másodfokú, illetve konjugált gradiens típusú algoritmusokat. A korlátos optimumkereső algoritmusoknál tanulmányoztam az egyenlőség és egyenlőtlenség típusú korlátokkal rendelkező módszerek numerikus megoldását (pl. Lagrange-módszer, büntető függvények módszere). Mind a nemkorlátos, mind a korlátos optimumkereső algoritmusok felhasználhatók a szabályozástechnikában, mint pl. szabályozók paramétereinek a hangolásánál, az optimális szabályozó jel kiszámításánál, de akár a rendszerek modellezésénél is bizonyos paraméterek meghatározhatók ezekkel a módszerekkel. Mindezen algoritmusok implementálása Matlab programozási környezetben történik, egy felhasználói felületen keresztül elérve azokat (de nem használom fel az említett programban meglévő optimumkereső függvényeket, csak az eredmények tesztelésére).",
  "keywords": [
    "optimumkereső algoritmusok",
    "büntető függvények",
    "gradiens módszerek",
    "optimális irányítás"
  ],
  "generated_keywords": [
    "numerikus megvalósítás",
    "korlátos optimalizálás",
    "gradiens alapú algoritmusok",
    "Matlab implementáció",
    "szabályozók hangolása"
  ]
},
{
  "major": "Hardverfejlesztések",
  "year": 2016,
  "title": "Pályakövető robot vezérlése valósidejű videojel-feldolgozó irányítási algoritmus segítségével",
  "students": [
    {
      "name": "Moni Róbert",
      "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Bakó László",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    }
  ],
  "content": "A fejlődő autóiparban a modern autók egy új generációja törekszik a piacra kerülni, éspedig az önvezető, intelligens autóké. Ehhez az evolúcióhoz a járművekben megjelenő számítógépek és érzékelők járultak hozzá, melyek által a vezetés biztonságosabbá és kényelmesebbé vált. Egy önvezető autónak fő feladata az út követése egy meghatározott útszakaszon, figyelembe véve a közlekedési jelzéseket, emellett mindvégig készenlétben kell állnia a balesetek elkerülésére. Ezen funkciók nélkülözhetetlen részei a szenzorok, amelyek a jármű környezetében zajló jelenségeket észlelik. Maga az út követéséhez többféle megoldás létezik, melyek közül kiemelném a videojel-feldolgozáson alapuló módszert. Dolgozatomban egy olyan járművezérlő algoritmus fejlesztésén dolgoztam, amely videojel-feldolgozáson alapuló irányítást végez egy adott pálya követéséhez. A robot feladata egy referenciaként meghúzott vonal követése, amelyre a rögzített képsorozatokból származó adatokból és kerekekre szerelt sebességmérő szenzor segítségével képes. A videojel-feldolgozó algoritmus képsorozatok feldolgozásából határozza meg a képen látható elmozdulás irányát, azaz a kamerával rögzített pálya a referenciapályához mért elmozdulási irányát. Az irányító algoritmus a referenciapályához képest úgy vezérli a mobilis robotra szerelt motorpárt, hogy a jármű optimálisan kövesse a pályát.",
  "keywords": [],
  "generated_keywords": [
    "videojel-feldolgozás",
    "pályakövetés",
    "önvezető járművek",
    "valósidejű vezérlés",
    "robotirányítás",
    "képfeldolgozó algoritmus"
  ]
},
{
  "major": "Hardverfejlesztések",
  "year": 2016,
  "title": "Automatizált fototerápiás rendszer tervezése és kivitelezése",
  "students": [
    {
      "name": "Pap Péter",
      "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Brassai Sándor Tihamér",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    }
  ],
  "content": "Napjainkban egyre több ember szenved valamilyen autoimmun bőrbetegségben. Klinikai vizsgálatok bizonyítják, hogy a szűk spektrumú UVB fény helyi immun-moduláló hatásánál fogva csökkenti a tüneteket, amely krónikus esetekben is alternatívát jelenthet a szteroidos kezelésekkel szemben. Dolgozatom célja autoimmun bőrbetegségek kezelése során alkalmazható automatizált rendszer modelljének megtervezése és kivitelezése. Rendszerem a kezelőágy fölé nyúló két szabadságfokú állványból és az azt vezérlő kezelési algoritmusból épül fel. A mechanikai rendszer szabadságfokainak meghajtását két darab léptetőmotor biztosítja, amelyeknek vezérlését két darab léptetőmotor-vezérlővel valósítom meg. Rendszerem vezérlőegységeként egy Zybo Zynq-7000 SoC fejlesztőlap szolgál, amelyen egy Linux alapú operációs rendszert konfiguráltam. Ezen rendszeren fut a képfeldolgozó algoritmus, amely a kamera képének klaszterezése és utófeldolgozása által azonosítja a bőrfelület kezelendő régióit, és kiszámítja a mechanikai rendszer előírt pályáját. Az előírt pályának megfelelő lépésszámokat a Zybo fejlesztőlap FPGA újrakonfigurálható digitális áramkörében felépített moduljaimnak továbbítom. Ezen modulok véges állapotú adat utas automaták, amelyek generálják a motorvezérlőknek biztosítandó jeleket.",
  "keywords": [
    "Zybo",
    "embedded linux",
    "képfeldolgozás",
    "fényterápia"
  ],
  "generated_keywords": [
    "automatikus fototerápia",
    "léptetőmotor vezérlés",
    "FPGA",
    "bőrfelület detektálás",
    "orvosi képfeldolgozás"
  ]
},
{
  "major": "Hardverfejlesztések",
  "year": 2016,
  "title": "Mágneses levitáció",
  "students": [
    {
      "name": "Ferencz Katalin",
      "major": "Sapientia EMTE, Számítástechnika, 2. év"
    },
    {
      "name": "Simándi Noémi",
      "major": "Sapientia EMTE, Számítástechnika, 2. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Domokos József",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    },
    {
      "name": "Jakab-Farkas László",
      "university": "Sapientia EMTE, labortechnikus"
    },
    {
      "name": "Dr. Szabó László Zsolt",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    }
  ],
  "content": "A dolgozatunk témája egy mágnes pálya felett lebegő pályakocsi mozgatása különböző sebességgel egy hordozható mikroszámítógép segítségével. A mágnespálya neodímium mágnesekből áll. A pályakocsi felfüggesztését két szupravezető koronggal valósítottuk meg. A pályakocsi meghajtása egy egyenáramú motorra szerelt propellerrel történik. A motorvezérlést egy H-híddal (L293B) valósítottuk meg, amelyet a pályakocsin elhelyezett Raspberry Pi mikroszámítógép irányít. A mikroszámítógépen egy Python szkript fogadja a vezérlőadatokat, és vezérlőjeleket küld a H-hídnak. A vezérlőadatokat wifi-hálózaton keresztül egy Android operációs rendszerrel működő eszköz szolgáltatja.",
  "keywords": [],
  "generated_keywords": [
    "mágneses levitáció",
    "szupravezető",
    "Raspberry Pi",
    "H-híd (L293B)",
    "Python vezérlés",
    "Android-alapú távirányítás",
    "DC motoros meghajtás"
  ]
},
{
  "major": "Hardverfejlesztések",
  "year": 2016,
  "title": "Moduláris egyensúlyozó robot",
  "students": [
    {
      "name": "Pap Levente",
      "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 3. év"
    },
    {
      "name": "Varga Attila",
      "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 3. év"
    },
    {
      "name": "Fülöp Zoltán",
      "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. György Katalin",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    },
    {
      "name": "Dr. Brassai Sándor Tihamér",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    },
    {
      "name": "Dr. Vajda Tamás",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    }
  ],
  "content": "A dolgozat célja egy moduláris robot megvalósítása a „Magyarok a Marson” elnevezésű versenyre. A modularitás lényege az, hogy ugyanezzel a robottal részt vehessünk a Continental által meghirdetett versenyen is. Az első versenyen meghirdetett feladat az, hogy egy robottal egy szenzort kell rövid időre egy pályán elhelyezett csövek belsejébe juttatni, ami által pontokat lehet szerezni. A robotot nekünk kell irányítani saját vezérlővel úgy, hogy a robot el lesz szigetelve a vezető látóterétől, így kamerát kell alkalmaznunk a megfigyelésre. A Continental verseny abban különbözik, hogy ott a robotnak teljesen automatikusan kell működnie, és bizonyos kihelyezett táblák utasításait kell követnie. Ezen feladat megoldására képfeldolgozást fogunk alkalmazni. Ahhoz, hogy a robotunk mindkét versenyen részt vehessen, úgy döntöttünk, hogy úgy építjük meg a robotot, hogy a két verseny között minimális átalakításokat kelljen végeznünk. Erre azt a megoldást találtuk, hogy a robot két kereken egyensúlyozzon, mivel így kevesebb lett a mozgó alkatrész, és a robot mobilitása is jobb. A választott feldolgozó egységek egy Raspberry PI 2B és egy Arduino MEGA. A Raspberryn egy Java program fut, mely kommunikál az Arduinón futó programmal, így alkotva meg a robotunk belső irányítási rendszerét. A roboton elhelyezett bemeneti egységek: egy RaspiCam kamera, egy WiPi wifi-modul és egy MPU-6050 IMU. A dolgozat bemutatja a robot tervezését, felépítését és működési alapjait.",
  "keywords": [
    "egyensúlyozó robot",
    "Raspberry",
    "Arduino",
    "gyro",
    "képfeldolgozás",
    "irányítás"
  ]
},
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2016,
    "title": "Vezérlési gesztúrák felismerése gyorsulásérzékelő segítségével",
    "students": [
      {
        "name": "Matei Bettina",
        "major": "Sapientia EMTE, Informatika, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Antal Margit",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A mobileszközök egyre kifinomultabbak, és a legújabb generációs okos készülékek már többféle érzékelőt tartalmaznak. Ilyenek lehetnek a GPS-, vizuális- (pl. kamerák), audio- (pl. mikrofonok), fény-, hőmérséklet-, irány- (mágneses iránytű) és gyorsulásérzékelők. A rendelkezésre álló érzékelők új és izgalmas lehetőségeket kínálnak adatbányászat terén. Munkánk során emberi tevékenység felismeréssel foglalkoztunk. Különböző elektronikus eszközökben levő gyorsulásérzékelő nyújtotta adatokat vizsgáltunk. Okostelefon, okosóra, illetve Wii Remote eszköz gyorsulásszenzorának idősorait tanulmányoztuk. Az érzékelőkből kinyert idősorokat vezérlési gesztúrák rögzítése során kaptuk, illetőleg tanulmányoztunk más kutatócsoportok által gyűjtött adatokat is. A gesztúrák felismerésére két módszert implementáltunk. Az egyik a dinamikus idővetemítés, amely az előfeldolgozott idősorok közötti távolságszámítással határozza meg a hasonlóságot, illetve egy jellemző-alapú módszert, amely majd különböző gépi tanulási módszerek segítségével osztályozza a gesztúrákat. Munkánk eredménye egy szoftver, ami ezeket az algoritmusokat implementálja, és képes felismerni az eszközzel végzett, előre definiált tevékenységeket, nevezetesen határozott vízszintes jobb és bal irányú kézmozdulatokat.",
    "keywords": [],
    "generated_keywords": [
      "Az",
      "GPS-",
      "Okostelefon",
      "Wii Remote",
      "eszközzel végzett"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2016,
    "title": "Emberi tevékenységek felismerése Android eszköz segítségével",
    "students": [
      {
        "name": "Sipos Teréz",
        "major": "Sapientia EMTE, Számítástechnika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Antal Margit",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Az új generációs mobileszközök többféle érzékelőt tartalmaznak, amelyek segítségével az emberek által végzett tevékenységek (séta, szaladás, lépcsőzés, ülés, állás, fekvés stb.) felismerhetők. Ezek felismerésére gyorsulásérzékelőből kinyert adatokat használok, ezeket szegmentálom, majd az így kapott szegmensekből jellemzőket nyerek ki. Az így kapott jellemzővektorokat különböző gépi tanulási algoritmusok segítségével osztályozom. A tanulmányozott szakirodalomban az osztályozási algoritmusok pontosságát nagyon sok dolgozat 10 réteges keresztvalidáció alapú méréssel ellenőrzi. Ebben az esetben ugyanazon felhasználótól származó tevékenységminták mind a tanító, mind pedig a teszthalmazban előfordulnak és sokkal jobb felismerési pontosságot eredményeznek, mint független tanító és teszthalmaz használata esetén. Dolgozatomban összehasonlítom a két módszerrel kapott eredményeket egy publikus adathalmazt használva. Helyesen végezve az osztályozási pontosság ellenőrzését a rendszer pontossága 70% körüli, míg helytelenül végezve 90% fölötti eredményt kapunk.",
    "keywords": [
      "emberi tevékenység felismerése",
      "gyorsulásérzékelő",
      "Android eszköz"
    ],
    "generated_keywords": []
  },
  {
  "major": "Informatika és szoftverfejlesztés",
  "year": 2016,
  "title": "Online aláírás-felismerés érintőképernyős eszközökön",
  "students": [
    {
      "name": "Kis Anna Katalin",
      "major": "Sapientia EMTE, Számítástechnika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Antal Margit",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    }
  ],
  "content": "Napjaink mobileszközei a különféle érzékelők segítségével lehetővé teszik az érintőképernyőre rajzolt aláírás felismerését és elemzését. Az érintőképernyő szolgáltatta különböző adatok feldolgozásából formai és dinamikai jellemzőket nyerek ki. Ezekből jellemzővektorokat építek fel, majd ún. anomáliadetektorok használata révén valósul meg a hitelesítés. Ezt egy általam megírt aláírás-alapú beléptető rendszer valósítja meg. A szakirodalom egyetlen olyan publikus adatbázist említ, melyben mobileszközök érintőképernyőjén gyűjtöttek aláírásmintákat, és ez a DooDB. Ez szintén nyersadatként került publikálásra, így ezekből az adatokból is jellemzővektorokat állítottam elő, majd különböző anomáliadetektorok segítségével méréseket végeztem. A leghatékonyabbnak a skálázott Manhattan anomáliadetektor bizonyult, amely 15 mintás tanítás használata mellett 5% alatti hibát eredményezett. A saját rendszerembe is ezt a detektort építettem be.",
  "keywords": [
    "online aláírás-felismerés",
    "anomáliadetektor",
    "érintőképernyő",
    "Android eszköz"
  ],
  "generated_keywords": []
},
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2016,
  "title": "Ujjlenyomat-felismerő szoftver",
  "students": [
    {
      "name": "Kurucz Tamás",
      "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Vajda Tamás",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    }
  ],
  "content": "A biometrikus azonosítás az emberi szervezet vagy viselkedés valamely egyedi jellemzőjének felismerésén alapul, amely méri és rögzíti egy személy egyedi fizikai, testi jellemzőjét. A biometrikus azonosítási folyamat két jól elhatárolható részből áll. Az első rész a regisztráció, a második rész az azonosítás. A jelen dolgozat egy biometrikus rendszer megvalósítását, azon belül is egy ujjlenyomat-felismerő szoftver megalkotását mutatja be. Ahhoz, hogy ez az ujjlenyomat-felismerő szoftver egy egységes működő rendszer legyen, a következő fázisokon haladunk végig: egy bemeneti képre, ujjlenyomatra van szükségünk, ami jelen esetben egy ujjlenyomat-szenzortól kapunk (GT-511C1R). A szenzor beolvassa az ujjlenyomatunkat, digitalizálja, és ezt a digitális ujjlenyomatot lementi lokálisan egy könyvtárba, amit majd a továbbiakban felhasználunk. A szenzortól kapott kép előfeldolgozáson esik át. Feljavítjuk az ujjlenyomatkép minőségét élesítés és szűrők segítségével. Az élesítésre és a szűrésre gyors Fourier-transzformációt (STFT), valamint inverz Fourier-transzformációt használtuk. Az előfeldolgozás után a képen megkeressük az ujjlenyomaton lévő jellegzetes pontokat, a minutiae-kat (minuciákat). Ezek a jellegzetes pontok: különböző végződések és elágazások. A jellegzetes pontok megtalálása több lépésből álló algoritmussal kerül megvalósításra. A lépések a következők: hisztogramkiegyenlítés, binarizálás, vékonyítás, minutiae-pontok megkeresése. A vékonyítás és a minutiae-pontok megkeresése a hit-or-miss transzformáció segítségével történt, felhasználva a Golay-ábécé maszkcsaládjából néhányat. Miután megkerestük a beviteli ujjlenyomaton lévő jellegzetes pontokat, megtörténik az adatbázisban lementett ujjlenyomatokkal való összehasonlítás, hogy majd végeredményül megállapítsuk, hogy melyik ujjlenyomattal azonos a mi bemeneti ujjlenyomatunk. Mindegyik ujjlenyomatnak megalkotjuk a minutiae-pontokból álló térképét, és ezeket a térképeket összehasonlítjuk a minutiae-pontok által alkotott koordinátaismeretek alapján, és így az egyezést százalékban kifejezve meg tudjuk mondani a kettő közötti hasonlóságot.",
  "keywords": [],
  "generated_keywords": [
    "biometrikus azonosítás",
    "ujjlenyomat-feldolgozás",
    "minutiae detektálás"
  ]
},
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2016,
  "title": "Agyi tumor felismerése és lokalizálása 3D MRI képek alapján",
  "students": [
    {
      "name": "Kapás Zoltán",
      "major": "Sapientia EMTE, Számítástechnika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Szilágyi László",
      "university": "Sapientia EMTE, egyetemi tanár"
    },
    {
      "name": "Lefkovits László",
      "university": "Sapientia EMTE, tanársegéd"
    }
  ],
  "content": "Annak ellenére, hogy rendkívüli sebességgel fejlődnek a diagnosztika és terápia eszközei és lehetőségei, évente százezrek halnak meg agyi tumor következtében. A menthetetlen esetek drasztikus csökkentése szűrővizsgálatok bevezetésével lehetséges, a korai felismerés bizonyára a gyógyulás egyik alapfeltétele. Dolgozatom célja megvalósítani egy olyan számítógépes eljárást, melynek segítségével lehetségessé válik a kis méretű agytumorok automatikus felismerése mágneses rezonanciás képanyagokból (MRI). Bemeneti adatként a MICCAI Brain Tumor Segmentation Challenge 2012/13-as évi adatbázisát alkalmazom, melyben 50 páciens agyi MRI képei találhatóak meg méretben normalizált állapotban, szakértő által megjelölt tumoros és ödémás szövetekkel együtt. A szövettípusok számítógép általi megtanulására a gépi tanulás felügyelt osztályozó eljárásait céloztam meg. A megvalósított módszerem az úgynevezett random forest-technikán alapszik. A tanulási fázisban bináris döntési fáknak tanítottam meg a tanulóhalmaz véletlenszerűen kiválasztott kis részeit véletlenszerűen kiválasztott jellemzők alapján. A döntéshozásnál az erdőt alkotó fák többségi döntése alapján sorolom be a tesztadatokat normális, ödémás, valamint tumoros szövetnek. Az eljárás elő- és utófeldolgozást is igényel. Előfeldolgozásként a képek hisztogramját normalizálom, illetve a négy színcsatornás adatokból húszféle jellemzőt nyerek ki átlagolás és mediánszámítások segítségével. Az utófeldolgozás szerepe az osztályozás során tumornak és ödémának jelölt szövetrészek térbeli folytonosságának vizsgálata. A megvalósított eljárás az adatbázisban szereplő 10mm-esnél nagyobb méretű tumorok nagy többségét képes felismerni. Ezen tumorok szegmentálásának pontosságát a legtöbb esetben 0,7-es érték feletti Jaccard-index jellemzi.",
  "keywords": [],
  "generated_keywords": [
    "agytumor szegmentálás",
    "MRI képfeldolgozás",
    "random forest osztályozás"
  ]
},
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2016,
  "title": "Hibrid Képleírás 2.0",
  "students": [
    {
      "name": "Madaras Hunór",
      "major": "Sapientia EMTE, Marosvásárhely, Szoftverfejlesztés, 2. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Egyed-Zsigmond Előd",
      "university": "INSA Lyon, egyetemi docens"
    }
  ],
  "content": "A mindennapi életben rengeteg információval találkozunk, a legjobban a képek alapján maradnak meg ezek az adatok nekünk. Az emberek egyszerűen fel tudják ismerni a képeken látható információt, tárgyakat, embereket, tájakat, viszont a számítógépeknek ehhez tanulás kell. Manapság egy kép élettartama 24 óra, sok képet készítünk és hamar el is feledkezünk róluk, emlékszünk, hogy van, de már nem tudjuk, hogy hová mentettük el, és lusták vagyunk előkeresni. Mi történne, ha lenne egy olyan rendszerünk, ami képes nekünk szavak alapján előkeresni a képet, felismerni az információt rajtuk, és úgy rendezni őket. A kutatásunk célja egy olyan rendszert felállítani, tökéletesíteni, mely képes egy általunk választott képre megmondani, hogy egy kulcsszó milyen valószínűséggel szerepel a képen (például a kulcsszó legyen a szék és megmondja a rendszer, hogy a képünkön van-e szék vagy nincs). El szeretnénk különíteni egy olyan kulcsszóhalmazt, melyekre a lehető legbiztosabban meg tudjuk mondani, hogy jelen van-e a képen vagy nincs az általa képviselt információ.",
  "keywords": [],
  "generated_keywords": [
    "képalapú információkinyerés",
    "kulcsszavas képfelismerés",
    "automatikus képleírás"
  ]
},
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2016,
  "title": "Klaszterezés matematikus-adatbázisokban",
  "students": [
    {
      "name": "Szép Zoltán",
      "major": "Sapientia EMTE, Informatika, 2. év"
    },
    {
      "name": "Bogosi Roland",
      "major": "Sapientia EMTE, Számítástechnika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Jánosi-Rancz Katalin Tünde",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    },
    {
      "name": "Dr. Kása Zoltán",
      "university": "Sapientia EMTE, egyetemi professzor"
    }
  ],
  "content": "A Mathematics Genealogy Project (MGP) nyilvántartja a doktori vezetőket és azokat, akik náluk doktoráltak. Ezen kívül létezik sok olyan adatbázis (pl. MathSciNet, DBLP), amelyben matematikai cikkeket őriznek, és ezekből kinyerhetők a kapcsolatok, vagyis az, hogy ki kivel írt közös cikket. A kapcsolathálózatban klasztereket (teljes részgráfokat vagy azokhoz hasonlókat) keresünk. Az MGP-ből kikeresünk egy adott doktori vezetőt és a doktoranduszait, ők a kapcsolathálózatban jó eséllyel klasztert alkotnak. A dolgozat célja, hogy ezen megállapítás alapján vizsgáljuk a két adatbázist, és klasztereket keressünk bennük.",
  "keywords": [],
  "generated_keywords": [
    "kapcsolathálózat",
    "matematikus klaszterezés",
    "matematikai adatbázisok"
  ]
},
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2016,
  "title": "Termék-ár felismerés weboldalakon",
  "students": [
    {
      "name": "Barabás Levente",
      "major": "Sapientia EMTE, Informatika, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Egyed-Zsigmond Előd",
      "university": "INSA Lyon, egyetemi docens"
    }
  ],
  "content": "A dolgozatunk célja egy olyan alkalmazás készítése, amelynek segítségével különböző termékneveket és a nekik megfelelő árakat bányászhatjuk ki különböző webáruházak oldalairól. Ahhoz, hogy a terméknév-ár felismerést minél jobban szemléltessük, az alkalmazott kereső algoritmusokat, valamint az árdetektálás céljából alkalmazott szabályokat és a különböző zajok, haszontalan információk kiszűrésére alkalmazott eljárásokat egy webes-böngésző kiegészítőbe programoztuk be. Így elegánsan tudjuk majd szemléltetni a terméknévkeresés, valamint a talált termékekhez való ártársítás folyamatát. A terméknév, valamint az árak keresését a gráfkereső algoritmusok családjához tartozó szélességi algoritmus segítségével valósítottam meg. Az árak detektálása viszont egy bonyolultabb folyamat, hiszen az árak különböző oldalak esetén különböző formátumban jelennek meg, ezért reguláris kifejezések mellett sok más szűrő módszert és különböző információkat (pl. terméknévtől való távolság a html-dom fában) szükséges alkalmazni és elemezni ahhoz, hogy biztosak legyünk abban, hogy a talált elem ténylegesen egy ár. A kiegészítőben használt módszerek, ár-felismerésére alkalmazott eljárások tesztelése, nem jelentős információk kiszűrésre vonatkozó kísérletezések végső célja az lenne, hogy egy olyan alkalmazást készítsünk, amely automatikusan, valamilyen tanulási módszert alkalmazva bármely weboldalról kibányássza a számunkra érdekes információkat. Ebből a célból a kiegészítő fel van ruházva egy adathalmaz-exportálási funkcióval is, amelyet tanuló-példák generálására lehet utólag felhasználni.",
  "keywords": [],
  "generated_keywords": [
    "termékár-felismerés",
    "webes adatkinyerés",
    "szabályalapú szűrés",
    "gráfkereső algoritmusok",
    "böngésző kiegészítő"
  ]
},
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2016,
    "title": "Útjelző tábla felismerése vízesés (Cascade) osztályozóval, Haar-tulajdonságok alapján",
    "students": [
      {
        "name": "Kovács Levente Botond",
        "major": "Sapientia EMTE, Számítástechnika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Vajda Tamás",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozat célja útjelző táblák felismerése valós időben. Jelzőtábla-felismerésnél a legnagyobb kihívást a valós idejűség betartása és a pontosság jelenti. Legtöbb megközelítés szín és alakzat alapján próbálja lokalizálni és felismerni az adott jelzőtáblát, de felvetődik a kérdés, hogy melyik a legrobusztusabb színtér, színskála, melyet minimálisan befolyásolnak a környezeti hatások. Mindemellett az ehhez szükséges képfeldolgozási számítások időigényesek lehetnek, amik a valós idejűség kárára lehetnek. A Cascade osztályozó ezekkel a módszerekkel ellentétben egy tanuláson alapuló módszer, mely megtanulja az objektum, a mi esetünkben a jelzőtábla különböző tulajdonságait, és a tulajdonságok alapján egy vízeséshez hasonló szűrőt állít elő, amely kiszűri, elveti a nem odaillő, nem felismerendő objektumokat. A módszer előnye, hogy számítási időigénye meglehetősen alacsony, és megfelelő konfigurálás esetén meglehetősen pontos is. A feladat kihívása, hogy több fajta jelzőtábla esetén is megfelelő gyorsasággal és pontossággal működjön a rendszer.",
    "keywords": [],
    "generated_keywords": [
      "valós idejű képfeldolgozás",
      "útjelző tábla felismerés",
      "Cascade osztályozó",
      "Haar-tulajdonságok"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2016,
    "title": "Behatolástesztelő és sebezhetőségfelderítő rendszer",
    "students": [
      {
        "name": "Bogosi Roland",
        "major": "Sapientia EMTE, Számítástechnika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Vajda Tamás",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjainkban egyre népszerűbbek az internetes vállalkozások és az IoT-alapú eszközök. Ezen típusú szolgáltatások és eszközök esetén kulcsfontosságú a biztonság fenntartása az anyagi károk, illetve a hírnév romlásának elkerülése végett. A behatolástesztelési szolgáltatásokat nyújtó cégek ezzel az igénnyel arányosan nőnek, ugyanis egyre több kis- és nagyvállalkozás kiszervezi az infrastruktúrája biztonságának fenntartását. A dolgozat egy autonóm sebezhetőségkereső rendszert mutat be, amely önműködően illeszkedni tud a dinamikusan változó infrastruktúra nyilvános részéhez, és lépést tud tartani a legutóbb közzétett sérülékenységekkel, illetve nulladik napi támadásokkal.",
    "keywords": [],
    "generated_keywords": [
      "penetration testing",
      "sebezhetőség-felderítés",
      "autonóm biztonsági rendszer",
      "kiberbiztonság"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2016,
    "title": "Felületek szintézise a számítógépes grafikában",
    "students": [
      {
        "name": "Szabó Zoltán",
        "major": "Sapientia EMTE, Számítástechnika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Kovács Lehel-István",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Az emberek legtöbbször törekednek arra, hogy mindennek legyen meg a pontos, előre eltervezett helye. A természetben viszont nincsenek ilyen aranyszabályok, a véletlennek tulajdonítjuk azt, ahogyan formálódnak, alakulnak és módosulnak a domborzatok, természeti kincsek. Dolgozatomban erre a véletlenszerűségre törekedtem: tanulmányoztam, hogyan lehet minél inkább valósághű domborzatot kialakítani olyan módszerekkel, algoritmusokkal, amelyek a véletlenszerűségre alapoznak, mint például a Perlin-zaj. A domborzaton előforduló természeti elemek helyét szintén véletlenszerűen határozom meg. Egy fontos természeti elem, ami nélkülözhetetlen egy tájkép esetén, az a természetben előforduló vizek, tavak. A vizek megjelenítésénél figyelembe vettem a vízre jellemző tulajdonságokat: átlátszóság, fényvisszaverődés, fénytörés, Fresnel-effektus. A felületet bejárhatjuk belső nézetből (First Person), ahol érvényes a gravitáció, vagy repülő üzemmódban felülről szemlélve.",
    "keywords": [],
    "generated_keywords": [
      "felületszintézis",
      "Perlin-zaj",
      "természetes tájgenerálás",
      "számítógépes grafika"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2016,
    "title": "Valós idejű elmozdulás meghatározása videojel feldolgozásával",
    "students": [
      {
        "name": "Moni Róbert",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Bakó László",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjaink fejlett automatizálási és informatikai rendszereiben egyre nagyobb teret nyer a képekből történő információ szűrése. Különböző forma-, karakter-, írás-, mozzanatfelismerő algoritmusok jelentek meg a tudomány ezen terén, melyek különböző technikákat tárnak fel a képekből történő alkalmazás-hasznos információk elnyerésére. Ezen technikák lényeges tulajdonságai a gyorsaság, a robusztusság, a pontosság, a minőség, valamint a költséghatékonyság. Dolgozatomban egy olyan videojel-feldolgozó algoritmus fejlesztésén dolgoztam, amely a fent említett tulajdonságokban törekszik jónak bizonyulni. Az algoritmus képsorozatok feldolgozásából határozza meg a képen látható elmozdulás irányát a képsorozatokban észlelt élek képről képre történő relatív helyváltoztatásából. Két egymásután következő, éldetektálással feldolgozott képpár végigpásztázásával egy négy kvadránst tartalmazó kernel segítségével az algoritmus visszatéríti pontonként a kvadránsokban történő pixel-elmozdulást, amely megegyezik az észlelt objektumok relatív elmozdulásával. A módszer nyolc elmozdulási irányt képes észlelni. Az algoritmust kezdetben egy Raspberry Pi B 2-es modellű számítógépen valósítottam meg c++11/c++14 és Python nyelvezeteken, az OpenCV segédkönyvtár felhasználásával. A technikát FPGA-t tartalmazó fejlesztőlapon is teszteltem gyorsaságvizsgálás szempontjából úgy, hogy éldetektált képeket közvetítettem a Raspberry Pi számítógépről a fejlesztőlapra SPI protokoll segítségével. Mivel ez egy gyors, robusztus, pontos és költséghatékony módszer az optikai elmozdulás észlelésére, az algoritmust videokamerával felszerelt, gyors folyamatok követésére, akár pályakövető robot vezérlésére is fel lehet használni.",
    "keywords": [],
    "generated_keywords": [
      "videojel-feldolgozás",
      "elmozdulás meghatározás",
      "optikai áramlás",
      "valós idejű képanalízis"
    ]
  },


  {
    "major": "Kommunikáció",
    "year": 2016,
    "title": "Instagram-kommunikálás és kapcsolattartás képekkel",
    "students": [
      {
        "name": "Szász Kinga",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 1. év"
      },
      {
        "name": "Dézsi Blanka- Bernadett",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 1. év"
      },
      {
        "name": "Csibi Lajos- Csaba",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Tőkés Gyöngyvér",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Kutatásunk célja a fiatalok Instagram-használati mintáinak feltérképezése a mindennapi médiafogyasztásban. A kutatási ötlet szubjektív, hiszen Instagram/felhasználóként érdekelni kezdett az Instagram működési alapelve, közösségteremtő szerepe és annak a közösségi térnek a sajátosságai, amely ebben a közösségi médiában létrejön. Kutatási célunk aktuális, hiszen a fiatalok életkorukra jellemző igények kielégítésére használják az Instagramot. Melyek azok a befolyásoló tényezők, amelyek népszerűvé teszik ezt a közösségi oldalt? Mitől nyerte létjogosultságát, mitől más, mint a Facebook, vagy miben azonos? Kutatásunkban kitérünk a felhasználók önmegjelenítési jellemzőire, a tagok közötti társas kapcsolatokra és az ott zajló tevékenységekre. A szakirodalomból is az derül ki, az Instagram használata egyre inkább elterjed, összehasonlítva a legelterjedtebb közösségi oldallal, a Facebookkal (Micskei 2015; Porkoláb 2015; Miskolczy 2008). Kutatásunkban az online kérdőíves módszert alkalmazzuk, és 100 Instagram-felhasználót kérdezünk meg. Dolgozatunk első felében bemutatjuk az Instagram általános jellemzőit, második felében a gyűjtött empirikus adatok feldolgozását és az eredmények értelmezését foglaljuk össze.",
    "keywords": [],
    "generated_keywords": [
      "Facebook",
      "Facebookkal",
      "Instagram",
      "Instagram-használati",
      "Instagramot"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2016,
    "title": "A Székelyföldi Legendárium marketingstratégiája",
    "students": [
      {
        "name": "Orbán Kincső",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Zsigmond István",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatomban a Székelyföldi Legendárium promóciós tevékenységét mutatom be. Megvizsgálom, hogy milyen a termékpolitikájuk, az árpolitikájuk, milyen helyeken forgalmazzák a termékeket, és milyen kommunikációs politikát folytatnak. Az elméleti részben olvashatunk a marketing elméleti megközelítéséről, majd később a Legendárium kapcsán is. Meddig folytatódhat még ez a sikertörténet, és mi a titka? Ezekre a kérdésekre próbálok választ adni.",
    "keywords": [],
    "generated_keywords": [
      "Ezekre",
      "Legendárium",
      "Megvizsgálom",
      "Székelyföldi Legendárium"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2016,
    "title": "Az okostelefon, mely aulát hódít",
    "students": [
      {
        "name": "Ferencz Beáta Zita",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Gagyi József",
        "university": "Sapientia EMTE, egyetemi tanár"
      }
    ],
    "content": "Dolgozatom célja a Sapientia EMTE marosvásárhelyi helyszínén az okostelefon megjelenésének és használatának vizsgálata. Kutatásom során választ akartam kapni arra, hogy milyen jelentőséget adnak a Z-generáció aktív tagjai az okostelefon különböző használatának, valamint hogyan alakul a készülékkel kapcsolatos magatartásuk a köztereken. Annak érdekében, hogy ezt feltérképezhessem és eredményhez juthassak, leginkább kvalitatív módszereket alkalmaztam (félig strukturált interjú és a készített fényképeken láthatóak magyarázata, elemzése). Megfigyelés során öt napon keresztül kétszer: délben és egykor fényképeket készítettem az egyetemi hallgatókról és telefonhasználatukról. A fogalmak kidolgozásánál és a jelenségek hátterének bemutatásánál többek közt támaszkodtam Guld Ádám, Maksa Gyula: Fiatalok kommunikációjának és médiahasználatának vizsgálata című kutatására, Chatfield Tom: Hogyan boldoguljunk a digitális korban? című tanulmányára, továbbá Prensky Márk: Digitális bennszülöttek, digitális bevándorlók című tanulmányára. Eredményeim közt szerepel az, hogy egyetemünk hallgatóinak mindennapjaiban az okostelefon nagy jelentőséggel bír függetlenül attól, hogy épp társaságba vannak, valakivel beszélgetnek, vagy épp egyedül vannak és várakoznak.",
    "keywords": [],
    "generated_keywords": [
      "Chatfield Tom",
      "Eredményeim",
      "Fiatalok",
      "Guld Ádám",
      "Hogyan"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2016,
    "title": "A szürke ötven árnyalata: egy filmblog több szempontú médiaelemzése",
    "students": [
      {
        "name": "Heidel Zsuzsa Evelin",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 1. év"
      },
      {
        "name": "Puskás István",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 1. év"
      },
      {
        "name": "Scheck-Dunai Eliz",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Tőkés Gyöngyvér",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatunkban a Szürke ötven árnyalata című filmmel kapcsolatos, illetve rá vonatkozó 3 audiovizuális médiaműfajt vizsgálunk, amelyek kizárólag a Youtube felületén érhetők el. A három médiatartalom a következő: 1/ a filmelőzetes, 2/ a Szirmai Gergely által készített videoblog és 3/ a film megjelenése után berobbanó kisebb paródiák (abszurd videók). Kutatásunk célja kideríteni, hogy a konkrét filmre épülő három médiaműfaj milyen különbségekkel és hasonlóságokkal rendelkezik, hangsúlyosan követve azt, hogy melyik médiaműfaj váltja ki a legtöbb nézettséget, illetve milyen közhangulatot teremt a pozitív vagy negatív hozzászólások (kommentek) révén. Kutatásunk első részében a Youtube működési elveit és médiamegosztási lehetőségeit, közösségteremtő funkcióját vizsgáljuk. Ezután a filmelőzetesek sikerének a kérdésére fektetjük a hangsúlyt, vagyis arra, hogy a filmelőzetes miért is befolyásolja egy film nézettségének arányát, és miért jelennek meg paródiák és kritikák. Ezután tanulmányozzuk A szürke ötven árnyalata című film előzetesét, illetve az előzeteshez tartozó like-ok és dislike-ok kommunikációs üzenetét. A kutatásunkat a filmről szóló videoblog elemzésével, illetve a paródiák elemzésével folytatjuk, szintén figyelve a visszajelzésekre, kommentekre. A videók alatt megjelenő első 10 hozzászólás pozitív és negatív jellegének tanulmányozása mellett kitérünk a komment tartalmára is, vagyis arra, hogy milyen érzelmi állapotot váltott ki a kommentelőből a videó, illetve milyen kommunikációs formákat használt véleménye elmondásához (szarkazmus, rejtett humor, irónia). A kutatásunk fő módszere a tematikus tartalomelemzés. A dolgozatunk végén összegeztük az eredményeinket, majd megfogalmaztuk a konklúziókat és a kutatás folytatásának lehetőségeit.",
    "keywords": [],
    "generated_keywords": [
      "A szürke ötven árnyalata című",
      "Szirmai Gergely",
      "Szürke",
      "Youtube",
      "megjelenése után berobbanó"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2016,
    "title": "Elvárások egy helyi kortárs rádióadó internetes önmegjelenítésével szemben",
    "students": [
      {
        "name": "Deák Zsombor-Levente",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fülöp Otília",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatomban azt tárgyalom, hogy milyen elvárások támaszthatóak egy helyi kortárs rádióadó internetes önmegjelenítésével szemben. A megfigyelt tendenciák alapján a rádiózás jövője az online felületeken fog zajlani, ezért fontos, hogy miként tekintenek a rádióadók magára a médiumra, és milyen szerepet tulajdonítanak ennek. A megfigyeléseim során létrehoztam egy olyan szempontrendszert, amelynek minden rádióadó weboldalának meg kellene felelnie a siker érdekében. Ezt követően vizsgáltam, valamint tartalmilag és arculatilag elemeztem a Marosvásárhelyi Rádió és az Erdély FM weboldalát az általam létrehozott szempontrendszer alapján. Végül párhuzamba állítottam a két weblapot egymással, az innen kapott eredményeket táblázatban összesítettem, és végkövetkeztetéseket vontam le. Célom az volt, hogy megvizsgáljam, miként tanúskodnak az általam kiválasztott rádióadók honlapjai a mai médiakörnyezetben arról, hogy a rádióhallgatás sokkal inkább az online felületek közvetítésével zajlik. Az internetes megjelenést értékelő szempontrendszerrel segítséget szeretnék nyújtani mindazon rádióadók számára, akik még nem rendelkeznek ütőképes online felülettel/weboldallal. A szempontok betartása a naprakész, friss, működő online kommunikációs felület garanciája.",
    "keywords": [],
    "generated_keywords": [
      "Célom",
      "Erdély FM",
      "Marosvásárhelyi Rádió",
      "felület garanciája",
      "meg kellene"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2016,
    "title": "Reszponzív felhasználóbarátság a Sapientia honlapján",
    "students": [
      {
        "name": "Böjthe Emőke",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fülöp Otília",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Mit üzenhet egy weboldal? Milyen egy ergonomikus honlap? Milyenek a felhasználóbarát oldalak? Alapvető elvárás a XXI. században, hogy egy weboldal reszponzív legyen, hiszen a digitális eszközök rohamosan fejlődnek, és fontos, hogy elérhetőek legyenek az online tartalmak. Mindezen feltételek mellett fontos a design is, ami megragadja a célcsoport figyelmét. Esettanulmányomat a Sapientia EMTE honlapján végeztem, amely négy kar honlapját öleli fel az ország különböző pontjain, honlapjuk mégis egységes struktúrával és kinézettel rendelkezik. A Sapientia EMTE weboldalán végzett empirikus kutatásom során a fent említett kérdésekre keresek válaszokat, de nem csak. Megvizsgálom az egyetem honlapját különböző elméleti szempontok szerint, melyeket a szakirodalom alapján állítottam össze. Összehasonlítom továbbá a honlap kommunikációját a különböző nyelvű célcsoportokkal azt vizsgálva, hogy az egyetem azonos információkat közöl-e az érdeklődők számára.",
    "keywords": [],
    "generated_keywords": [
      "Megvizsgálom",
      "Milyen",
      "Mindezen",
      "Sapientia",
      "Sapientia EMTE"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2016,
    "title": "Műsorok és közönségük a hálón - esettanulmány az Erdélyi Magyar Televízió 2016-os saját gyártású állandó magazinműsorairól",
    "students": [
      {
        "name": "Hamar Mátyás Ruben",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fülöp Otília",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A televízió hatással van a néző világról alkotott képétől kezdve a társadalomban vállalt szerepén át a nyelvhasználatig. Dolgozatomban a televízió átalakulását és internettel való konvergenciáját vizsgálom az Erdélyi Magyar Televízió magazinműsorainak és azok internetes jelenlétének példáján keresztül. Kitérek az amatőr-professzionális tartalom ellentétpárosra, példaként felhozva a kettő együttes jelenlétére egy videoblogot, a Hollywood News Agencyt. Az elemzés támpontokat kíván adni a kisebbségi televíziózás lehetséges igazodásaihoz úgy, hogy felderíti és leírja azon pontjait az ETV műsorkínálatának, amelyek egy új műsor létjogosultságát alapozzák meg. Továbbá a jelenlegi és az „ideális” műsorkínálat összehasonlítása folytán a kisebbségi televízió-, illetve a közszolgálati-kereskedelemi jelleg egyedi lehetőségeire kíván rávilágítani. Mindezt úgy, hogy reflektál az új trendekre, a közönségkapcsolat kérdéseire, illetve a nézettségi mutatókra.",
    "keywords": [],
    "generated_keywords": [
      "ETV",
      "Erdélyi Magyar Televízió",
      "Hollywood News Agencyt",
      "Kitérek",
      "alkotott képétől"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2016,
    "title": "A székelyföldi Közösségi Kártya marketingkommunikációja",
    "students": [
      {
        "name": "Már Norbert",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Zsigmond István",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Kutatásom során a Székelyudvarhelyi Közösségi Alapítvány, Közösségi Kártya programját vizsgáltam. Dolgozatom első felében részletesen taglalom a PR és marketing kapcsolatát, valamint kitérek a kampánytervezés lépéseire is. Ezt követően bemutatom módszereim, melyek közé tartozik a strukturált interjú, mely segítségével a kártya ötletének eredetét és marketingkommunikációs stratégiáját igyekeztem feltérképezni. Ugyanakkor imázsvizsgálatot végeztem kérdőívezés segítségével. A kérdőívekkel online formában 150 Közösségi Kártya tulajdonost kérdeztem meg főként arról, milyennek is látják az adott szolgáltatást. Dolgozatom másik felében bemutatom a kapott eredményeket és az azok tükrében készített kampánytervet, mely rávilágít az esetleges problémákra vagy hibákra, és igyekszik kiküszöbölni azokat.",
    "keywords": [],
    "generated_keywords": [
      "Közösségi Kártya",
      "PR",
      "Székelyudvarhelyi Közösségi Alapítvány",
      "Ugyanakkor",
      "kapott eredményeket"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2016,
    "title": "A Passion étterem kommunikációs kampánytervezete",
    "students": [
      {
        "name": "Stefan Renáta",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Zsigmond István",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjainkban Marosvásárhelyen szinte érik egymást a különböző érdekesebbnél érdekesebb díszítéssel ellátott vendéglők, és mindent megtesznek azért, hogy az embereket becsalogassák. De honnan legyünk biztosak abban, hogy a megfelelő helyet választjuk a megfelelő alkalomra? A dolgozatom célja megvizsgálni a Passion vendéglő erősségét és gyengeségét, valamint a feltárt gyengeségeket alapul véve egy kommunikációs kampányt készíteni. A legfontosabb célom, hogy a hétköznapi kihasználtságot növeljem kampány, reklám segítségével, mely előbbre juttatná a vendéglőt a helyi emberek tudatában ahhoz, hogy ezt a helyet válasszák.",
    "keywords": [],
    "generated_keywords": [
      "Napjainkban Marosvásárhelyen",
      "Passion",
      "helyi emberek",
      "megfelelő helyet"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2016,
    "title": "A Maros Megyei Közegészségügyi Hatóság külső szervezeti kommunikációja",
    "students": [
      {
        "name": "Szalay Tünde",
        "major": "Sapientia EMTE, Közegészségügy, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Tőkés Gyöngyvér",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A kutatásom célja elemezni, hogy mennyire hatékony a Maros Megyei Közegészségügyi Hatóság külső szervezeti kommunikációja, ezen belül részletesen kitérve a weboldalon keresztüli online kommunikációra. A kutatás hiányterületet érint, hiszen a romániai szervezetek kommunikációs vizsgálata szinte teljesen hiányzik a romániai szakirodalomból. A romániai szervezeteken belül kiemelt helyet foglalnak el az egészségügyi szervezetek, amelyek jelentős számú ügyféllel rendelkeznek, akikkel kapcsolatot tartani az online csatornákon lehetséges a leghatékonyabban. A dolgozatom első részében átfogó képet mutatok be a szervezet társadalmi funkciójáról, céljairól és működéséről, illetve kifejtett tevékenységéről. A kutatás fő része a szervezet online kommunikációjára kiélezett elemzés a honlap tartalmi és formai elemzése által. A dolgozatomat a honlap kommunikációs elemzési eredményeinek összefoglalásával és fejlesztési javaslatok megfogalmazásával zárom.",
    "keywords": [],
    "generated_keywords": [
      "Maros Megyei Közegészségügyi",
      "weboldalon"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2016,
    "title": "Digitális műveltség",
    "students": [
      {
        "name": "Szegedi Henrietta",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fülöp Otília",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A XXI. században élve elengedhetetlen dolog, hogy a technológiai vívmányok által kibocsátott impulzusokat ne vegyük észre, ne érzékeljük azokat. Lépten-nyomon találkozunk „okos” dolgokkal, elég egy sétát tennünk egy forgalmasabb utcán. Az emberek GPS-sel, okostelefonnal navigálnak, telefonálnak, pötyögtetik őket, mára már digitális leütéseik száma megegyezik a lépéseik számával, vagy annál is többel. Rohamos fejlődnek a technológiai eszközök, és még rohamosabban nő azok száma, akik szomjazzák az újat. Számos kutatás készült arról, hogy egyes társadalmakban mit is jelen a számítógép, internet, technológia, hogy egyes csoportok, korosztályok hogyan használják ezeket az eszközöket, milyen hatások érik őket ezekből kifolyólag. Laikus szemmel nézve hajlamosak vagyunk kijelenteni, hogy az Új generáció, a Z generáció, akik a technológia világába születtek, akiket Digitális Bennszülötteknek neveznek, sokkal jobban értenek minden olyan dologhoz, ami digitálisan működik, ami SMART, mint elődeik, az Y generáció tagjai. Kutatásomban azt szeretném bizonyítani, hogy nem feltétlenül a generációtól függ egy egyén digitális műveltségének a szintje, összehasonlítom a Z és Y generáció digitális kultúráját. Mivel kutatásom a Marosvásárhelyi Sapientia EMTE másod- és harmadéves hallgatói egy részére és az itt dolgozók kis csoportjára terjed ki, nem sikerül majd teljes mértékben áttekinthető képet nyújtani a generációk közötti digitális szokások hasonlóságát, digitális kompetenciáikat illetően, de egyfajta kiindulópontot jelenthet más, ezzel a témával foglalkozó kutatáshoz.",
    "keywords": [],
    "generated_keywords": [
      "Digitális Bennszülötteknek",
      "Kutatásomban",
      "Laikus",
      "Lépten-nyomon",
      "Marosvásárhelyi Sapientia"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2016,
    "title": "PR-kampány tervezet a Csíkszeredai Sportklub jégkorongcsapat mérkőzéseinek népszerűsítésére",
    "students": [
      {
        "name": "Gerczuj Timea",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Zsigmond István",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Csíkszeredában már évtizedek óta jelen van a jégkorong az emberek életében. Azóta, hogy egy tévéreklámnak köszönhetően néhány lelkes fiatalember úgy gondolta, ők is tudnák űzni ezt a sportágat, neki is láttak. A városban gyorsan népszerűvé vált ez a Kanadából indult sportág, és mára már talán nincs is olyan ember Csíkszeredában, aki ne tudná, mi is az a jégkorong. Az évtizedek alatt volt, hogy hatalmas érdeklődés lengte körül a csapatot, de voltak olyan időszakok is, amikor épp mélyponton volt a város szeretett sportja. Dolgozatomban egy PR-kampány tervezetet készítek a Sportklub Csíkszereda jégkorongcsapat mérkőzéseinek népszerűsítése érdekében, mellyel fő célom minél több szurkoló bevonzása a mérkőzésekre. A kampányterv elkészítése előtt egy fogyasztóimagatartás-vizsgálatot végeztem kérdőív segítségével, mellyel az volt a célom, hogy feltérképezzem a csíkszeredai szurkolók motivációit. Ugyanakkor a mérkőzések alkalmával résztvevő megfigyelést is végeztem, mely során a szurkolók viselkedését, magatartásformáit figyeltem meg, hogy ezáltal is jobban megérthessem, mi vezérli őket arra, hogy kilátogassanak a mérkőzésekre. Összességében a dolgozatom célja, hogy egy esetleges irányt, kiindulópontot mutathassak a klub számára abban, hogyan kommunikálhatnak a meglévő és potenciális szurkolóik felé.",
    "keywords": [],
    "generated_keywords": [
      "Azóta",
      "Csíkszeredában",
      "Kanadából",
      "Sportklub Csíkszereda",
      "Ugyanakkor"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2016,
    "title": "Nonprofit szervezetek online kommunikációja. Esettanulmány a Gyulafehérvári Caritas szervezetről",
    "students": [
      {
        "name": "Burian Erika",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Tőkés Gyöngyvér",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Az online tartalmak hatnak a kapcsolatok előmozdítására. Az információ keresése önmagában nem szabad nehéz legyen, könnyen hozzá kell jutniuk az embereknek az információhoz, ezért szükséges az, hogy a rendszer ne gátolja az érdeklődőket a tudás megszerzésében (Sharratt, Usoro 2002). Kutatásom során az online felületeken való kommunikációra, ezen belül pedig a Gyulafehérvári Caritas szervezet online kommunikációjára fókuszálok. Az elméleti bevezetőben részletezem az online kommunikáció fontosságát, majd kitérek a szervezet külső és belső kommunikációjának fontosságára, ugyanakkor figyelembe veszem azt is, hogy milyen hatással van a külső változó környezet a szervezet működésének minőségére, melyet a módszertani vizsgálat bemutatása követ.",
    "keywords": [],
    "generated_keywords": [
      "Gyulafehérvári Caritas",
      "Usoro",
      "könnyen hozzá kell jutniuk"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2016,
    "title": "Irodalmi portálok népszerűsítése a fiatalok körében a vizuális arculat révén",
    "students": [
      {
        "name": "Traicu Andreea",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fülöp Otília",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A technológia rohamos fejlődése arra ösztönzi a különböző művészeti ágazatokat is, hogy jelenlétet biztosítsanak az online felületeken. Ez a jelenlét maga után vonja annak a kényszerét, hogy időről időre ezek a tartalmak és a tároló felületük (honlapok, portálok) vizuálisan megújuljanak. Az internet magába foglalja azokat a lehetőségeket és újításokat, amelyek a posztmodern világ szemléletmódját nagyban befolyásolják. Ám mégis fontos szem előtt tartanunk elsőként a lehetőségeket, hiszen eddig sosem képzelt határtalanságot birtokolhatunk, a tartalmak, amelyeket közzéteszünk, másodpercek alatt elérhetővé válnak a felhasználók számára, a célcsoportunk bárki lehet, akit kicsit is érdekel az általunk kínált téma. A vizuális arculat minden esetben azt a pluszt jelenti, amely segít népszerűsíteni az adott tartalmakat. Az irodalom esetében egy portál vizuális arculata több, hiszen a különböző irodalmi alkotások igénylik a kontextust, a környezetet, amelybe beleépítjük őket, és ha illeszkednek egymáshoz, akkor jól működő viszony alakul ki közöttük. Nagyon hálás egy ilyen kapcsolat, viszont a vizuális elemekkel, a színhasználattal, a képhasználattal, a szövegdobozok elrendezésével nagyon óvatosan kell bánni, mivel illeszkedniük kell egymáshoz, mint a sejteknek egy organizmusban. A dolgozatom témáját négy irodalmi portál szolgáltatta. Hipotézisem alapján ezek a honlapom az utóbbi években a vizuális arculati elemek segítségével és a különböző tartalmakkal egyre jobban betörnek a fiatal generáció közegébe. Hangsúlyosan kitértem a webdizájnra is, hiszen elengedhetetlen ez a tevékenység ahhoz, hogy az oldal ízléses, és könnyen átlátható legyen, illetve illeszkedjen a témához.",
    "keywords": [],
    "generated_keywords": [
      "Hangsúlyosan",
      "Nagyon",
      "határtalanságot birtokolhatunk",
      "jelenlétet biztosítsanak",
      "kell"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2016,
    "title": "Szakrális és profán időhasználat a közösség életében, különös tekintettel a Mustármag közösségre",
    "students": [
      {
        "name": "Pista Mónika",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gagyi József",
        "university": "Sapientia EMTE, egyetemi tanár"
      }
    ],
    "content": "Dolgozatom a szakrális és profán időhasználat témakörének vizsgálatát tűzte ki célul, ebből kiindulva többek között arra kerestem a választ, hogy a szakrális időtöltés mennyiben alakítja és formálja a közösséget, egy viselkedés hogyan alakul át szakrálissá, mi teszi azzá, valamint hogy nevezhető-e egyáltalán teljességgel szakrálisnak egy tevékenység. A szakirodalmi hátterem alátámasztásához többek között olyan tételekre hivatkoztam, mint Bartha Elek Vallási terek szellemi öröksége című írása, továbbá Csányi Vilmos több könyvéből is inspirálódtam, ahogyan Mircea Eliade A szent és a profán, valamint Emile Durkheim A vallási élet elemi formái írásai is hasznomra váltak a kutatás során. Az idő témájának jobb megértésében segített a Fejős Zoltán által szerkesztett A megfoghatatlan idő című összeállítás, ugyanakkor Warner Gitt Idő és örökkévalóság című könyve is hasznos információkkal látott el. Kutatásom időbeli kerete a 2013-2014-es év, térbeli kerete a Szent Imre Kollégium, populációm a Mustármag közösség, az ebből választott mintát a 2014-ben kiköltözött 14 személy képezi. Adataimat a kikérdezés két módszerével, azaz az ankét és az interjú módszerével gyűjtöttem, a kapott információkat pedig minőségi elemzés módszerével dolgoztam fel. Az adatok feldolgozását követően megtudtam, hogyan válik egy embercsoport közösséggé, milyen időbeosztás, milyen tevékenységek segítenek hozzá a közösségalakuláshoz, egyáltalán milyen jellemvonásokkal bír egy közösség.",
    "keywords": [
      "szakrális",
      "profán",
      "idő",
      "közösség",
      "Szent Imre Kollégium",
      "Mustármag Közösség."
    ],
    "generated_keywords": [
      "Bartha Elek Vallási",
      "Csányi Vilmos",
      "Emile Durkheim",
      "Fejős Zoltán",
      "Gitt Idő"
    ]
  },
  {
    "major": "Egészségmagatartás",
    "year": 2016,
    "title": "A felsőoktatásban résztvevő fogyatékossággal élő hallgatók nézetei saját helyzetükről és felsőoktatási integrációjukról",
    "students": [
      {
        "name": "Papp Vanda",
        "major": "Eszterházy Károly Főiskola, Szociálpedagógia, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Kolozsvári Csaba",
        "university": "Eszterházy Károly Főiskola, tanársegéd, Fogyatékosságügyi koordinátor"
      },
      {
        "name": "Dr. Pacsuta István",
        "university": "Eszterházy Károly Főiskola, főiskolai adjunktus"
      }
    ],
    "content": "Mindannyian találkoztunk már olyan emberekkel, akik valamilyen fogyatékossággal élnek. Ez az állapot megnehezíti a mindennapjaikat, a társadalomban való egyenlő részvételüket és az alapvető emberi joguk gyakorlását is. A fogyatékosság nem betegség, hanem egy állapot, amit koronként eltérően ítéltek meg, és aminek megkönnyítésében nagy szerepe van a társadalom befogadóképességének és szemléletének. Ez azonban csak az érme egyik oldala. Ami számomra sokkal fontosabb kérdés, az az, hogy maguk a fogyatékkal élők hogyan is élik meg és ítélik meg mindezt. Mivel ez egy tágabban értelmezhető téma, így én a felsőoktatásban részt vevő, fogyatékossággal élő fiatalok professzionális segítségnyújtásának keretein belül biztosított többletszolgáltatások, valamint saját integrációs folyamatuk eredményességének különbsége és ezekről kialakult nézeteik oldaláról vizsgálom. A felsőoktatásban való részvételük nagy jelentőséggel bír, hiszen bizonyított, hogy a fogyatékkal élő emberek számára sokkal jobb perspektívát biztosít a szellemi munka. Azonban ahhoz, hogy az érintett hallgatók a felsőoktatási intézményekben hatékonyan és problémamentesen tudjanak tanulni, nagyon fontos az akadálymentesítettség és az iskola felkészültsége mind az eszközök, mind a szemléletmód tekintetében. A kutatás módszeréül a félig strukturált interjút választottam, amelynek megvalósítása még folyamatban van.",
    "keywords": [],
    "generated_keywords": [
      "Mindannyian",
      "az az",
      "hanem egy állapot",
      "jelentőséggel bír",
      "még"
    ]
  },
  {
    "major": "Egészségmagatartás",
    "year": 2016,
    "title": "Fókuszban a webdiagnózis: „inkább rákeresek a neten is”",
    "students": [
      {
        "name": "Mészáros Orsolya Henrietta",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Krizbai Tímea",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: az életünket ma már talán el sem tudnánk képzelni internet nélkül. Olyan szerepet tölt be, amit pár évvel ezelőtt nem is gondoltunk volna. Nagy segítség lehet, hiszen már perceken belül szinte bármire rá tudunk keresni kisebb-nagyobb sikerrel. Viszont azt sem szabad figyelmen kívül hagynunk, hogy ez veszélyeket is rejt. Nem mindig azt a hiteles információt kapjuk, amit szeretnénk. Ez a tény ellenben nem befolyásol bennünket, hiszen szinte minden nap használjuk az internetet kapcsolattartás, munka vagy akár csak szórakozás céljából. Célkitűzések: a kutatás célja az lenne, hogy fényt derítsen arra, hogy a felnőtt emberek mennyire használják az internetet annak érdekében, hogy felmérjék egészségüket még mielőtt szakorvoshoz fordulnának. Feltételezhető, hogy az öndiagnosztizálás korunkra egyre inkább elterjedt, hiszen az internetbe vetett bizalom lassacskán felér egy orvosi véleménnyel, diagnosztizálással. A mai rohanó világban az embereknek szinte semmire sincs idejük, éppen ezért arra sem szakítanak időt, hogy szakemberhez forduljanak. Módszerek és eszközök: a vizsgálati populáció minimum 100 felnőtt személy (25 év feletti). A vizsgálat online kérdőív segítségével történik, és arra vagyunk kíváncsiak, milyen gyakran használják az internetet öndiagnózisra, mielőtt orvoshoz fordulnának. Továbbá arra is szeretnénk nagyobb figyelmet fordítani, hogy megtudjuk mekkora eltérés figyelhető meg a nők és a férfiak körében. A vizsgálati populációt a Facebookon keresztül célozzuk meg. Eredmények: várható eredmény az, hogy az emberek hamarabb fordulnak internetes segítséghez, mint orvoshoz, valamint hogy a nők inkább keresik fel orvosukat, mint a férfiak, hiszen a férfiak alapból kevesebbet foglalkoznak az egészségükkel (Lyons és Chamberlain.2006). Következtetés: Ha a feltételezett eredmények beigazolódnak, fontos lenne azon gondolkodni, hogy az egészségügyi rendszereket hogyan érdemes átszervezni, miként módosul ezáltal az orvos-beteg kapcsolat, és mi a teendő.",
    "keywords": [],
    "generated_keywords": [
      "Chamberlain.2006",
      "Facebookon",
      "Feltételezhető",
      "Lyons",
      "Módszerek"
    ]
  },
  {
    "major": "Egészségmagatartás",
    "year": 2016,
    "title": "A média hatása a gyerekek agresszivitására",
    "students": [
      {
        "name": "Magyari Timea",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Krizbai Tímea",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: a kommunikációban a média az információ rögzítésére és közvetítésére használt eszközöket jelenti. A média szót gyakran használják a tömegtájékoztatási eszközök szinonimájaként. A filmekben, sorozatokban sokszor jelenik meg erőszak. Az emberek elveszíthetik józan ítélőképességüket, többé nem tudnak különbséget tenni a tévében látott és a valóságos világ között. A televízió a gyerekekre gyakorolt hatásában a legaggasztóbb, hogy nagyon sok gyerek válogatás nélkül néz, nézhet bármilyen műsort. Ezért is nevezik a tévét gyakran „elektronikus bébiszitternek”, „vezetékes drognak”. Célkitűzések: jelen vizsgálat célja a gyerekek médiafogyasztási szokásainak a vizsgálata a szülők prizmáján keresztül, illetve annak kutatása, hogy a gyerekek agresszivitását milyen mértékben befolyásolhatja a média. Módszerek és eszközök: a vizsgálati populáció 18 gyerek (6-7év), akik egy kísérletben vesznek részt. A foglalkozás első felében az egyik csoport agresszív tartalmú, a másik csoport vidám, agresszivitásmentes filmet néz. Ezt követően mindkét csoport külön foglalkozáson vesz részt, és azt figyeljük, hogy a film milyen hatással volt a viselkedésükre. Ugyanakkor minden gyerek szüleivel kérdőívet töltetünk ki, mellyel felmérjük a gyerek otthoni tévé-, internet-, számítógép- és okostelefon-használati szokásait. Eredmények: a várható eredmény az, hogy az agresszív film nézése hatással van a gyerekek viselkedésére, ugyanakkor agresszív viselkedést is kiválthat bennük. Következtetés: Fontos, hogy korlátozva legyen az, hogy mit nézhet a gyerek a tévében vagy az interneten, hogy milyen játékokat játszik, mivel ezzel is megelőzhetjük a gyerekekben kialakuló agresszivitást.",
    "keywords": [],
    "generated_keywords": [
      "Ezért",
      "Fontos",
      "Módszerek",
      "Ugyanakkor",
      "hogy"
    ]
  },
  {
    "major": "Egészségmagatartás",
    "year": 2016,
    "title": "Adoptált gyerekek kíváncsisága: „kik a biológiai szüleim, miért lett ez a sorsom”?",
    "students": [
      {
        "name": "Pataki Tímea",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Krizbai Timea",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      },
      {
        "name": "Dr. Sántha Ágnes",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: ha az „örökbefogadás” szót két részre bontjuk, az „örökbe” és a „fogadás” szavakat kapjuk és használjuk. De mit is jelent, ha valakit örökbe fogadnak? Az örökbefogadás következtében a szülők egy gyermeket örökre befogadnak az életükbe, saját vér szerinti gyermekükként nevelik. Az örökbefogadott személy meghívást kap a szülők életébe, felkérik őt arra, hogy vegyen részt az örömeikben és a csalódásaikban is egyaránt. Óriási vállalkozás ez, hiszen ez tényleg örökre szól! Ha a szülők úgy döntenek, hogy egy gyermeket mindörökre befogadnak az életükbe, akkor felelősséget vállalnak érte és megengedik, hogy egyszer majd ő is felelősséget vállaljon értük. Azzal, hogy örökbe fogad, nemcsak a szülő élete, hanem az örökbefogadott gyermeké is teljesen megváltozik. Célkitűzések: jelen vizsgálat célja bepillantást nyerni azoknak a személyek életébe, akik örökbefogadottként nem a vér szerinti szüleikkel, hanem nevelőszülőkkel élnek. Választ keresünk arra, hogy az örökbefogadott egyének kíváncsiak-e biológiai szüleikre, illetve arra, hogy miért is kerültek ebbe a helyzetbe (miért hagyták el őket). Módszerek és eszközök: 5 személlyel végzünk részben strukturált életút-interjút, majd ezek az esetek esettanulmányok formájában kerülnek bemutatásra. A kutatás módszere az interjú. A témára hangolt kérdésekkel arra szeretnénk választ kapni, hogy az örökbefogadott egyének kíváncsiak-e a biológiai szüleikre, illetve arra, hogy miért is kerültek adoptálásra. Eredmények: várható eredmény az, hogy az örökbefogadott egyének igenis kíváncsiak a gyökereikre, a biológiai szüleikre, illetve annak okára, hogy miért kerültek örökbefogadott szerepbe. Ez nem azt jelenti, hogy az örökbefogadó szülő bármit rosszul tett volna, vagy a gyermek őt nem szeretné, viszont az emberi kíváncsiság ilyen esetben erősebb lehet. Következtetés: Feltételezhető és az eredmények alapján megállapíthatóvá válik, hogy az örökbefogadott egyének életében jelen van az a kérdés, hogy honnan is származnak, és miért is hagyták el őket. Feltételezhető, hogy mindenki tudni szeretné, kik a vér szerinti szülei.",
    "keywords": [],
    "generated_keywords": [
      "Azzal",
      "Feltételezhető",
      "Módszerek",
      "Választ",
      "biológiai szüleikre"
    ]
  },
  {
    "major": "Egészségmagatartás",
    "year": 2016,
    "title": "A gyógyszerek mellékhatásainak jelentése: az egészségügy szereplőinek közös érdeke és feladata",
    "students": [
      {
        "name": "Nyulas Kinga Ilona",
        "major": "Sapientia EMTE, Egészségügyi szakpolitikák és szolgáltatások, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Krizbai Tímea",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: az 1960-as években bekövetkezett thalidomid-tragédia felhívta a világ figyelmét a gyógyszerek alkalmazása során szerzett tapasztalatok, a mellékhatások és az előny/kockázat arány rendszeres és szisztematikus értékelésének szükségességére. Az új tudományágként megszületett gyógyszerbiztonság (farmakovigilancia), valamint a kialakított és folyamatos fejlesztés alatt álló nemzetközi szabályozó rendszerek célja az emberi felhasználásra szánt gyógyszerek biztonságosságának növelése és a nem kívánt hatások káros következményeinek csökkentése. Módszerek és eszközök: a Gyógyszerek és Gyógyászati Segédeszközök Nemzeti Hivatalához (National Agency of Medicines and Medical Devices) 2005-2014 között bejelentett mellékhatás-esetek mennyiségi elemzése az Európai Gyógyszerügynökség (European Medicines Agency) által 2012-ben életbeléptetett új irányelvek és jogi szabályozások, valamint a helyi hatóság által foganatosított intézményes beavatkozások kontextusában. Eredmények: a 2014-ben történt bejelentések (2054 eset) száma közel ötszöröse a 2005-ben jelentett mellékhatások számának (418 eset). Mindezek ellenére, a nemzetközi adatokkal összehasonlítva, Romániában a mellékhatások jelentése elmarad a kívánatos mértéktől. A gyógyszerek mellékhatásainak jelentése számtalan esetben nem történik meg az érintettek tájékozatlansága, bátortalansága, közömbössége vagy időhiánya miatt. Mindez a farmakovigilancia- rendszer hatékony működését akadályozza, és hátráltatja a gyógyszerek előny/kockázat viszonyának nyomon követését. Következtetés: az új farmakovigilancia-irányelv által létrehozott uniós mellékhatás-jelentési mechanizmus fokozatos előrelépést jelent, valamint a gyógyszerészi, egészségügyi dolgozói és lakossági szerepvállalás erősödése következtében szintén javulás várható.",
    "keywords": [],
    "generated_keywords": [
      "European Medicines Agency",
      "Európai Gyógyszerügynökség",
      "Gyógyszerek",
      "Gyógyászati Segédeszközök Nemzeti Hivatalához",
      "Mindez"
    ]
  },
  {
    "major": "Egészségmagatartás",
    "year": 2016,
    "title": "Bőrbetegségben szenvedő fiatalok ismeretei a betegség alakulásáról és gyógyítási lehetőségeiről",
    "students": [
      {
        "name": "Szalay Tünde",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Horváth Zsófia",
        "university": "Sapientia Erdélyi Magyar Tudomány Egyetem, tanársegéd"
      }
    ],
    "content": "Dolgozatom témája a fiatalok bőrbetegségekkel kapcsolatos tájékozottsága. Az allergiás betegségek egyre gyakoribbá válása már egészen a csecsemőkortól kezdve világszerte sokat kutatott probléma. A statisztikák szerint az előfordulás gyakorisága 20% körüli, azaz minimálisan minden ötödik kisgyerek érintett (Gyarmaty 2013). Vizsgálatom célja a bőrbetegségekkel kapcsolatos ismeretek gyakoriságának, minőségének és változatosságának a feltárása a Romániában élő fiatalok körében, illetve a bőrbetegségben szenvedő vizsgálati személyek betegségükkel kapcsolatos tájékozottságának a felmérése. Kutatási kérdéseim, hogy milyen kezelést alkalmaznak a gyógyulás érdekében, milyen gyakori a gyógyszeres kezelések alkalmazása, valamint alkalmaznak-e alternatív gyógymódokat. A felmérésemet kérdőív segítségével végeztem. A kutatási mintát több mint 100 romániai magyar fiatal alkotja. Vizsgálati eredményeim szerint a megkérdezett személyek tájékozottak betegségeik tüneteivel és kezelésével kapcsolatosan, valamint a betegségük kezeléséhez szükséges eszközök és gyógyhatású anyagok megfelelőek.",
    "keywords": [
      "bőrbetegségek",
      "tájékozottság",
      "kezelési módok "
    ],
    "generated_keywords": []
  },
  {
    "major": "Egészségmagatartás",
    "year": 2016,
    "title": "Romániai magyar és román nemzetiségű fiatalok életminőségének és szubjektív jóllétének összehasonlító vizsgálata",
    "students": [
      {
        "name": "Máté Szende-Anita",
        "major": "Sapientia, Közegészségügyi szolgáltatások és politikák, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Horváth Zsófia",
        "university": "Sapientia EMTE, tanársegéd"
      }
    ],
    "content": "Vizsgálatom célja a romániai magyar és román nemzetiségű fiatalok életminőségének és szubjektív jóllétének összehasonlítása, valamint az életkori, illetve iskolázottsági szintből adódó különbségek feltárása. A szubjektív életminőség azt fejezi ki, ahogyan az emberek saját életüket értékelik, és ez magába foglalja az élettel való elégedettséget, a boldogság érzését, a kellemes érzéseket, valamint a kellemetlen hangulatok és érzelmek relatív hiányát (Diener 1995). A legújabb nemzetközi kutatási eredmények (Eurobarometer 2015) azt mutatják, hogy különbség mutatható ki a magyar és román nemzetiségű fiatalok életminősége, szubjektív jólléte között. Dolgozatomban vizsgálom a román és magyar nemzetiségű fiatalok életcéljait, illetve ezek összefüggését az élettel és egészséggel való elégedettséggel. A vizsgálati minta 200 személyből áll, közülük 100 román és 100 magyar nemzetiségű. Eszközként a Crumbaugh és Maholick-féle Életcél Kérdőívet használtam, és az adatokat az SPSS statisztikai programban elemezve dolgozom fel.",
    "keywords": [],
    "generated_keywords": [
      "életminőség",
      "szubjektív jóllét",
      "életcél",
      "nemzetiségi összehasonlítás"
    ]
  },
  {
    "major": "Egészségmagatartás",
    "year": 2016,
    "title": "Az egészségtudatossággal és öngyógyítással kapcsolatos ismeretek közötti összefüggések empirikus vizsgálata",
    "students": [
      {
        "name": "Erdélyi Enikő",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fodor László",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Vizsgálatom célja, hogy feltárjam az egészséges fiatal felnőttek körében elterjedt operacionális ismeretek gyakoriságát, minőségét, változatosságát, ami az öngyógyítás jelenségét illeti. Tapasztalati tény, hogy az utóbbi években az öngyógyítás elterjedése észlelhető világszerte, egyrészt annak következtében, hogy az emberek kezükbe veszik az irányítást egészségük megőrzése vagy visszaállítása érdekében, másrészt pedig azért, mert a gyógyszeres kezelések rendszerint nagy pénzügyi terheket jelentenek (Fábián 2002). Dolgozatomban vizsgálom a fiatalok egészségtudatosságát, valamint a rosszindulatú daganatban szenvedő betegek alternatívgyógymód-használati gyakoriságát és a pozitív gondolatok gyógyító hatásával kapcsolatos ismeretek alkalmazását. Nyomon követem azt is, hogy az egészséges fiatalok és a krónikus betegségben szenvedő vizsgálati személyek mennyire bíznak az öngyógyításban, és milyen mértékben hagyatkoznak testük öngyógyító képességére. A vizsgálati mintámat 120 fiatal felnőtt (60 személy középiskolai végzettséggel rendelkezik, 60 személy pedig jelenleg felsőoktatásban tanul vagy egyetemi diplomával rendelkezik) és 10 rákos beteg (melyből 5 személy jelenleg is beteg, 5 személy pedig gyógyult, és tünetmentes egészségnek örvend) alkotja. A kutatási módszereként online kérdőívet és mélyinterjút alkalmaztam. A kérdőíves módszer segítségével nyert nyers adatok feldolgozására az SPSS statisztikai programot használtam. Vizsgálati eredményeim azt mutatják, hogy a magasabb iskolai végzettséggel és általános műveltséggel rendelkező személyek bővebb és pontosabb ismeretekkel rendelkeznek, ami az öngyógyítást illeti. A betegségekre hajlamosító tényezők között kulcsfontosságú a betegségtől való félelem és az ebből adódó szorongás. Szándékomban áll a téma kutatását tovább fejleszteni, nagyobb minták alkalmazásával és változatosabb módszerek segítségével.",
    "keywords": [],
    "generated_keywords": [
      "öngyógyítás",
      "egészségtudatosság",
      "rákbetegség",
      "alternatív gyógymódok"
    ]
  },
  {
    "major": "Egészségmagatartás",
    "year": 2016,
    "title": "Az egyetemisták pihenési szokásainak vizsgálata",
    "students": [
      {
        "name": "Gál Emőke",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Szentes Erzsébet",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Manapság az életcélok tekintetében az a szemlélet, hogy a személyiség mint önszabályozó rendszer rendelkezik bizonyos mértékű belső mozgástérrel és szabadsággal, ennek az önszabályozásnak egyik fontos alrendszere épp a célok felállítása és megvalósítása. A kitűzött célok tulajdonképpen a jövőbeni állapotok mentális reprezentációiként határozhatók meg, amelyek olyan motivációs erővel rendelkeznek, hogy irányítják az akaratlagos aktivitást (Martos 2010). Az egészséges életmód fontos szerepet játszik az egészségmegőrzésben, a betegség megelőzésben, valamint az életminőségben. Az egészséges életmódnak részét képezi az alvás és a megfelelő pihenés is. Az emberi szervezet számára szükséges a megfelelő alvás a napközbeni aktivitáshoz, ha ez nem valósul meg, akkor fáradtak, kimerültek leszünk, és nem tudunk megfelelően koncentrálni (Vida 2009). Vizsgálatom célja feltárni az egyetemisták pihenési és alvási szokásait, az alvási szokásokról megfogalmazódó véleményt, az életmód bizonyos elemeit, valamint felmérni azokat az életcélokat, aspirációkat, amelyek a vizsgált populációra jellemzőek. Dolgozatomban vizsgálom, hogy mutatkoznak-e eltérések a pihenési szokásokban az életmódbeli jellemzők (pl. ingázás, éjszakázás, rendszeres vagy rendszertelen pihenés) és az életcélok, az aspirációs mintázat szerint. A vizsgálat kérdőíves felmérés alapján készült, a kérdőíveket összesen 150 egyetemista töltötte ki, az adatok feldolgozása pedig az SPSS statisztikai program segítségével történt. A továbbiakban szeretnék elmélyülni még jobban a témában, megragadva a lehetőséget a szakdolgozatom elkészítéséhez.",
    "keywords": [],
    "generated_keywords": [
      "pihenési szokások",
      "alvás",
      "egyetemisták életmódja",
      "életcélok"
    ]
  },
  {
  "major": "Egészségmagatartás",
  "year": 2016,
  "title": "Időskorúak életminősége: a közösségi kapcsolatok hatása",
  "students": [
    {
      "name": "Székely Annamária",
      "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Sántha Ágnes",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    },
    {
      "name": "Dr. Fodor László",
      "university": "Sapientia EMTE, egyetemi docens"
    }
  ],
  "content": "Vizsgálatom célja a Marosvásárhelyen és környékén élő idős személyek életminőségének körvonalazása, illetve elégedettségi szintjük mérése a családi kapcsolatok, az egészségi állapot, a közösségi kapcsolatok és a szabadidős tevékenységek mentén. Az idősödő népesség hatással van a társadalmak gazdaságára, nyugdíj- és adórendszerére, egészségügyi és szociális ellátására, továbbá a családok összetételére és nem utolsó sorban a politikára. Célom feltárni az idősek életmódjának olyan oldalait, amelyek beavatkozással javításra szorulnak. A dolgozatomban két csoportot fogok összehasonlítani: olyan időseket, akik nyugdíjasklubok tagjaként részt vesznek valamilyen szervezett programban, valamint olyanokat, akik formálisan nem tartoznak semmilyen közösséghez. Feltételezem, hogy az életminőség szempontjából különbség van azok között, akik idős korukban közösségbe tartoznak és aktívak, és azok között, akiknek erre nincs lehetőségük. A vizsgálati mintám 150 személyből áll. Kérdőíves módszerrel vizsgáltam mindkét csoport életminőségét, az adatokat SPSS statisztikai program segítségével dolgoztam fel. Eredményeim szerint a rendszeres testi és lelki aktivitás idős korban is alapvető az egészségmegőrzés és a megfelelő életminőség fenntartásához.",
  "keywords": [],
  "generated_keywords": [
    "életminőség",
    "idősek közösségi részvétele",
    "szabadidős tevékenységek"
  ]
},
{
  "major": "Egészségmagatartás",
  "year": 2016,
  "title": "A szelfi a XXI. századi szenvedélybetegség",
  "students": [
    {
      "name": "Kelemen Zelma",
      "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák, 2. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Krizbai Tímea",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    }
  ],
  "content": "Bevezetés: az internet révén korunk egyik nagy áttörését épp most éltük meg, ami olyan mértékben jelenik meg a serdülők életében, hogy még kitérőt sem tudnak tenni, így teljesen magával ragadja őket. Ami ebből fakad, az nem más, mint a szelfi, ami felforgatta az emberi életet, és átvette a hatalmat az emberek felett. Célkitűzések: jelen vizsgálat célja a fiatalok szelfikészítési és -használati szokásainak vizsgálata, illetve annak elemzése, hogy milyen kapcsolata van az önimádattal, a narcisztikus hajlammal és a szociális megfelelési kényszerrel. Módszerek: fiatalok Facebook-profiljait elemezve azt vizsgáljuk, hogy milyen gyakran töltenek fel szelfiket, hol készítik, mi azok üzenete, illetve mennyire népszerű a publikus profiljuk. A vizsgálatban résztvevőkkel szociális megfelelőség kérdőívet is kitöltetünk. A válaszadók két csoportba kerülnek: gyakori szelfizők és nem szelfizők. Eredmények: várható, hogy a gyakori szelfizők magasabb pontszámot érnek el a szociális megfelelés skálán. Következtetés: fontos lenne kampányokat indítani a szelfihasználat veszélyeinek tudatosítására.",
  "keywords": [],
  "generated_keywords": [
    "szelfi",
    "szociális megfelelés",
    "narcizmus"
  ]
},
{
  "major": "Egészségmagatartás",
  "year": 2016,
  "title": "Egyetemisták párkapcsolatra vonatkozó céljainak vizsgálata a Facebookhasználati szokások tükrében",
  "students": [
    {
      "name": "Burian Erika",
      "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Drd. Szentes Erzsébet",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    }
  ],
  "content": "A kutatás erdélyi egyetemisták párkapcsolatra vonatkozó céljaira fókuszál a Facebook-használati szokások függvényében. A kérdésfelvetést az a tapasztalat indította el, hogy a fiatalok nap mint nap használják a Facebookot, itt posztolják, hogy mi történt velük, hogy érzik magukat, vagy éppen hol vannak, és mivel foglalkoznak. Vizsgálatunk célja rálátást nyerni az egyetemisták párkapcsolatról való vélekedésére, valamint arra, hogy ebben a populációban befolyásolja-e a párkapcsolatok alakulását a Facebook-használat. Kérdőíves kutatást végeztünk a Sapientia EMTE három karán, illetve a Partiumi Keresztény Egyetemen. A vizsgálat három részből állt: párkapcsolati minőség, Facebook-használat, és a Rövidített Aspirációs Index. A korábbi, 2015-ös előkutatás eredményei is segítették a jelenlegi munka megalapozását. Eredmények: bemutatjuk, mennyire tartják komolynak kapcsolatukat a válaszadók, mennyire jellemző a házasságtervezés, és milyen konfliktusokat okoz a Facebook-használat a párkapcsolatokban.",
  "keywords": [
    "párkapcsolat",
    "párkapcsolati érettség",
    "féltékenység",
    "intrinzik célok",
    "kommunikáció",
    "Facebook"
  ],
  "generated_keywords": [
    "Facebook-használat",
    "párkapcsolati célok",
    "egyetemisták vizsgálata"
  ]
},
{
  "major": "Egészségmagatartás",
  "year": 2016,
  "title": "Szociális készségek a deviancia tükrében 8-10 éves korban",
  "students": [
    {
      "name": "Demény Dorina",
      "major": "Eszterházy Károly Főiskola, szociálpedagógia, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Hadnagy József",
      "university": "Eszterházy Károly Főiskola"
    }
  ],
  "content": "Az egyén szocializációja során kulcsfontosságú, hogy milyen társadalmi közegbe integrálódik, mivel ez kihat a későbbi életére is. A szociális készségek jelentős szerepet játszanak az interperszonális kapcsolatok kialakításában. A deviancia, például bűnelkövetés vagy szenvedélybetegségek, gyakran már gyerekkorban elkezdődő folyamat eredménye. A kutatás azt vizsgálja, hogy milyen különbségek mutathatók ki a devianciával érintett és nem érintett 8–10 éves gyermekek szociális készségei között. A kutatás jelenleg próbalekérdezési fázisban van.",
  "keywords": [
    "szociális készségek",
    "deviancia",
    "gyermekkor",
    "szocializáció",
    "kisiskolás kor",
    "interperszonális kapcsolatok"
  ],
  "generated_keywords": [
    "szociális készségek",
    "deviáns karrier",
    "8–10 éves gyerekek"
  ]
},
{
  "major": "Egészségmagatartás",
  "year": 2016,
  "title": "Egészségmagatartás és egészségtudatosság posztadoleszcens életszakaszban",
  "students": [
    {
      "name": "Bicsak Adél",
      "major": "Sapientia EMTE, Egészségügyi szakpolitikák és szolgáltatások, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Harangus Katalin",
      "university": "Sapientia EMTE"
    }
  ],
  "content": "A kutatás az egészségtudatosság és egészségmagatartás kapcsolatát vizsgálja a posztadoleszcens életszakaszban levő egyetemi hallgatók körében. Ez az életszakasz pszichoszociális kihívásokkal terhelt, mivel az egyén biológiailag felnőtt, de társadalmilag még nem teljesen integrált. Az egészségtudatosság, mint az egyén és környezete viszonyából kialakuló tényező, kulcsszerepet játszik az életminőség fenntartásában és a betegségek megelőzésében. Az adatgyűjtés kérdőíves módszerrel történt, amely az egészségmagatartást és a szocio-demográfiai változókat vizsgálta. Az elemzés SPSS segítségével zajlott.",
  "keywords": [
    "egészség",
    "egészségmagatartás",
    "egészségtudatosság",
    "egészségdeterminánsok",
    "egészséget befolyásoló tényezők",
    "posztadoleszcencia életszakasz"
  ],
  "generated_keywords": [
    "egészségtudatosság",
    "egyetemisták",
    "posztadoleszcens életszakasz"
  ]
},
{
  "major": "Egészségmagatartás",
  "year": 2016,
  "title": "Helyzetjelentés a romániai asszisztált reprodukciós eljárásokat alkalmazó klinikákról",
  "students": [
    {
      "name": "Szilágyi Henrietta-Orsolya",
      "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 2. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Krizbai Tímea",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar"
    }
  ],
  "content": "A dolgozat a romániai meddőségi klinikák helyzetét és teljesítményét vizsgálja. A meddőség társadalmi tabuként való kezelése ellenére elterjedt probléma, amelyben mindkét nem egyaránt érintett. A kutatás célja a klinikák statisztikai adatainak elemzése, annak feltérképezése, hogy hány pár fordul hozzájuk, milyen feltételekkel, és mekkora költséggel jár a beavatkozás. A módszertan hivatalos honlapokon közölt adatok elemzéséből és a Zygota Meddőségi Központról készített esettanulmányból áll. Eredmények szerint évente 10 000 beavatkozásra lenne szükség Romániában, miközben 2012-ben csak 2 000 történt. A vizsgálat rávilágít az asszisztált reprodukciós eljárások romániai helyzetére, és felveti a további szabályozási és nemzetközi összehasonlítások fontosságát.",
  "keywords": [
    "meddőség",
    "asszisztált reprodukció",
    "lombikbébi",
    "romániai klinikák",
    "statikai elemzés",
    "Zygota Központ"
  ],
  "generated_keywords": [
    "asszisztált reprodukció",
    "meddőség kezelése",
    "romániai lombikprogram"
  ]
},
{
  "major": "Egészségmagatartás",
  "year": 2016,
  "title": "Szexuális magatartás kockázati tényezői középiskolások és egyetemi hallgatók körében",
  "students": [
    {
      "name": "Tóth Emőke",
      "major": "Sapientia EMTE, Közegészségügyi politikák és szolgáltatások, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Sántha Ágnes",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    }
  ],
  "content": "A dolgozat a középiskolások és egyetemisták szexuális magatartásának kockázati tényezőit vizsgálja. Célja a szexuális nevelés szükségességének és fontosságának hangsúlyozása a fiatalabb korosztályokban, mivel növekszik a szexuális úton terjedő betegségek és a nem kívánt terhességek száma. A munka első része elméleti áttekintést ad a szexualitásról, szexedukációról és megelőzésről, míg a második rész empirikus, kérdőíves kutatáson alapul. A kvalitatív módszertan nem reprezentatív, de rávilágít a fiatalok alacsony egészségtudatosságára, korai szexuális aktivitására és a hiteles információforrások hiányára.",
  "keywords": [
    "szexuális magatartás",
    "kockázati tényezők",
    "szexedukáció",
    "fiatalok egészségtudatossága",
    "szexuális úton terjedő betegségek",
    "nem kívánt terhesség"
  ],
  "generated_keywords": [
    "szexuális nevelés",
    "kamaszok szexuális egészsége",
    "kvalitatív kutatás"
  ]
}
]