[
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2017,
    "title": "A nyelvhelyesség és a nyelvjárások fontossága. Attitűdvizsgálat",
    "students": [
      {
        "name": "Németh István-Szabolcs",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatom célja az, hogy megvizsgáljam a nyelvhelyesség és a nyelvjárások körül megkonstruálódó előítéleteket (presztízst, illetve stigmát), ugyanakkor pedig rá kívánok világítani azokra az ellentmondásokra, amiket a nyelvjárásokkal és a sztenderd nyelvvel szemben fogalmazunk meg. Állításom az, hogy a nyelvjárások a magyar beszélők nagy többsége szerint különlegesek, értéket képviselnek, még kuriózumként is funkcionálnak, mégis amikor egy műveltebb környezetben kell megszólalni, nagyon sokszor attitűdváltásnak lehetünk a tanúi, ahol a nyelvjárások az (elképzelt) sztenderdnek rendelődnek alá. A kutatásomat a kérdőív módszerével végeztem, ami elérhető volt nyomtatott, valamit internetes formában, és megpróbáltam minél változatosabb korosztállyal és műveltségű személlyel kitöltetni azt, hogy a lehető legszélesebb spektrumú eredményeket kapjam. A kutatásom során arra jutottam, hogy nyelvvel kapcsolatos attitűdök között ott él a lingvicizmus, a nem-sztenderd elemekkel szembeni negatív, illetve a sztenderddel szembeni pozitív viszonyulás.",
    "keywords": [],
    "generated_keywords": [
      "kell megszólalni",
      "nagyon sokszor",
      "szerint különlegesek"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2017,
    "title": "Professional and non-professional interpreters: a case study",
    "students": [
      {
        "name": "Izsák Éva",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "My paper analyses interviews with interpreters in order to conclude the qualities and skills that are required in this field, and the attitudes and techniques qualified and unprofessional interpreters possess when it comes to interpreting. My goal is to discover the secrets of this profession and to see the differences between those who are qualified in this field and those who are not, in order to discover what interpreting training provides and the skills that one can acquire without being trained.",
    "keywords": [],
    "generated_keywords": []
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2017,
    "title": "From Cluster Bombs to Social Dance",
    "students": [
      {
        "name": "Ferenczi István",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Imre Attila",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "In this paper we are going to discuss the importance of audiovisual translation in our era. The first part deals with various forms of audiovisual subtitling, while the main focus is on subtitling, including types, technical aspects, difficulties and differences between theory and practice. A separate part is dedicated to discuss the differences between professional and non-professional subtitlers known as fansubbers, directly leading to another trendy concept, crowdsourcing. The bridge between theory and practice is assured by the presentation of TED, a highly popular nonprofit organization, devoted to “spreading ideas”. The practical part of the paper deals with subtitling TED Talks on a volunteer basis and possible pitfalls regarding linguistic, cultural and technical requirements as well as language specific challenges (English – Hungarian) stemming from written and unwritten norms through examples based on personal experience.",
    "keywords": [],
    "generated_keywords": [
      "English",
      "Hungarian",
      "TED",
      "TED Talks"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2017,
    "title": "Translation over the Centuries: A Comparative Study of English Bible Translations",
    "students": [
      {
        "name": "Szécsi Sándor",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "In my paper entitled Translation over the Centuries: A Comparative Study of English Bible Translations, I discuss the way the English translation of the Bible evolved since the 7th century up to modern days, and I also compare two versions: the 1611 King James Bible and a modern translation, the Common English Bible. In the theoretical part of the paper, I give a short historical outline of the evolution of the English translations, beginning with translations from the Anglo-Saxon era. I talk about the translators themselves, and the way their work affected the process of Bible translation. I also give a short presentation of the creation of the King James Bible, a translation that functioned as a basis of future English translations of the Bible. The practical part is a lexicological analysis: I compare several Psalms from the King James Bible with their counterparts in the Common English Bible. I focus on the usage of lexical items trying to identify the way in which the historical changes of the English lexicon is reflected in the Biblical texts themselves.",
    "keywords": [],
    "generated_keywords": [
      "Anglo-Saxon",
      "Bible",
      "Biblical",
      "Common English Bible",
      "English"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2017,
    "title": "Anyanyelvvel kapcsolatos mítoszok",
    "students": [
      {
        "name": "Bors Gréta",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatomat Lanstyák István Általános nyelvi mítoszok című tanulmányára alapozom, amelyben a szerző számos, a nyelvvel és nyelvhasználattal kapcsolatos (sokszor helytelen) elképzelést sorakoztat fel. Ezek közül hármat emelek ki: 1. „Az anyanyelvéhez minden embert különösen bensőséges viszony fűz.” 2. „Minden ember az anyanyelvén tud a legjobban gondolkodni, fogalmazni, ismereteket szerezni.” 3. „Minden embernek – különösen pedig az iskolázottaknak – erkölcsi kötelessége, hogy ápolja, védelmezze anyanyelvét, ügyeljen épségére, tisztaságára.” A dolgozatom gyakorlati részének alapját egy általam készített kérdőívre adott válaszok képezik. A digitális kérdőívet 163-an töltötték ki. Az adatközlők 100%-a magyar anyanyelvű, többségük Romániában élő személy. A válaszok tartalomelemzése alapján kijelenthető, hogy a fent bemutatott mítoszok megfogalmazódnak és jelen vannak az adatközlőim körében is.",
    "keywords": [],
    "generated_keywords": [
      "István Általános",
      "Minden",
      "Romániában",
      "–"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2017,
    "title": "Gender Roles in Translation",
    "students": [
      {
        "name": "Kövecsi Katalin",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "My paper focuses on the Hungarian translations of Pride and Prejudice by Jane Austen. The novel was published in 1813. Since then it was translated five times into Hungarian. Both female and male translators tried to convey its message and the cultural background outlined in 19th century England, with a special focus on gender roles. The paper also addresses the question of female writers in Jane Austen’s time, as well as possible gender biases in the translation of a novel discussing gender roles in 18-19th century England. In the analysis of the Hungarian versions there will be emphasis placed on the translations made by female and male translators, trying to identify pertinent differences and any existing instances of gender bias.",
    "keywords": [],
    "generated_keywords": [
      "England",
      "Hungarian",
      "Jane Austen",
      "Prejudice",
      "Pride"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2017,
    "title": "Dialects. Attitudes towards Dialects",
    "students": [
      {
        "name": "Molnár Emese-Júlia",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "This paper introduces the sociolinguistic context and the linguistic attitudes towards dialects in a number of Transylvanian rural schools. It includes discussions of sociolects and the way they have evolved in the Hungarian language, as well as in other languages. Continuing several of our well-known linguists’ work, we have carried out sociolinguistic research with more than 70 subjects using the questionnaire applied in the Sociolinguistics of Hungarian Outside Hungary (SHOH) project. We have analysed the opinions of teachers and students separately.",
    "keywords": [],
    "generated_keywords": [
      "Hungarian language",
      "SHOH",
      "Sociolinguistics of Hungarian Outside",
      "Transylvanian"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2017,
    "title": "Die Zweisprachigkeit in der Kindheit",
    "students": [
      {
        "name": "Tóth Tamás",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Kelemen Attila",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Die Fähigkeit, Gedanken in Worte zu fassen ist ein Meilenstein in der Entwicklung der Menschheit. Heute existieren über 6000 Sprachen auf der Welt. Im Durchschnitt beherrscht jeder Einzelne von uns 1,2 Sprachen, d. h., dass es Menschen gibt, die diesen Durchschnitt nach oben treiben können; Beispiel dafür wären die zweisprachigen, bzw. die mehrsprachigen Menschen. Die Zweisprachigkeit ist weltweit verbreitet und es ist bekannt, dass ungefähr die Hälfte der gesamten Bevölkerung der Welt, zweisprachig ist. Diese Arbeit untersucht die gegenwärtige zweisprachige Situation in Rumänien, nämlich in Siebenbürgen. Es wurde untersucht wie sich die vielfältige Zweisprachigkeit in Rumänien entwickelt hat. Zusätzlich fokussiert die Arbeit auch auf die zweisprachige Erziehung.",
    "keywords": [],
    "generated_keywords": [
      "Rumänien",
      "Siebenbürgen",
      "Worte"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2017,
    "title": "Linguistic Diversity and Attitudes towards Varieties from the Perspective of Language Contacts",
    "students": [
      {
        "name": "Izsó Beáta",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "The purpose of my paper is to analyse the language attitudes towards Hungarian and the way people use the Hungarian language in Romania. Romanian, as a state language has a huge effect on the Hungarian language variants in Romania and this fact cannot be ignored. Many may consider that their mother tongue is deteriorating and they should not use contact elements. Others may think that there is nothing wrong if they combine the two languages and they borrow words from Romanian because in this way we can express our feelings and thoughts more easily and the most important thing is to make ourselves understood. People have different attitudes towards change in language and towards borrowings from the Romanian language. The study presents several theoretical aspects regarding attitudes and the fact that language is constantly changing. It reflects the changes in Hungarian language due to contact phenomena and the attitudes people show towards them.",
    "keywords": [],
    "generated_keywords": [
      "Hungarian",
      "Hungarian language",
      "Romania",
      "Romanian",
      "Romanian language"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2017,
    "title": "Szorongás és nyelvi magatartás",
    "students": [
      {
        "name": "Szász Gyopár",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatomban párhuzamot vonok a nyelvhasználattal kapcsolatos nyelvi attitűdök és Fritz Riemann A szorongás alapformái című művében megfogalmazott személyiségtipológiája között. Alapfeltevésem az, hogy az egyén személyisége mélyen áthatja a nyelvhasználatát, illetve a nyelvi viselkedését, s ennek következtében ez utóbbiakból valamelyest következtetni lehet az egyén személyiségi jegyeire. Ugyanakkor a társadalom–nyelv–individuum hármasának problematikáját is tárgyalom dolgozatom keretén belül. Munkám során szóbeli és írásbeli interjúkat készítettem alanyaimmal, és a válaszaik alapján rálátást nyertem arra, hogy nyelvhasználatuk terén melyik riemanni típusba sorolhatók, illetve arra is, hogy miként befolyásolják őket a külvilág visszajelzései, mi okoz számukra szorongást nyelvi téren.",
    "keywords": [],
    "generated_keywords": [
      "Alapfeltevésem",
      "Fritz Riemann",
      "Ugyanakkor",
      "miként befolyásolják",
      "nyelvhasználatát"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2017,
    "title": "Translating the Controversial",
    "students": [
      {
        "name": "Rappert Balázs",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "While fireworks have, for a long time, been a branch of industry shrouded in mystery, there exists a vast array of texts which describe the meticulous methods used by skilful craftsmen to create the flashy miracles in the skies. However, these techniques are not at all known in Hungary, nor are they considered appropriate knowledge for the average citizen. This study focuses on most of the major legal, ethical, terminological and scientific difficulties which arise during an attempt to translate a text about an art which is both marvelled at and frowned upon to an equal extent. The study is based on the issues in translating George W. Weingart’s “Pyrotechnics”(second edition), although references include excerpts from the Fundamental Law of Hungary, public online forums and other articles related to the topic. The paper will not be covering military or industrial pyrotechnics. The results of the study show that translating documents about pyrotechnics or the crafts of the fireworks industry into Hungarian proves difficult and cumbersome with not many resources available. Some terms may only be found in the jargon or not at all, while the process, which in most countries is considered a form of art or a branch of industry, is completely outlawed in Hungary. Texts describing the processes or the materials required to produce fireworks are among those which are the most difficult to translate, mostly due to the lack of terminology, to the fact that the Hungarian language almost completely lacks exposure to the given branch of industry and to certain ethical or legal aspects.",
    "keywords": [],
    "generated_keywords": [
      "Fundamental Law of Hungary",
      "George W. Weingart",
      "Hungarian",
      "Hungarian language",
      "Hungary"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2017,
    "title": "Erdélyi magyar fiatalok nyelvi attitűdjei: fókuszban a chat és az SMS nyelve",
    "students": [
      {
        "name": "Kolozsi Szidónia",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatomban a 21. század egyik érdekes nyelvhasználati terét vizsgálom, az SMS és az internetes chatnyelvi rövidítések hatását, illetve a rövidítésekkel szemben támasztott nyelvi attitűdöket középiskolások és egyetemisták szempontjából. Vizsgálatomban elsősorban elméleti középiskolába és szakközépiskolába járó diákok, valamint Marosvásárhelyen tanuló egyetemista nyelvhasználók nyelvi szokásait körvonalazom. Kutatásom módszertana egy kérdőívet tartalmaz, amelyben a fiatalok SMS-ben és chat során használt nyelvi sajátosságaira kérdezek rá, illetve arra, hogy mi a véleményük arról, hogy mindennek milyen hatása van a nyelvhasználat többi területére. Hipotézisem szerint az SMS- és chatnyelvben használt rövidítések döntő módon hatással vannak arra, ahogy a fiatalok kommunikálnak, ugyanakkor határozott attitűdjeik vannak a nyelvi változásokkal és a nyelvhelyességgel kapcsolatban.",
    "keywords": [],
    "generated_keywords": [
      "Marosvásárhelyen",
      "SMS",
      "SMS-ben és chat során használt",
      "Vizsgálatomban",
      "kérdezek rá"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2017,
    "title": "Metszőkerékkel lefejtett fogaskerekek profilpontosságának vizsgálata",
    "students": [
      {
        "name": "Laczkó-Benedek Brigitta",
        "major": "Sapientia EMTE, Gépészmérnöki szak, 3. év"
      },
      {
        "name": "Kántor Anna-Erzsébet",
        "major": "Sapientia EMTE, Gépészmérnöki szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Máté Márton",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Jól ismert tény, hogy a metszőkerékkel fogazott fogaskeréknek profilhibája van. A szakirodalomban általánosan elfogadott vélemény, hogy e hiba a fogfej- és a foglábvastagságot csökkenti, így a kapcsolódás szempontjából előnyös. Jelen dolgozatban kimutatjuk, hogy ez a feltételezés csak bizonyos esetekben igaz. Tárgyaljuk a metszőkerekes burkolás matematikai modelljét, és ennek alapján felírjuk a burkoló fogoldal profiljának parametrikus egyenleteit, majd a profilhibát definiáljuk. Végül igazoljuk, hogy a profilhiba mértéke és eloszlása a profileltolásoktól és a fogszámoktól függ.",
    "keywords": [],
    "generated_keywords": [
      "Jelen",
      "Jól",
      "így"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2017,
    "title": "Ciklois profilú bolygómű",
    "students": [
      {
        "name": "Mátyás Álmos",
        "major": "Sapientia EMTE, Mechatronika szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Tolvaly-Rosca Ferenc",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Nyújtott epiciklois fogazattal készült fogaskerekek segítségével olyan hajtóművet készíthetünk, amely jó hatásfok és nagy terhelhetőség mellett nagy áttételi arányt biztosít. Az ilyen bolygóművek működésének a feltétele az, hogy legyártásuk nagy pontossággal történjen. Ez nagy gyártási költséget igényel. A dolgozat célja egy olyan bolygómű tanulmányozása, amely méretei eltérnek az elméleti rész összefüggéseinek segítségével számolt értékektől, valamint, a fogaskerék (bolygókerék) fogfelületi igénybevételének tanulmányozása számítógépes modellezésen keresztül.",
    "keywords": [],
    "generated_keywords": [
      "Nyújtott",
      "jó hatásfok",
      "nagy terhelhetőség mellett",
      "olyan hajtóművet készíthetünk"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2017,
    "title": "Automatizált zsákoló berendezés",
    "students": [
      {
        "name": "Lőrinczi Attila",
        "major": "Sapientia EMTE, Mechatronika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Egyed-Faluvégi Erzsébet",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A fából égetett szén ősidők óta használatos az iparban és a mindennapokban egyaránt. E sokrétű fűtőanyag előállítása, szállítása és adott esetben csomagolása nem tartozik az egészséges, jó munkák körébe, mivel káros, és sok fizikai munkát igényel. Napjainkban felkapott terméknek számít leginkább a kinti sütés elterjedése miatt. Jelen dolgozatom a fent említett problémák, nehézségek, rossz munkakörülmények javítására ad megoldást egy automata zsákoló berendezés formájában. Ez a mechatronikai elemekkel felszerelt berendezés több munkafolyamatot kíván megoldani, melyek a következők: a szén felhordása egy futószalag segítségével, rostálása egy rostadobon, zsákolása pneumatikus megvalósítással és a zsák levarrása egy ipari varrógéppel. A berendezés célorientált, igazodik az adott körülményekhez, mely a lehető legegyszerűbb és legbiztonságosabb kivitelezést nyerte el.",
    "keywords": [],
    "generated_keywords": [
      "Jelen",
      "említett problémák",
      "jó munkák körébe",
      "következők"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2017,
    "title": "Az Engler-viszkoziméter automatizálása",
    "students": [
      {
        "name": "Csomor Levente",
        "major": "Sapientia EMTE, Mechatronika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Kakucs András",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Az ipar, legfőképpen a gépészet területén elengedhetetlenül fontos a különböző kenőanyagok, olajok vizsgálata, így a viszkozitásuk mérése is. A viszkozitás technikai célú mérésének egyik eszköze az Engler-féle viszkoziméter, amellyel tulajdonképpen egy rögzített térfogatú folyadék kifolyási idejét mérjük meg és hasonlítjuk össze az azonos térfogatú, 20°C hőmérsékletű desztillált víz kifolyási idejével. A két idő hányadosa a viszkozitás mértéke Engler-fokban kifejezve. Ennek az eljárásnak két hátránya van: a gyorsan kifolyó, felhabzó folyadékok esetén nehéz megállapítani a kifolyt térfogatot (leolvasási hiba), a melegített folyadékok esetében pedig azok kontrollálhatatlan hőtágulása további hibát okoz. A másik hátrány pedig az idő mérése körüli pontatlanságokból ered, ami a kronométer kézi indításából és megállításából származik (a reakcióidő miatt). A dolgozatom célja az Engler-féle viszkozitásmérő tovább- fejlesztése, annak automatizálása, valamint a mérési eljárás módosítása a kifolyt mennyiség pontosabb megmérésének céljából. Az automatizálás (a hőmérséklet beállítása és tartása, valamint az idő és a kifolyt mennyiség megmérése) egy Raspberry Pi 3 típusú mini számítógép segítségével történik, a megfelelő perifériákkal. A javasolt eljárásban a térfogat mérése helyett tömegmérést használunk, mivel a tömegre a hőmérséklet változásának nincs hatása, a folyadékszint szemmel való becslését pedig mérőeszközzel történő adatrögzítéssel helyettesíthetjük. Ezzel az indítási-megállítási folyamatot (az idő mérését) is automatizáljuk, csökkentve az emberi hiba lehetőségét. Az adatok beállításához és a mért mennyiségek megjelenítéséhez egy érintőképernyőt használunk, ami felhasználóbaráttá teszi a berendezést. E berendezés megvalósítása a viszkozitás pontosabb megmérését teszi lehetővé, ami kizárja a leolvasási hibákat és a környezeti hatásokat.",
    "keywords": [
      "Viszkozitás",
      "Engler-féle viszkoziméter",
      "automatizálás",
      "Raspberry PI "
    ],
    "generated_keywords": [
      "Engler-fokban kifejezve",
      "Engler-féle",
      "Ezzel",
      "Raspberry Pi",
      "azok kontrollálhatatlan"
    ]
  },
  {
  "major": "Gépészmérnöki",
  "year": 2017,
  "title": "Niles-féle köszörűgép köszörűkorong szabályzó berendezésének korszerűsítése",
  "students": [
    {
      "name": "Márton Loránd",
      "major": "Sapientia EMTE, Mechatronika szak, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "dr. Máté Márton",
      "university": "Sapientia EMTE, egyetemi docens"
    }
  ],
  "content": "A dolgozat a Niles-féle fogköszörűgép köszörűkorong szabályzó berendezésének korszerűsítését tárgyalja. A gép termelékenyebb ugyan a MAAG-félénél, de kevésbé pontos. A megmunkálás során a tárcsa kopása egyenlőtlen, ezért szabályozása szükséges. A hagyományos, mechanikus gyémánthegyes szabályzó csak szabványos profilokat tud létrehozni. A dolgozat célja egy számítógépes irányítású, számvezérléses szabályozó rendszer bemutatása, amely pontosabb profilokat képes generálni. A dolgozat foglalkozik a klasszikus eljárás hibájának számításával, az automatizált rendszer előnyeivel, valamint különböző szabályozási módszerek összehasonlításával.",
  "keywords": [
    "köszörülés",
    "szabályozás",
    "vezérlőegység",
    "profilhiba",
    "automatizálás"
  ],
  "generated_keywords": [
    "CNC szabályozás",
    "fogaskerék-megmunkálás",
    "gyártástechnológiai fejlesztés"
  ]
},
  {
    "major": "Hardverfejlesztések",
    "year": 2017,
    "title": "RBF neuronháló implementálása FPGA lapra digitális jelfeldolgozásra",
    "students": [
      {
        "name": "Gálfi Andor",
        "major": "Sapientia EMTE, Számítástechnika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Brassai Sándor Tihamér",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Az RBF neuronhálót gyakran alkalmazzák jelfeldolgozásra, mivel a neuronháló képes megtanulni egy jelet, lehetővé téve a jelforma kódolását és sűrítését, amelyből minimális veszteséggel visszaállítható az eredeti jel. A dolgozat célkitűzése egy kódoló rendszer kialakítása, amely akár zajos csatornán keresztül is képes továbbítani az információt, megőrizvén a minőségét és integritását. A neuronháló implementálására FPGA áramkört használunk. Az FPGA alapú megvalósítás valós idejű műveletvégzési sebességet, míg az algoritmus magas fokú párhuzamosítást biztosít. A dolgozat tárgyalja az alkalmazott neuronháló implementációjára tervezett áramkör architektúráját, a jelkódolás pontosságának (információveszteségnek) a kiértékelését, visszafejthetőségét és publikus csatornán való továbbításának lehetőségét.",
    "keywords": [],
    "generated_keywords": [
      "RBF",
      "alkalmazott neuronháló",
      "egy jelet",
      "jelkódolás pontosságának",
      "kiértékelését"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2017,
    "title": "Nemstacionárius biológiai jelekre alkalmazható eljárások tanulmányozása és gyakorlati alkalmazása",
    "students": [
      {
        "name": "Kocsis Norbert-Attila",
        "major": "Sapientia EMTE, Számítástechnika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Márton László-Ferencz",
        "university": "Sapientia EMTE, egyetemi tanár"
      }
    ],
    "content": "A dolgozat célja olyan eljárások bemutatása, melyek a Fourier-transzformációval ellentétben képesek nem stacionárius jelek kezelésére. Az ilyen típusú jeleknél a spontán megjelenő komponensek hordozzák az információk nagy részét, ezért szükség volt olyan módszerek kifejlesztésére, melyek nemcsak energia- frekvencia skálán képesek a komponensek azonosítására, hanem energia-idő-frekvencia skálán is. A tanulmányozott módszerek segítségével neurológiai jeleket vizsgálunk, próbáljuk azok statisztikai tulajdonságait elemezni, torzítás nélküli szűrést végezni, komponensek időbeli jelenlétét meghatározni, majd ezekből következtetéseket levonni. A különböző lokális komponensek alapján megállapíthatjuk a neuron által generált akciós potenciálok maximális frekvenciáját, illetve a memóriarögzítés előtt és után jelentkező jelek összehasonlítását is elvégezhetjük bizonyos paraméterek alapján.",
    "keywords": [],
    "generated_keywords": [
      "Fourier",
      "hanem energia-idő-frekvencia",
      "jelenlétét meghatározni",
      "olyan módszerek kifejlesztésére"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2017,
    "title": "Biológiai jelfeldolgozó és -továbbító rendszer",
    "students": [
      {
        "name": "Szász Tamás-Attila",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Papp Sándor",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Rengetegen szenvednek komolyabb betegségben, vagy veszítik életüket olyan okokból kifolyólag, amelyek megelőzhetőek lehetnének, ha időben segítséget kapnának. Egy példa erre a szívritmuszavar, melynek hátterében számos súlyos betegség állhat, és ha ezeket nem észleljük és kezeljük időben, akkor halálhoz is vezethetnek. Egy másik példa a túl alacsony véroxigénszint, amely több súlyos betegség kialakulásához vezethet, pl. hypoxia, amelyet ha hosszú ideig nem kezelünk, szintén halálhoz vezethet. Ezeken kívül még olyan okok is állhatnak a halálesetek mögött, mint az esés során szerzett súlyos sérülések, amelyek azonnali segítséget igényelnének, viszont nincs a közelben senki sem, aki segíteni tudna, ez főleg olyan személyek esetében áll fenn, akik egyedül élnek. Az én célom az, hogy egy olyan eszközt tervezzek, amely az előbb említett eseteket megelőzi. Ez az eszköz 24 órán át figyeli a szívverésünket, a véroxigénszintünket, testhőmérsékletünket, illetve egy IMU szenzor segítségével szögsebességet és gyorsulást mér. A mért adatokból kiszűri a hasznos információkat, amelyeket feldolgozva képes észlelni, ha valami rendellenesség lép fel, így figyelmeztetni tud minket, ha valami nincs rendben. Ezeket az adatokat elmenti egy microSD kártyára, így orvosunk hozzáférhet majd ezekhez, és láthatja, hogyan változtak a mérések a nap folyamán. Így akár azt is meg fogja tudni állapítani, hogy használ-e egy adott kezelés. Ha valami nagy bajt észlel az eszköz, ami azonnali figyelmet igényel, például azt, hogy a viselője elesett, akkor egy vezeték nélküli adó-vevő segítségével küld majd egy figyelmeztető üzenetet a hozzánk közelállóknak, esetleg orvosunknak vagy szomszédoknak, akik hozzánk közel tartózkodnak, és így gyorsan tudnak segítséget nyújtani. Először egy tesztlapot fogok tervezni, amelyen letesztelem a különböző érzékelőket és a különböző algoritmusokat pl. a pulzus vagy szív-frekvencia-variabilitás (HRV) mérésére és feldolgozására, vagy a vér-oxigén szint megállapítására, illetve hogy az IMU–tól kapott jelek alapján észlelje, ha az eszközt viselő személy elesett. Ez a lap tartalmazni fog egy MIKROELEKTRONIKA által gyártott MIKROE-2000-es fejlesztőlapot, amely a pulzust fogja mérni egy MAX30100-as érzékelő segítségével. A MAX30100-as érzékelő képes mérni a véroxigénszintet is. Ez a fejlesztőlap I2C kommunikációs protokoll segítségével fogja elküldeni a mért adatokat a központi egységnek. A központi egység egy Microchip által gyártott PIC18F67K22-es mikrovezérlőből fog állni, amely begyűjti az adatokat az érzékelőktől, valamint leszűri, majd feldolgozza azokat. Az elesés érzékelésére egy MPU9250-es IMU szenzort fogok alkalmazni, amelytől szintén I2C kommunikációs protokollt használva tudom majd begyűjteni a mérési adatokat. A testhőmérséklet meghatározásához egy MAXIM-DALLAS által gyártott DS1631U+ integrált áramkört fogok használni, amely a mért hőmérsékletet digitális formában adja majd meg I2C protokollt használva. Az előbbi digitális hőmérő mellett még fogok használni ezen a tesztlapon egy MAX20305-ös hőmérő integrált áramkört is, és összehasonlítom majd ezt a kettőt pontosság és fogyasztás szempontjából. Vezeték nélküli adóvevő egységként egy RN42-es Bluetooth modult fogok alkalmazni, amely segítségével a központi egység fog tudni kommunikálni egy okostelefonnal vagy laptoppal, amin keresztül üzenetet küldhet a családtagjainknak vagy orvosunknak. Emellett még rá lesz építve erre a tesztlapra egy ESPRESSIF által gyártott ESP-WROOM-02 wifi modul is. A két vezeték nélküli kommunikációs egységet összehasonlítom különböző kritériumok alapján, és így el tudom dönteni, hogy melyik lesz használva a végső eszköznél. Miután elvégeztem a különböző teszteket a tesztlapon, eldöntöttem, hogy mely alkatrészek felelnek meg jobban az adott feladat elvégezésére, valamint az algoritmusokat is sikerült letesztelnem, megvalósítom az eszközt egy kisebb méretű kialakításban, amelyet majd csuklón lehet viselni.",
    "keywords": [],
    "generated_keywords": [
      "DS1631U+",
      "ESP-WROOM-02",
      "ESPRESSIF",
      "Először",
      "I2C"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2017,
    "title": "Analitikus és kísérleti úton történő matematikai modellek meghatározása és összehasonlítása",
    "students": [
      {
        "name": "Mátei Tibor",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. György Katalin",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozat célja, hogy röviden bemutassa működését és használatát egy olyan programcsomagnak, melynek segítségével tesztelni és összehasonlítani lehet a különböző módszerek által elért vagy meghatározott matematikai modelleket. A dolgozatban csak a parametrikus modellek meghatározásával foglalkoztam. A rendszerek matematikai modelljének a meghatározása kétféle módszerrel történhet: analitikus úton, ismerve a rendszerre jellemző és leíró fizikai folyamatokat, illetve történhet kísérleti úton, ez esetben a rendszeren mért ki- és bemeneti jelek értékét használom fel a modell meghatározásához. A kísérleti úton történő módszer esetében a modellezés megvalósítható online (rekurzív), illetve offline (nem rekurzív) eljárásokkal. A programcsomag két fő részből tevődik össze. Az egyik részben elméleti tesztelést végeztem el felhasználva a MatLab/Simulink programcsomagnak a SimPowerSystems könyvtárát. Ennek segítségével különböző RLC típusú áramkörök matematikai modelljének a meghatározását teszteltem analitikus úton (elméleti modell), illetve a kísérleti úton való modell meghatározása és összevetése a matematikai modellel (felhasználva mért, illetve szimulált értékeket). A második részben próbáltam az előzőkben tanulmányozott részt gyakorlatban is tesztelni, ahol a laborban meglévő passzív elektronikus alkatrészekből álló, másodfokú mechanikai lengőrendszert helyettesítő standot használtam fel. Itt elsősorban a kísérleti úton végzendő online és offline paraméteridentifikációra tettem a hangsúlyt. A stand lehetőséget ad csúszó ellenállásokon keresztül véletlenszerűen módosítani a rendszer paramétereit (tömeg, csillapítás, rúgó állandó). A rendszer bemeneti és kimeneti jeleit egy mikrovezérlő mintavételezi, és ezeket az USB-vel összekötött számítógépnek továbbítja. A számítógépen egy C# programnyelvben megírt felhasználói felülettel rendelkező alkalmazás fogadja a méréseket, feldolgozza és megjeleníti a jeleket, illetve a becsült paramétereket. Itt lehetőség van a mért értékek kimentésére is egy állományba, mindez azért, hogy utólag az offline eljárással is legyen lehetőség elvégezni a modell meghatározását.",
    "keywords": [],
    "generated_keywords": [
      "Az",
      "C#",
      "Itt",
      "MatLab",
      "RLC"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2017,
    "title": "RC modellrepülő pályameghatározása valós mérések alapján",
    "students": [
      {
        "name": "Bardocz Csaba-György",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Brassai Sándor Tihamér",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatom célja egy saját építésű modellrepülővel végzett mérések alapján történő pályameghatározási feladat megvalósítása. A rendszerbe giroszkóp, gyorsulásmérő, magnetométer, nyomásmérő, valamint GPS van integrálva. A feldolgozó rendszer alapját SoC áramkör biztosítja, amely tartalmaz egy kétmagos ARM Cortex-A9 processzort és FPGA magot is. Az adatgyűjtés és a jelek előfeldolgozása a beágyazott rendszeren történik, majd a MATLAB segítségével valósítom meg a pályameghatározást. Az érzékelők által szolgáltatott adatok alapján kiszámoljuk a rendszer orientációját és pozícióját ÉKL (Észak, Kelet, Le) világ koordináta-rendszerben. A világ és a repülőhöz rögzített koordináta-rendszer közötti szögeket Euler- szögekkel határozzuk meg. Első lépésben a MATLAB-ban feldogozott adatok alapján megjelenítjük a rendszer által leírt pályát. Jövőbeli terv a rendszeren valós időben kiszámolni a pályát, amely a pályakövetési feladat alapját képezi.",
    "keywords": [],
    "generated_keywords": [
      "ARM Cortex-A9",
      "Kelet",
      "Le",
      "MATLAB",
      "MATLAB-ban"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2017,
    "title": "Négytartályos rendszer hibrid modellezése és modell alapú irányítása",
    "students": [
      {
        "name": "Kardos Tamás",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Kutasi Dénes Nimród",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatom célja egy négytartályos rendszer hibrid modellezése, szimulációja és modell alapú szabályozása. A rendszer szerkezetileg négy összecsatolt tartályból áll, amelyekbe két szivattyú pumpálja a vizet. A négy tartály alján egy-egy azonos átmérőjű lyuk található, amelyeken keresztül ürül a víz. A tartályokba jutó vízmennyiség elosztását egy-egy szeleppel lehet irányítani. Szabályozás során két tartály vízszintjét kívánom előírt értéken tartani a szivattyúk hozamának és a szelepek helyzetének állításával. Mivel a szelepek kétállapotúak, a MIMO rendszer nemcsak folytonos jellemzőkkel rendelkezik, hanem diszkrétekkel is. Az ilyen rendszereket hibrid rendszereknek nevezzük. A rendszer modelljét Matlabban készítettem el, a hibrid modellezéshez pedig HYSDEL nyelvet használtam. Ezen modellek szimulációját Simulinkben végeztem, a szabályozáshoz modell alapú irányítási módszert használtam.",
    "keywords": [],
    "generated_keywords": [
      "Dolgozatom",
      "HYSDEL",
      "MIMO",
      "Matlabban",
      "Simulinkben"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2017,
    "title": "RFID beléptető rendszer wireless kliensként",
    "students": [
      {
        "name": "Maxim Róbert",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Losonczi Lajos",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A kínai Espressif cég által gyártott ESP-01 modul nagy népszerűségnek örvend világszerte, hiszen nem egy mezei WiFi modulról van szó. Van rajta flash és RAM memória, ráadásul egy 32 bites RISC processzort is tartalmaz. Sokszínűsége mellett az ára is kecsegtető, így kíváncsi voltam, hogy mennyire állja meg a helyét egy konkrét alkalmazásban. A technológia szempontjából elavultnak titulált rádiófrekvenciás beléptető rendszerek még napjainkban is megállják a helyüket, de ez természetesen felhasználásfüggő: egy tömbház bejáratához nincs szükség retinaszkennerre, míg egy svájci bank páncéltermébe nem egy fix kulcsos RFID kártyával jutunk be. Dolgozatom célja e két dolog ötvözése, az RFID olvasó a WiFi modul segítségével egy távoli szerverhez juttatja el beléptetéskor az adatokat és nyitja vagy zárja az ajtót.",
    "keywords": [],
    "generated_keywords": [
      "ESP-01",
      "Espressif",
      "RFID",
      "Sokszínűsége",
      "WiFi"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2017,
    "title": "Környezeti szennyezések eloszlását mérő és becslő saját fejlesztésű berendezés",
    "students": [
      {
        "name": "Pap Levente-Csaba",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Dávid László",
        "university": "Sapientia EMTE, egyetemi tanár"
      },
      {
        "name": "dr. Papp Sándor",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozatban egy NOx-mérő, illetve kiértékelő rendszer tervezését és fejlesztését mutatjuk be, amely interaktív módon képes követni egy adott terület NOx-szennyezésének az eloszlását. A kiértékelést egy 3D interpolációt végző algoritmus állítja elő, amely a NOx térbeli, illetve időbeli eloszlását is képes követni. Az algoritmus egy RBF neuronhálón alapszik, amelynek tanítását, illetve hangolását és az ezek alapján kapott eredményeket bemutatjuk a dolgozatban. Végül egy adott pillanatnyi mérési eredmény gyakorlati megvalósítását vetjük fel távlatilag. Mindez internetes felületen hozzáférhető, a város térképét iteratívan kiszínező algoritmus segítségével történik. A rendszer több olcsó, egyszerű, általam fejlesztett mérőberendezést tartalmaz, amelyek valós időben IP cím alapján szolgáltatják a környezetükben lévő NOx-szintet. Az érzékelőket úgy választottuk meg, hogy a mérési tartományuk abban az intervallumban legyen, amelyet a környezet védelmi előírások is tárgyalnak.",
    "keywords": [],
    "generated_keywords": [
      "3D",
      "NOx",
      "NOx-szennyezésének",
      "RBF",
      "alapján kapott"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2017,
    "title": "3-tengelyes elektronikus stabilizátor akciókamera stabilizálásához",
    "students": [
      {
        "name": "Varga Attila",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Dávid László",
        "university": "Sapientia EMTE, egyetemi tanár"
      },
      {
        "name": "dr. György Katalin",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A képfelvevő kamerák fejlesztésének egyik legfontosabb eleme a mozgatható, gyors jeleneteket felvevő kamerák stabilizálása. Sajnos a kereskedelemben kapható ilyen stabilizáló rendszerek szoftvere nem hozzáférhető, ezért nem lehet minden jelenetre külön behangolt alkalmazást készíteni. Dolgozatomban azt a célt tűztem ki, hogy egy saját fejlesztésű 3-tengelyes kamerastabilizátort tervezzek és kivitelezzek, amellyel újszerű algoritmusokat is tesztelhetek. A megvalósítást egy PIC32MX795 mikrovezérlővel és 3 kefe nélküli motorral építettem fel, melyeken a visszacsatolás lehetősége is megvan. Az irányítási algoritmus érzékelője egy MPU-9250 IMU modul, valamint három, a motorokra szerelt, mágneses enkóder. Ebben az esetben összehasonlítom a klasszikus PID algoritmust egy korszerű szabályozási algoritmussal.",
    "keywords": [
      "stabilizátor",
      "PID",
      "Kálmán szűrő",
      "gimbal",
      "mikrovezérlő"
    ],
    "generated_keywords": [
      "MPU-9250 IMU",
      "PIC32MX795",
      "PID",
      "Sajnos",
      "külön behangolt"
    ]
  },
  {
  "major": "Hardverfejlesztések",
  "year": 2017,
  "title": "Omnidirekcionális jármű tervezése és megvalósítása szálolvasztásos additív technológia segítségével",
  "students": [
    {
      "name": "Fülöp Zoltán",
      "major": "Sapientia EMTE, Automatika és alkalmazott informatika szak, 4. év"
    },
    {
      "name": "Gábos Attila",
      "major": "Sapientia EMTE, Automatika és alkalmazott informatika szak, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "dr. Csernáth Géza",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    }
  ],
  "content": "A dolgozat célja egy omnidirekcionális jármű tervezése és kivitelezése, amely képes síkban orientációváltoztatás nélkül tetszőleges irányba mozogni, köszönhetően a különleges, görgőkkel ellátott kerekeknek. Ez a mozgásforma nagyfokú agilitást és irányíthatóságot biztosít, így a jármű jól alkalmazható szűk vagy változó környezetben. A jármű speciális alkatrészeihez a szerzők a szálolvasztásos additív technológiát (FDM 3D nyomtatás) választották, mely lehetővé teszi a gyors prototípusgyártást. A dolgozat bemutatja a teljes fejlesztési folyamatot a CAD-tervezéstől a működő modell megvalósításáig.",
  "keywords": [
    "omnidirekcionális robot",
    "CAD tervezés",
    "FDM nyomtatás"
  ],
  "generated_keywords": [
    "3D nyomtatás",
    "additív gyártástechnológia",
    "mobil robotika"
  ]
},
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2017,
    "title": "Online aláírás-felismerést végző webszolgáltatás",
    "students": [
      {
        "name": "Bandi András",
        "major": "Sapientia EMTE, Számítástechnika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Antal Margit",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Napjainkban a hagyományos biometrikus azonosítási módszerek mellett, mint az ujjlenyomat, arc, írisz, egyre inkább terjednek a viselkedési biometrikus azonosítási módszerek. Az aláírás az egyik legősibb viselkedés alapú azonosítási módszer. Az aláírás-felismerés esetén az a cél, hogy a rendszer biztonságosan működjön, azaz ne fogadjon el hamisított aláírást, és minél kevesebbszer utasítsa vissza az eredeti felhasználót. Dolgozatomban egy aláírás-hitelesítést végző webszolgáltatást valósítottam meg, amely lehetővé teszi, hogy a felhasználókat az aláírásuk alapján hitelesítse, illetve jelszó mellett, kiegészítő hitelesítésként is használható. A szolgáltatás igénybevételéhez a felhasználónak csak egy okostelefonra, tabletre vagy érintőképernyővel rendelkező számítógépre van szüksége. Az aláírás mintavételezése kliensoldalon történik, ami majd a szerverre továbbítódik, ahol megvalósul a tulajdonképpeni aláírás-felismerés. A kliens-szerver architektúra miatt a hatékony aláírás-felismerés mellett megoldottam az adatok biztonságos továbbítását is. A szoftver egyik újszerű komponense a betanításhoz használt aláírások minőségi elemzése, amely a regisztráció során a felhasználói aláírásmodellhez kiválasztja a legjobb minőségű aláírásmintákat. Nagyon eltérő minták esetében figyelmezteti a felhasználót, szükség esetén elutasítva ennek regisztrációját. Az aláírásminták minőségi elemzését több nemzetközi adatbázison is elvégeztem.",
    "keywords": [],
    "generated_keywords": [
      "Nagyon",
      "jelszó mellett",
      "kiegészítő",
      "mellett megoldottam",
      "módszerek mellett"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2017,
    "title": "Folyamatos gesztusfelismerés gyorsulázérzékelővel",
    "students": [
      {
        "name": "Bárdi Orsolya",
        "major": "Sapientia EMTE, Informatika szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Antal Margit",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Az új generációs mobiltelefonok több olyan érzékelőt tartalmaznak, amelyek segítségével érdekes és hasznos alkalmazások készíthetők. Ilyen például a gyorsulásérzékelő is. Dolgozatunk fő célja egy olyan szoftver megvalósítása, amely a gyorsulásérzékelőből kinyert adatokat folyamatosan figyeli és felismeri a vezérlési gesztusokat. A legnagyobb kihívást a gesztusok végpontjainak helyes felismerése jelenti. Annak ellenére, hogy a szakirodalom olyan rendszereket ismertet, amelyekben a vezérlési gesztusokat külön tanítják meg a rendszernek, a mi rendszerünk tanítása úgy történik, hogy egyetlen gesztussorozatot vételezünk, majd ebből egy saját algoritmussal meghatározzuk a gesztusok végpontjait. A gesztussorozat darabolása után nagyon pontosan meghatározható a végpont detektáláshoz szükséges küszöbérték. A gesztusok felismerésére a dinamikus idővetemítés (DTW) algoritmusát használtuk, amely az idősorok közötti távolság kiszámításával határozza meg a hasonlóságokat. A rendszer 6 gesztust ismer fel (jobb, bal, fel, le, kör jobbra, kör balra), de ezeket igény szerint le lehet cserélni, illetve bővíteni is lehet. A megvalósításban törekedtünk a hibaszűrésre: egy küszöbérték definiálásával megvalósítható a rosszul végzett vagy ismeretlen gesztusok kezelése is. Rendszerünk fontos tulajdonsága a felhasználófüggetlenség, tehát egyetlen tanítás után bárki használhatja. Munkánk eredménye egy olyan okostelefon alkalmazás, amely felismeri a definiált gesztusokat. A tesztelés és szemléltetés érdekében készítettünk egy számítógépes alkalmazást, amely Bluetooth segítségével kommunikál az okostelefonnal. A felismert gesztusokat az okostelefon elküldi a számítógépnek, amely a kapott parancsra egy kiválasztott mappából megjeleníti és váltogatja a képeket.",
    "keywords": [],
    "generated_keywords": [
      "Bluetooth",
      "DTW",
      "Dolgozatunk",
      "Ilyen",
      "határozza meg"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2017,
    "title": "Lokális és globális jellemzők ötvözése online aláírás-felismerő rendszerekben",
    "students": [
      {
        "name": "Medve Dalma Beáta",
        "major": "Sapientia EMTE, Informatika szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Antal Margit",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Egyre többféle távoli szolgáltatást veszünk igénybe okostelefonunkról. A szolgáltatások biztonságos igénybevétele megköveteli a felhasználók ellenőrzését. Ennek megvalósítására a jelszó alapú rendszerek mellett elterjedőben vannak a biometrikus ellenőrzési módszerek is. Egy ilyen biometrikus módszer az aláírás, amely könnyedén végezhető mobiltelefon segítségével, hisz az érintőképernyő alkalmas az aláírás digitalizálására. Az aláírás digitalizálása mellett számos más tulajdonság is kinyerhető az eszköz szenzorjaiból, amely a felhasználó viselkedését jellemzi. Dolgozatomban két felismerési módszert, egy lokális és egy globális módszert ötvözök a felismerési rendszer pontosságának javítása érdekében. A lokális módszer az aláírás digitalizált pontjaihoz rendelt idősorok összehasonlítását végzi dinamikus idővetemítés segítségével. A globális módszer az aláírásból olyan jellemzőket állít elő, amelyek a teljes aláírást jellemzik, majd anomáliadetektorokkal végzi a felismerést. A javasolt két korszerű felismerési módszer ötvözésének hatékonyságát nagyméretű, aláírásokat tartalmazó adatbázisokon végzett mérésekkel igazolom.",
    "keywords": [],
    "generated_keywords": [
      "egy globális",
      "egy lokális",
      "rendszerek mellett"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2017,
    "title": "Raspberry Pi alapú kamerarendszer biztonsági kérdései",
    "students": [
      {
        "name": "Kucsván Zsolt - Levente",
        "major": "Sapientia EMTE, Informatika szak, 2. év"
      },
      {
        "name": "Kucsvan Attila",
        "major": "Sapientia EMTE, Informatika szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Márton Gyöngyvér",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjainkban a térfigyelő kamerákat elhelyezik mind privát, mind publikus területeken is. Ezek azt a célt szolgálják, hogy az adott területet megfigyeljék. TDK dolgozatunk célja megvalósítani egy olyan biztonságikamera-szoftvert, amely egy kliens-szerver kapcsolatra épül, ahol a kliens (kamera) biztonságos módon továbbítja az adatokat a szerverre, illetve a szerver biztonságos módon tárolja a rögzített adatokat. A dolgozat bemutatja a kliens-szerver kapcsolatot, a protokollt, amely alapján működik a kapcsolat, a felhasznált kriptográfiai primitíveket, mint például az RSA, AES, Shamir-Secret Sharing, valamint ismertetésre kerül az adatok tárolására felhasznált adatbázis. A dolgozat tárgyalja a rendszer hatékonyságát, illetve kitér a jelenleg elterjedt kameráknál használt szoftverek és az általunk megvalósított rendszer közti különbségekre. Az alkalmazás elkészítése során megállapítottuk, hogy a rendszer hatékonysága több paramétertől is függ, mint például hogy mennyi az egységnyi idő alatt feldolgozott képkockák száma illetve hogy milyen tömörítési algoritmust használunk. Kijelenthetjük azt is, hogy az általunk fejlesztett rendszer rendelkezik a standard biztonsági követelményekkel.",
    "keywords": [],
    "generated_keywords": [
      "AES",
      "Napjainkban",
      "Shamir-Secret Sharing",
      "TDK",
      "módon továbbítja"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2017,
    "title": "Egyszerű webkamerával működő biztonsági rendszer",
    "students": [
      {
        "name": "Nagy Éva Henrietta",
        "major": "Sapientia EMTE, Távközlés szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Szántó Zoltán",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjainkban az emberek, de leginkább a diákok nagy része rendelkezik laptoppal, számítógéppel, melynek van beépített vagy USB portra csatlakoztatott webkamerája. Dolgozatom célja egy biztonsági rendszer fejlesztése, amely meglévő eszközök használatát veszi igénybe anélkül, hogy plusz költségekkel terhelné a felhasználót. A Netbeans, illetve Scene Builder környezetben írt szoftverem kamera segítségével felügyeli az adott helyiségben történő eseményeket. Minden érzékelt változás alkalmával SMS-ben értesíti a felhasználót, illetve megadott e-mail címre elküldi azokat a fényképeket, melyeken különbséget, azaz mozgást észlel. A szoftver készítéséhez az OpenCV nyílt forráskódú, számítógépes látást megvalósító függvénykönyvtárat használtam, mely a képfeldolgozás területén ismeretes. Ezen függvények segítségével megvalósítható a videó megjelenítése, képek beolvasása, kiíratása, tárolása, manipulálása és feldolgozása.",
    "keywords": [],
    "generated_keywords": [
      "Dolgozatom",
      "Ezen",
      "Minden",
      "Netbeans",
      "OpenCV"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2017,
    "title": "Android alkalmazások piaci életciklusa",
    "students": [
      {
        "name": "László Balázs",
        "major": "Sapientia EMTE, Informatika szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Jánosi-Rancz Katalin Tünde",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A modern világunkban egyre népszerűbbek a mobileszközök, és ezt kihasználva egyre több applikáció érkezik különböző fejlesztőcsoportoktól. Dolgozatom célja Android-alkalmazások piaci életciklusának kutatása, egy olyan applikáció fejlesztése, amely az ötlet felvetésétől a megvalósításig, a publikációt és az azt követő időszak felmérését és nyomon követését, illetve potenciális frissítések kiadását foglalja magába. Különböző lehetőségek/technológiák léteznek, melyek alapul szolgálhatnak Android-alapú applikációknak, például fejlesztést egyszerűsítő programok/motorok (Unity, GodotEngine) vagy az alap készlet (tiszta Android). Ezeket egy játék leprogramozásával érném el, ezt mindenféle motor vagy egyszerűsítés nélkül, tiszta Androiddal és a fejlesztést követő publikálással. A publikálást és az azt követő teendőket a GooglePlay Developer Console-lal érem el, ahol pontos képet kaphatok applikációm piaci változásairól, a letöltéseiről és sok hasonló információkról, egyszóval a piaci életciklusáról. Különböző kimutatásokat végzek, mint például győzelmek vagy lépések száma. A játékélmény növelése érdekében mesterségesintelligencia-módszerekkel gépi ellenfeleket is megvalósítottam. Azért választottam alanyként egy játékot, mivel a mobilpiacon az újonnan megjelenő termékek közül a játékok a legfelkapottabbak, valamint a játékfejlesztés közel áll jövőbeli céljaimhoz.",
    "keywords": [],
    "generated_keywords": [
      "Android",
      "Android-alapú applikációknak",
      "Android-alkalmazások",
      "Androiddal",
      "Azért"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2017,
    "title": "Nagyméretű képgyűjtemény kezelése",
    "students": [
      {
        "name": "Czimbor Tibor-Huba",
        "major": "Sapientia EMTE, Informatika szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Egyed-Zsigmond Előd",
        "university": "INSA Lyon, egyetemi docens"
      }
    ],
    "content": "Mi lenne, ha nem a szokásos rács formában vizsgálnánk egy keresett kép találatait? Ha kíváncsiak lennénk, hogyan is néz ki a képgyűjteményünk egy érdekesebb alakzatban megjelenítve? A túl sok görgetésen és fárasztó keresésen segíthetünk, ha többféle módot is szolgáltatunk a felhasználónak a nagyméretű képhalmaz minél jobb lecsökkentésére. Ezt meg lehetne valósítani megjelenítési formák változtatásával, szűrők és kulcsszavak hozzáadásával, valamint képtávolság- és képhasonlósági függvények alkalmazásával. Dolgozatunk célja egy ilyen képgyűjteményt megjelenítő rendszer létrehozása, valamint néhány technológia sebességének és skálázhatóságának összehasonlítása nagyszámú bemeneti képhalmaz esetén.",
    "keywords": [],
    "generated_keywords": []
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2017,
    "title": "Megerősítéses mélytanulás alkalmazása pénzügyi idősorokon",
    "students": [
      {
        "name": "Demeter Csaba",
        "major": "Sapientia EMTE, Informatika szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Iclănzan Dávid",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A megerősítéses tanuláson alapuló ügynök az interakciókból tanul és ezek segítségével határozza meg az optimális viselkedést az adott környezetben. A cselekedeteinek következményei alapján megfigyeléseket végez, melyekkel az állapotokat cselekvésekre képezi le, így a korábbi tapasztalatait felhasználva megfelelően helytáll új helyzetekben is. Az állapotok direkt leképezése táblázat segítségével egy egyszerűbb feladat esetében is jelentős problémákat okozhat a lehetséges állapotok túl nagy száma miatt. A mélytanulásnak köszönhetően ez a probléma áthidalható. Többrétegű neuronhálók segítségével magas szintű absztrakciót alkalmazva megfelelő megközelítést nyújt a környezet reprezentálására. A megerősítéses tanulás és a mélytanulás kombinációja teszi lehetővé a tanuló ügynök helytállását valós feladatok esetében is. A dolgozat egy megerősítéses mélytanuló ügynök megvalósítását mutatja be pénzügyi idősorokon alkalmazva. A feladat kihívást jelent mind az ügynök, mind az ember számára, ami a részvényértékek nagyrészt kiszámíthatatlan változásának köszönhető, mivel a különféle külső események zajos adatokat eredményeznek. A megerősítéses mélytanulást alkalmazó módszer ígéretes eredményeket ért el, szignifikánsan meghaladva egyszerűbb stratégiák teljesítményét, mint például a „Buy and Hold” stratégiát.",
    "keywords": [],
    "generated_keywords": [
      "Buy and Hold",
      "határozza meg",
      "megfelelően helytáll",
      "így"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2017,
    "title": "Emberi mozgás követése",
    "students": [
      {
        "name": "Kakucs Gergő",
        "major": "Sapientia EMTE, Számítástechnika szak, 4. év"
      },
      {
        "name": "Bala Zsolt",
        "major": "Sapientia EMTE, Számítástechnika szak, 4. év"
      },
      {
        "name": "László Tamás-Levente",
        "major": "Sapientia EMTE, Számítástechnika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Vajda Tamás",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozatunk célja az emberi test mozgásának a követése különböző módszerekkel. Ennek a megvalósítására három különböző bemeneti csatornát használunk: egy egyszerű webkamerát, az xbox Kinect szenzort, végül 12 darab kábel nélküli kommunikációra képes inercia szenzorral ellátott mikrokontrollert. Mindhárom csatorna más és más betekintést tesz lehetővé a mozgás vizsgálatába. Míg a webkamera csak egy vizuális képet add, addig a másik két csatorna követi a mozgást. Ennek a dolgozatnak egy gyakorlati alkalmazása a Parkinson-kórban szenvedő betegek kivizsgálása és ezeknek a méréseknek a tárolása és archiválása későbbi elemzésre.",
    "keywords": [],
    "generated_keywords": [
      "Mindhárom",
      "Parkinson-kórban",
      "vizuális képet add",
      "xbox Kinect"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2017,
    "title": "Neuronháló által vezetett autó",
    "students": [
      {
        "name": "Marosi Szilamér-Ervin",
        "major": "Sapientia EMTE, Számítástechnika szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Dávid László",
        "university": "Sapientia EMTE, egyetemi tanár"
      }
    ],
    "content": "Tehát arról van szó, hogy van egy autónk, amelynek követnie kell egy mintát (fehér \"vidéken\" fekete utat). Az autón van egy kamera, aminek az adatait feldolgozzuk neuronháló segítségével. A neuronháló vezeti az autót. A kamera az autóra van erősítve, filmezi az utat, ennek a bemenetét vezéreljük a hálóra. A cél, hogy az autó tudja követni az utat.",
    "keywords": [],
    "generated_keywords": [
      "Tehát",
      "egy autónk",
      "követnie kell",
      "tudja követni"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2017,
    "title": "3D modellezés",
    "students": [
      {
        "name": "Szép Zoltán",
        "major": "Sapientia EMTE, Informatika szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Jánosi-Rancz Katalin Tünde",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjainkban elterjedt a háromdimenziós modellek használata, a technológia és a számítógépek fejlődésének köszönhetően alkalmazások széles köre épül térbeli alakzatok leírására, szabad formájú görbék és felületek, szilárd testek számítógépes modellezésére. Az ipari alkalmazások, játékok, animációs filmek után ma már mindennapi életünkben is megjelennek. A valóságban a 3D-s látáshoz szükségünk van arra, hogy az adott objektumot mind a két szemünkkel nézzük, melyek külön-külön egy kétdimenziós képet érzékelnek, különböző szögből, majd ezekből 3D-s kép áll össze az agyunkban. Hasonlóan a számítógépeknél, amit 3D-s grafikának hiszünk, az valójában egy, a képernyőre vetített sík kép, ami csupán az igazi 3D közelítése. Manapság a 3D modell többnyire síklapokkal, általában háromszögekkel határolt leírást jelent. Geometriai transzformációk segítségével az objektumok átformálhatók és animálhatók, a modellezés során fényforrásokat és kamerákat (nézőpontokat) adhatunk meg. A dolgozat célja, hogy ismertesse a 3D modellezés alapjait, geometriai transzformációkat, objektumok felépítését, objektumok árnyalását és textúrák készítését a gyakorlatban. Ugyanakkor bemutatja, hogy miként épül fel az alapokról egy 3D modellező szoftver. Az alkalmazás, mely C++ nyelvben íródott és az OpenGL API-t használja, felhasználói felületet biztosít, eszköztárral (3D modellekkel, textúrákkal) és 3D nézettel, ahol szabadon formázhatjuk az objektumokat, fényforrásokat helyezhetünk el, valamint lehetőségünk van kép vagy .obj formátumban lementeni.",
    "keywords": [],
    "generated_keywords": [
      "3D",
      "3D-s",
      "3D-s grafikának hiszünk",
      "C++",
      "Geometriai"
    ]
  },
  {
    "major": "Kertészettudományi",
    "year": 2017,
    "title": "Egy pomológiai származáskutatás eredményei: az Orbai alma európai elterjedésének története",
    "students": [
      {
        "name": "Nagy Zsolt",
        "major": "Sapientia EMTE, Kertészmérnöki szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Thiesz Rezső",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A magyar pomológiai gondolkodás tudomány- és kutatástörténetében kezdetektől nyomon követhető az egyes Kárpát-medencei termőhelyekre, gyümölcstermő és -termesztő vidékekre, övezetekre jellemző gyümölcs-tájfajták iránti történeti szemléletű érdeklődés. Az utóbbi évtizedben ennek hozadékaként alakult ki az az új tudományterület, amely (történeti-)etnopomológia néven határozza meg önmagát, s amely fajta-központú vizsgálataiban olyan történelmi fajták kialakulásának, elterjedésének, történetének feltárását vállalja, amelyek jelentős kultúr- és szakmatörténeti értéket képviselnek, s tudományos, gazdasági és társadalmi hatás szempontjából is értékelhetőek. Jelen dolgozat is a (történeti- )etnopomológiai tanulmányok sorába tartozik: az Orbai alma európai elterjedésének másfél évszázados történetét tárja fel statisztikák, korabeli újságcikkek, archív felvételek, levelezések, levéltári dokumentumok alapján, miközben e háromszéki tájfajta pomográfiai, pomometriai és pomonómiai tulajdonságait is ismerteti.",
    "keywords": [],
    "generated_keywords": [
      "Jelen",
      "Kárpát-medencei",
      "Orbai",
      "archív felvételek",
      "fajták kialakulásának"
    ]
  },
  {
    "major": "Kertészettudományi",
    "year": 2017,
    "title": "RUHAFESTÉK ELTÁVOLÍTÁSA MESTERSÉGES VIZES OLDATBÓL KÖRNYEZETBARÁT ELJÁRÁSSAL",
    "students": [
      {
        "name": "Rápó Eszter",
        "major": "Sapientia EMTE, Környezetvédelem és monitoring MSc, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Tonk Szende",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjainkban a vízszennyezés egyike a legfontosabb környezeti problémáknak, amely mielőbb megoldást kíván. Az UNICEF/WHO egyes felmérései szerint minden 10 emberből 1 nem jut tiszta vízhez. A textilipar nagyon sok szennyvizet termel, amelyek a legnehezebben tisztítható szennyvizek, 2014-ben 1,5 millió tonna színezéket gyártottak, amelynek több mint 10%-a a környezetbe kerül. A Remazol Brilliant Violet-5R (RBV-5R) egyike a legfontosabb azo-színezékeknek, melyet a textiliparban használnak cellulóz alapú szálak festésére. Különösen veszélyes a vízi élővilágra, a színezékkel való festés során megközelítőleg 10-50%-a a kezdeti koncentrációnak szennyvízként visszamarad. A dolgozat célja bioremediációs módszer kidolgozása Remazol Brilliant Violet-5R (RBV-5R) azo-színezék eltávolítására mesterséges vizes oldatból. A munkánk során háztartásból származó (Gallus Gallus domesticus) tojáshéjat használtunk bioszorbensként a szerves színezék/festékanyag eltávolítására. Az adszorpciós vizsgálatainkat statikus körülmények között különböző koncentrációtartományban (CRBV- 5R=20-100mg/L) végeztük. Tanulmányoztuk a kiindulási festékkoncentráció, szemcseméret, biomassza- mennyiség, a kontaktidő, a hőmérséklet, valamint a pH hatását az adszorpciós folyamatra. A kapott eredmények alapján meghatároztuk az egyensúlyban maximálisan adszorbeált anyagmennyiségeket, a megkötés hatékonyságát, valamint az EDX mérések eredményeiből a biokoncentrációs faktort. A szerkezet morfológiai változásait SEM vizsgálatok segítségével, valamint a funkciós csoportokat Fourier- transzformációs infravörös spektroszkópiával tanulmányoztuk. A kapott egyensúlyi adatokat a Langmuir, Freundlich, Temkin és Dubinin-Radushkevich izoterma modellekkel, az adszorpciós mechanizmust a pszeudo első- és másodrendű kinetikai modellekkel, valamint a részecskéken belüli diffúziós modell segítségével elemeztük. Az elért eredmények alapján elmondható, hogy a tyúktojáshéj hatékony, környezetbarát szorbens és alkalmazható (RBV-5R) színezék eltávolítására vizes oldatból.",
    "keywords": [],
    "generated_keywords": [
      "CRBV- 5R=20",
      "EDX",
      "Freundlich",
      "Gallus Gallus",
      "Különösen"
    ]
  },
  {
    "major": "Kertészettudományi",
    "year": 2017,
    "title": "Növényvédelemben alkalmazható előrejelzési software tervezése",
    "students": [
      {
        "name": "Demeter Imre",
        "major": "Sapientia EMTE, Növényorvos MSc, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Balog Adalbert",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "Jelen vizsgálattal a célunk egy olyan előrejelzési szoftver tervezése, mely a növényvédelemben széles körben alkalmazható, főként kártevő rovarokra. A kísérletben két olyan kártevő rovart használunk tesztalanyként, melyek számára a globális felmelegedés hatására kedvező feltételek alakulhatnak ki, és a globális áruforgalomnak köszönhetően könnyen behurcolhatóak más terültekről: ez a két kártevő a Drosophila suzukii (pettyes-szárnyú muslica) és a Helicoverpa armigera (Gyapottok-bagolylepke). A szimuláció Android-alkalmazásként készült, mely futás közben GPS koordinátákat, tápnövényeket és meteorológiai adatokat vesz alapul. A szoftver futása során a dátumot tetszőlegesen állíthatjuk be a gombok segítségével. A három megye bármelyikébe (Hargita, Kovászna, Maros) tetszőlegesen elhelyezhetjük a kártevőt, és figyelhetjük annak terjedését, szaporodását, populációját a beállított dátumon, ezt akár napokra lebontva is.",
    "keywords": [],
    "generated_keywords": [
      "Android-alkalmazásként készült",
      "Drosophila",
      "Gyapottok-bagolylepke",
      "Hargita",
      "Helicoverpa"
    ]
  },
  {
    "major": "Kertészettudományi",
    "year": 2017,
    "title": "A növényi növekedés serkentő baktériumok hatása a búzanövények nehézfémek által kiváltott stresszválaszára",
    "students": [
      {
        "name": "Vincze Éva Boglárka",
        "major": "Sapientia EMTE, Fenntartható biotechnológiák MSc, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Mara Gyöngyvér",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "A növényekben a magas nehézfém-koncentráció stresszválaszt vált ki, amely során reaktív oxigén gyökök (ROS) keletkeznek. A ROS a sejtek redox-állapotát befolyásolja, membránszétesést, biológiai makromolekulák lebomlását, ionkiáramlást, lipid peroxidációt és a DNS szál hasadását okozza. A reaktív oxigén gyökök semlegesítésére a sejt molekuláris szinten válaszol olyan enzimek termelése által, amelyek a szuperoxid gyök, illetve a hidrogén-peroxid detoxifikálására alkalmasak. A PGP rizobaktériumok nemcsak a növényi növekedést serkentik sziderofor és indol-3-ecetsav termelése által, hanem a növények indukált szisztémás rezisztenciájának kialakulásában is szereppel bírnak, ezáltal növelve a növények abiotikus és biotikus stressztűrő képességét. Kutatásunk célja egy saját izolálású növekedésserkentő baktériumfaj hatásának vizsgálata a búzanövény nehézfém (Cd2+, Zn2+) akkumulációjára és stresszválaszára. Kutatásunk során a búzanövények növekedését, nehézfém-akkumulációját és a termelt stresszfehérje (GPOX, POD) mennyiségét követtük különböző nehézfém-koncentrációkat alkalmazva, baktérium jelenlétében és hiányában.",
    "keywords": [],
    "generated_keywords": [
      "Cd2",
      "DNS",
      "GPOX",
      "PGP",
      "ROS"
    ]
  },
  {
    "major": "Kertészettudományi",
    "year": 2017,
    "title": "PGPR baktériumok hatása a kukoricanövények fémfelvételére és növekedésére",
    "students": [
      {
        "name": "Fejér Sándor Zsolt",
        "major": "Sapientia EMTE, Fenntartható biotechnológiák Msc, 2. év"
      },
      {
        "name": "Vincze Éva Boglárka",
        "major": "Sapientia EMTE, Fenntartható biotechnológiák Msc, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Mara Gyöngyvér",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "A szennyezőanyagok közül a nehézfémek komoly gondokat jelentenek, hiszen már alacsony koncentráció esetén is toxikusak a növényekre, állatokra, illetve felhalmozódva a táplálékláncban károsak lehetnek az emberre nézve is. Az új iparágak megjelenésével egyre elterjedtebb a talajok nehézfémszennyezése, ehhez a bányászat, műtrágyázás és a közlekedés során kibocsátott káros anyag is hozzájárul. A nehézfémek bejutva a növényi sejtekbe az itt lejátszódó folyamatokat gátolják, módosítva a fehérjék, az örökítő anyag, a lipidek szerkezetét és funkcióját. A PGP rizobaktériumok nemcsak a növényi növekedést serkentik, hanem a növények indukált szisztémás rezisztenciájának kialakulásában is szereppel bírnak, ezáltal növelve a növények abiotikus és biotikus stressztűrő képességét. Kutatásunk célja egy saját izolálású növekedésserkentő baktériumfaj hatásának vizsgálata a kukoricanövény nehézfém (Cd2+, Zn2+) akkumulációjára és növekedésére. Kutatásunk során a kukoricanövények növekedését és nehézfém-akkumulációját követtük különböző nehézfém- koncentrációkat alkalmazva, baktérium jelenlétében és hiányában.",
    "keywords": [],
    "generated_keywords": [
      "Cd2",
      "PGP",
      "Zn2",
      "hanem",
      "itt"
    ]
  },
  {
    "major": "Kertészettudományi",
    "year": 2017,
    "title": "Szerves talajtakarás hatása bagolylepkehernyók (Lepidoptera, Noctuidae) kártételére paradicsomban és burgonyában",
    "students": [
      {
        "name": "Putnoky Csicsó Barna",
        "major": "Sapientia EMTE, Növényorvos MSc, 2. év"
      },
      {
        "name": "Petrikovszki Renáta",
        "major": "Szent István Egyetem, Növényorvos MSc, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Balog Adalbert",
        "university": "Sapientia EMTE, egyetemi professzor"
      },
      {
        "name": "dr. Tóth Ferenc",
        "university": "Szent István Egyetem, egyetemi docens"
      }
    ],
    "content": "A talajtakarás pozitív oldalai ismertek, mint például a gyomok elnyomása, a talaj nedvességének megtartása, ami nagyobb termésmennyiséget eredményez. Feltételezhető azonban, hogy a nagyobb, lédúsabb termésű növényeken nagyobb lesz a bagolylepkehernyók kártételének aránya. A vizsgálat során arra kerestük a választ, hogy a szerves talajtakarás növeli-e paradicsom esetén a gyapottok bagolylepke (Helicoverpa armigera), burgonya esetén pedig a vetési bagolylepke (Agrotis segetum) lárvája okozta kártétel mértékét. A kísérlet helyszínéül a Gödöllői Szent István Egyetem növényvédelmi kísérleti területe szolgált. Paradicsom esetén 24 parcellában parcellánként 4 növény kapott helyet. Minden második parcella juhar avarral (Acer spp.) volt takarva, és az összes parcellának fele volt öntözve. Burgonya esetében 72 parcella volt, parcellánként 4 bokor, bokronként 2 növény ültetve. A talajtakarás szalmával, komposzttal, vegyes avarral és diófa avarral (Juglans regia) történt. A kontroll parcellák nem lettek takarva semmivel. Az eredmények bebizonyították, hogy a talajtakarás valóban nagyobb növényt és nagyobb termést eredményez. A kártételek aránya a nem takart parcellákéhoz képest viszont nem változott, ami azt feltételezi, hogy a kártevőket, adott esetben a gyapottok-bagolylepkét és a vetési bagolylepkét nem befolyásolta a károsított növények kondíciója. Következtetésképpen elmondhatjuk, hogy mivel a szerves talajtakarás pozitívan befolyásolja a paradicsom és a burgonya növekedését, viszont nincs hatással a kártétel arányára a kontroll parcellákhoz képest, ezért érdemes lenne a módszert üzemi méretekben is tesztelni.",
    "keywords": [],
    "generated_keywords": [
      "Acer spp",
      "Agrotis segetum",
      "Burgonya",
      "Feltételezhető",
      "Gödöllői Szent István Egyetem"
    ]
  },
  {
    "major": "Kertészettudományi",
    "year": 2017,
    "title": "A tájépítészet szerepe a kertterápiában",
    "students": [
      {
        "name": "Kolozsvári Agrártudományi és Állatorvosi Egyetem",
        "major": "USAMV"
      }
    ],
    "teachers": [
      {
        "name": "dr. Dan Valentin Sebastian",
        "university": "USAMV, mérnök"
      }
    ],
    "content": "Az ergoterápia szó a görög ergein ’csinálni, dolgozni, cselekedni’ igéből ered. Ez a kezelés abból az elvből indul ki, hogy a cselekvés az ember alapvető igénye, és a cselekvés önmagában is gyógyító hatású. Ennek egy speciális ágazata a kertterápia. A kertterápia egy folyamat, amely során kapcsolat létesül az emberi test, lélek és a természet között. Kutatások bizonyítják, hogy a táj, a növények vagy a kertészkedés maga hozzájárul a személy pszichológiai és fizikai rehabilitációjához, a test, lélek, értelem hármas javításához. Kolozsváron mai nap is létezik Pszichiátria és Ergoterápia Intézet. Az utóbbi nevét sajnos a jelenlegi helyzet már nem legitimálja. Dolgozatom célja kihangsúlyozni az ergoterápia lényegét és fontosságát, megoldást nyújtva az intézet zöldövezetének újratervezéséhez. Kutatásom során volt szerencsém megismerni a kórház pácienseit, az őket kezelő személyzetet, így átfogó képet alkothattam a rendszer működéséről. Bizalmukat elnyerve foglalkozást tarthattam a beutalt személyek számára, ezáltal felhívva a vezetőség figyelmét a kertterápia adta lehetőségekre. Tájépítészeti munkám során egy fenntartható megoldást, egy úgynevezett gyógyító kert-tervet mutattam be a kórház vezetőségének, az intézet zöldterületének hasznosíthatóságáról, az ember és kert kapcsolatának fellendítéséről. Mi tájépítészek nem rendelkezünk orvosi adottságokkal, orvosi tudománnyal, de a szakmánk nyújtotta eszközöket alkalmazva hozzájárulhatunk az emberek egészségének kezeléséhez, a jóllét fenntartásához.",
    "keywords": [],
    "generated_keywords": [
      "Ergoterápia Intézet",
      "Kolozsváron",
      "Pszichiátria",
      "az ember",
      "indul ki"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2017,
    "title": "Önreprezentáció bemutatása a Facebookon",
    "students": [
      {
        "name": "Szász Noémi Henrietta",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Tőkés Gyöngyvér",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A mai társadalom személyisége jobban megmutatkozik online felületeken, mint a reális életben, „face to face” módon. Dolgozatom célja az Y generáció önreprezentációjának a vizsgálata Facebookon, valamint az online és offline identitás közötti hasonlóság és különbség megfigyelése. Kutatási alanyként egyenlő nemi arányban választottam ki 4 tagot az Y generáció köréből. Adatgyűjtési módszerként személyiségtesztet alkalmaztam, valamint megvizsgáltam az alanyok Facebook profilját tartalomelemzési módszerrel, illetve a strukturált interjú segítségével.",
    "keywords": [],
    "generated_keywords": [
      "Adatgyűjtési",
      "Facebook",
      "Facebookon"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2017,
    "title": "A másság megjelenítése az erdélyi magyar és román sajtóban",
    "students": [
      {
        "name": "André Krisztina",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fülöp Otília",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Minden idők embere csoportokba szerveződik: együtt könnyebb megoldani problémákat, átlátni a megválaszolandó kérdéseket, leküzdeni a nehézségeket, megteremteni a biztonságot. De ha van csoport, akkor van csoporton kívüli is. Ha van „mi”, akkor meghatározható, hogy az, ami nem tartozik a csoportunkba, az a „ti” csoportot erősíti, viszont a „ti”pontos behatárolásával látható csak át az, hogy mit is jelent a „mi” fogalma. Kutatásomban ennek a megfigyelésére vállalkozom. Vizsgálatom során arra fektetem a hangsúlyt, hogy hogyan határozza meg magát az erdélyi magyarság, illetve a környezetükben élő románok, miképpen látják ők egymást, ezt miként jelenítik meg a mindennapi kifele történő kommunikációjukban, és hogyan adnak teret az identitásuk meghatározásának és megerősítésének ezáltal. Mindennek előfordulását négy magyar és két román portálon vizsgálom két kiválasztott időszakban. Az eredmények alapján levont következtetésekre építve átláthatóbbá válik az együttélés során felbukkanó esetleges konfliktusok eredete és ezáltal azok megoldása is.",
    "keywords": [],
    "generated_keywords": [
      "Kutatásomban",
      "Minden",
      "csoporton kívüli",
      "meg magát",
      "ti”pontos"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2017,
    "title": "Önfenntartó közösségek reklámkampány-tervezete",
    "students": [
      {
        "name": "Jakabfi Hunor Zoltán",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Zsigmond István",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Rengeteg reklámtevékenység a városi közösséget veszi célba. A falusi közösség gyakran el van hanyagolva. Dolgozatomban ismertetett reklámkampány-tervezet célja a Közösségi Központ Alapítvány vidékfejlesztési programjának propagálása és népszerűsítése. Dolgozatomban arra a kérdésre keresem a választ, hogy hogyan kell egy hatásos, alacsony költségvetésű, rövid időn belül megtérülő, a célcsoporton belül sokakat megszólító, falusi környezetre szánt reklámkampányt felépíteni, levezetni és hatékonyságát mérni.",
    "keywords": [],
    "generated_keywords": [
      "Közösségi Központ Alapítvány",
      "Rengeteg",
      "célcsoporton",
      "hogyan kell",
      "rövid időn belül megtérülő"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2017,
    "title": "A Sapientia EMTE Marosvásárhelyi Kar Hallgatói Önkormányzatának kommunikációvizsgálata",
    "students": [
      {
        "name": "Kovács Noémi-Anasztázia",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok MA, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fülöp Otília",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatomban a Sapientia EMTE Marosvásárhelyi Karán működő Hallgatói Önkormányzat külső és belső kommunikációjának vizsgálatára vállalkozom, a téma komplexitása miatt több módszert alkalmazva kutatásom során. A belső kommunikációt mélyinterjúkkal, illetve félig strukturált fókuszcsoportos interjúval vizsgáltam. A külső kommunikáció vizsgálatára egy kvantitatív – diáktársaknak szóló kérdőív formájában – és egy kvalitatív módszer is hasznosnak bizonyult. Továbbá figyelemmel követtem az önkormányzat online felületeit is, az ott megjelenő információkat, közleményeket vettem górcső alá a tartalomelemzés módszerével. Kutatásom során kiderült, hogy a Hallgatói Önkormányzat saját bevallása szerint a munkája során igyekszik hallgatótársainak megfelelni, odafigyelve mindenkire a programok kitalálása/megszervezése során. A belső kommunikációt illetően van még mit fejlődniük, akárcsak a külső szervezetekkel való kapcsolatok ápolása szempontjából, viszont már vannak ezekre fejlesztési terveik, céljaik. Az önkormányzat internetes felületeit vizsgálva kijelenthető, hogy a leginkább használt felület a sokak által kedvelt közösségi portál, a Facebook. Egyéb felületeken nem igazán vannak jelen. Dolgozatomban az eredmények kiértékelése után javaslatot mutatok be a szervezet kommunikációjának a javítására.",
    "keywords": [],
    "generated_keywords": [
      "Egyéb",
      "Facebook",
      "Hallgatói",
      "Hallgatói Önkormányzat",
      "Sapientia EMTE Marosvásárhelyi Karán"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2017,
    "title": "Online kommunikációs stratégiák. Esettanulmány a Starbucks online kommunikációjáról",
    "students": [
      {
        "name": "Schmidt Tímea",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Tőkés Gyöngyvér",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Az internet elterjedésének köszönhetően egyre több lehetőség tárul fel a vállalkozások számára, így az online kommunikáció szerepe is folyamatosan növekszik. Ebből következik az a tény is, hogy a szervezetek egyre nagyobb akadályokba ütköznek, amikor az interneten keringő rengeteg információ között a saját üzenetüket kell eljuttatniuk a célközönséghez. Dolgozatomban egy olyan online kommunikációs stratégiát szeretnék összeállítani, amely egy hatékony szervezeti kommunikációt eredményez az olyan online felületeken, mint a weboldal, blogok, valamint a közösségi oldalak, és a márka-építés az elsődleges célja. A kialakított stratégiát egy igazoltan erős márkával rendelkező szervezetre vetítve szeretném megvizsgálni, ezért a dolgozatom jelentős részét egy esettanulmány képezi a nemzetközi Starbucks kávéházlánc online kommunikációjáról. A kutatásom első részét korábbi elméletek alapján kialakított szempontrendszer képezi, ami összesítve nem más mint egy online kommunikációs stratégia, melynek célja a márka-építés. A dolgozat második részében ennek alapján kvalitatív tartalomelemzés által vizsgálom a Starbucks weboldalát, blogját, a saját közösségi oldalát, azaz a My Starbucks Ideat és a közösségi oldalakon való bejegyzéseit. Ezeken a felületeken azt figyelem meg, hogy a szervezet miképp kommunikál a célközönséggel, pontosabban hogyan alakítja a brandjét az elméleti háttérben kialakított szempontok alapján.",
    "keywords": [],
    "generated_keywords": [
      "My Starbucks Ideat",
      "Starbucks",
      "alapján kialakított",
      "melynek",
      "stratégia"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2017,
    "title": "Politikai beszédek. Elemzés Orbán Viktor beszédeinek struktúrájáról és tartalmáról",
    "students": [
      {
        "name": "Pánczél Mikolt",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Kovács Barna",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatom a politikai kommunikáció egy kiemelkedő példáját elemzi, a politikusok által tartott beszédeket. Konkrétan Orbán Viktornak, Magyarország miniszterelnökének 2016-os beszédeit elemzem. Véleményem szerint dolgozatom azért fontos, mert egy olyan szereplő diskurzusáról van szó, akit mind nemzeti, mind nemzetközi szinten befolyásos politikusnak tartanak. Kérdésem alapvetése nem arra vonatkozik, hogy mit, hanem arra, hogy miként fogalmazza meg mondanivalóját, és milyen értékskálát követ. Dolgozatomban a 2016-os év mindegyik hónapjából kiválasztottam egy-egy fontosnak tartható beszédet, rádióinterjút, előadást vagy akár telefonos beszélgetést, amelyről úgy gondolom, hogy tartalmában értéket képvisel, és amikből következtetni lehet arra, hogy milyen elvek szerint vannak felépítve ezek a beszédek. Fő célom az, hogy megnézzem ezeket az elveket, hogy milyen üzeneteket közvetítenek számunkra, valamint hogy milyen következtetést lehet levonni a 2016-os évből. Dolgozatom két fő részből áll, egy elméleti és egy gyakorlati részből. Ez utóbbi a beszédek elemzését a retorika, a diskurzuselemzés, a tartalomelemzés módszereivel valósítja meg. A kutatás eredményeként rámutatok, hogy milyen szabályszerűségei vannak a beszédeknek, valamint melyek azok az értékek, amelyek következetesen jelen vannak.",
    "keywords": [],
    "generated_keywords": [
      "Dolgozatom",
      "Konkrétan Orbán Viktornak",
      "Kérdésem",
      "Magyarország",
      "Véleményem"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2017,
    "title": "A Facebook és a szociális tőke",
    "students": [
      {
        "name": "Lázár-Kiss Panna",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Zsigmond István",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A Facebook 2004 óta a világon a legtöbb felhasználóval rendelkező közösségi oldal, és befolyással van a mindennapi életünkre. A Facebook társas kapcsolatokra gyakorolt hatásával kapcsolatban a kutatók számos pozitív és negatív észrevételt fogalmaztak meg. Kutatásomban azt vizsgálom, hogy a Facebookhasználat milyen hatással van az élettel való elégedettségre, valamint az emberi kapcsolatokra a szakirodalomban használt skálákkal történő felmérés alapján.",
    "keywords": [],
    "generated_keywords": [
      "Facebook",
      "Facebook 2004",
      "Facebookhasználat",
      "Kutatásomban",
      "emberi kapcsolatokra"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2017,
    "title": "A 2016-os parlamenti választások. Esettanulmány egy jelölt online politikai kampányáról",
    "students": [
      {
        "name": "Marton Beáta",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Kovács Barna",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Egy olyan világban élünk, ahol a média és a politika folyamatosan jelen van, köztük pedig kialakult egy olyan kapcsolat, ahol kölcsönösen szükségük van egymásra. A politikusok a különböző médiacsatornákat kihasználva tudják felmérni a célcsoportjukat, valamint eljuttatni az üzenetet a választópolgároknak. Ez pedig fordítva is így van, mert a média ezekből hírt tud formálni, amivel látogatottságra, nézettségre tesz szert. Abból kiindulva, hogy a politikusok felismerik és kihasználják a különböző csatornák nyújtotta lehetőségeket, vizsgálom a politikai kommunikáció megjelenését a közösségi médiában. Dolgozatomban egy esettanulmányt készítek a 2016-os parlamenti választások egyik képviselőjelöltjéről. A tartalomelemzés módszerét használva különböző szempontok alapján vizsgálom a médiában való megjelenését, nagy hangsúlyt fektetve a napjainkban leggyakrabban használt közösségi oldalra, a Facebookra. Kutatásom időtartama felöleli a kampányidőszakot, valamint a választások utáni két hónapot, amiből következtetéseket tudok levonni a hasonlóságokat és az eltéréseket illetően. Kutatásom eredményeként jobban megismerjük a politikai szereplők viselkedését az online térben.",
    "keywords": [],
    "generated_keywords": [
      "Facebookra",
      "köztük pedig",
      "mert",
      "nagy hangsúlyt",
      "olyan kapcsolat"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2017,
    "title": "Beszélő képek, vagyis a szelfi mint vizuális kommunikáció és önkifejezési forma",
    "students": [
      {
        "name": "Szász Beáta",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fülöp Otília",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatom fő témája a szelfi. Abból indultam ki, hogy a kommunikáció legnagyobb részét a viselkedés képezi, mely része a vizuális kommunikációnak, és egy önkifejezési forma lehet. Az önkifejezés témáját leszűkítve a kutatásom a köré épül, hogy a szelfizés és az általunk megosztott szelfik mennyiben határoznak meg minket, mennyiben mutatják meg a valódi énünket. Napjaink rutinjává, szokássá nőtte ki magát a szelfi és az olyan online közösségi portálok használata, mint a Facebook és az Instagram. Éppen ezért az egyetemünk elsőéves női hallgatóinak szelfizési szokásait vizsgálom, azt, hogy milyen gyakran szelfiznek, és ezeket a szelfiket milyen arányban töltik fel az általam említett két közösségi portálra, tehát a digitális identitásukat vizsgálom, hogy ez a fajta identitásuk mennyiben tér el a reális személyiségüktől. Azt kutatom, hogy a szelfizés, mások szelfijei milyen hatással vannak rájuk és, hogy a szelfijeik mögött valójában mi is áll, mi az üzenetük, és hogy hogyan használják a szelfizést és a közösségi portálok teremtette új univerzális „vizuális nyelvet”. Mindezek mellett célom felfedni azt, hogy mindez elősegíti-e az egyén kialakulását és az egyéniség kialakítását, vagy inkább uniformizálja, egységesíti az embereket, és mindenki hasonló lesz általa? Célom, hogy felderítsem annak az általános mintának a lehetőségét, amely köré épül az a szelfikultúra, amely ennyire felborította a világunkat, és ami köré most már mindennapjaink épülnek.",
    "keywords": [],
    "generated_keywords": [
      "Célom",
      "Dolgozatom",
      "Facebook",
      "Instagram",
      "Mindezek"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2017,
    "title": "Kommunikációs kampányterv a sepsiszentgyörgyi Agrármérnöki szak számára",
    "students": [
      {
        "name": "Ferencz Beáta Zita",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Zsigmond István",
        "university": "Sapientia EMTE, adjunktus"
      }
    ],
    "content": "Az intézményről szóló információk tudatos eljuttatása a célcsoportokhoz a PR tevékenységek feladata, amire minden intézménynek szüksége van. Az oktatási PR egy olyan menedzsmentfunkció, amely segít tudatosítani az oktatási intézmény szolgáltatásaira, programjaira vonatkozó információkat. Dolgozatomban bemutatom egy kutatási eredményekre alapozott külső kommunikációs stratégia kidolgozásának lépéseit a Sapientia EMTE sepsiszentgyörgyi Agrármérnöki képzése számára. Vizsgálatom első lépéseként interjút készítettem a szakfelelőssel, Nyárádi Imre-Istvánnal, rákérdezve a marketingkommunikációs szempontból fontos információkra. A továbbiakban helyi középiskolás végzős diákok körében mértem fel a szak ismertségét, és általában a felsőoktatással szemben támasztott elvárásokat. A felmérésekből kiderült, hogy a potenciális hallgatók 30%-a nem tud a szak létezéséről, következésképpen a szak kommunikációs tevékenysége hiányos. A továbbiakban bemutatom az interjú és a felmérések eredményeinek felhasználása alapján kidolgozott marketingkommunikációs stratégiát.",
    "keywords": [],
    "generated_keywords": [
      "Agrármérnöki",
      "Nyárádi Imre-Istvánnal",
      "PR",
      "Sapientia",
      "alapján kidolgozott marketingkommunikációs stratégiát"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2017,
    "title": "„Járjad, járjad, ne hibázz!” Avagy miért szerethetik a városi fiatalok a néptáncot?",
    "students": [
      {
        "name": "Lengyel Norbert-Zoltán",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Gagyi József",
        "university": "Sapientia EMTE, egyetemi tanár"
      }
    ],
    "content": "Ha néptánc, akkor hagyomány. Sok ember fejében ez az állítás fogalmazódik meg, amikor ebben a témában elmélkedik. Maga a kijelentés helyénvaló is lenne. Mindannyian büszkén gondolunk elődeink ránk hagyott örökségére, melyet hűen ápolunk, védünk és tovább akarunk örökíteni utódaink számára. De ezzel valóban kimerítettük volna a néptáncot? Úgy gondolom, nem. A múlt öröksége és a jövőbe való továbbadás mellett megfeledkezünk talán a legfontosabbról, a jelenről. A néptánc önmagában él a mában is. A városi fiatalok, akárcsak sok évvel ezelőtt, ma is táncolnak önmaguk szórakoztatására. Dolgozatomban ezt a jelenséget szerettem volna megvizsgálni. Válaszokat kerestem a kérdésre, hogy miért is szeretheti egy mai fiatal az erdélyi magyar néptáncot. Célcsoportomnak a marosvásárhelyi, néptáncoló fiatalokat választottam, az ők tapasztalataik és élményeik alapján vontam le következtetéseket.",
    "keywords": [],
    "generated_keywords": [
      "Mindannyian",
      "Válaszokat",
      "hagyott örökségére",
      "meg",
      "melyet hűen ápolunk"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2017,
    "title": "Mobilkultúra. Mobileszközök és -applikációk használata a Maros megyei fiatalok körében",
    "students": [
      {
        "name": "György Tímea Bernadett",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Tőkés Gyöngyvér",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A 21. században az információs társadalom infokommunikációs eszköztárának egyik alapvető elemévé vált az okostelefon személyre szabhatóságának és állandó jelenlétének köszönhetően. Dolgozatom célja a Maros megyei középiskolások és egyetemisták okostelefon- és applikációhasználatának bemutatása. Feltáró kutatásom során arra a kérdésre keresek választ, hogy milyen és mekkora szerepet tölt be a fiatalok körében az okostelefon, és ezt az információs és kommunikációs technológiát napjaik milyen szakaszában használják, ekkor pedig milyen céllal. Kvalitatív társadalomtudományi módszerekkel több esetet vizsgálok meg. Együttesen alkalmazom a mélyinterjú és a storytelling módszerét annak érdekében, hogy emberi érzelmeket, emlékeket, élményeket és véleményeket tárjak fel. Továbbá azért, hogy beazonosítsam az eszköz helyét a mindennapokban, az alanyok egy hétig naplót vezetnek a különböző infokommunikációs eszközök használatáról. Dolgozatom első felében bemutatom az információs társadalom általános jellemzőit, valamint a hozzá kapcsolódó fogalmakat, és részletezem az ezen környezetbe ágyazódó okostelefon-jelenséget, a második felében a gyűjtött adatok feldolgozása és az eredmények értelmezése kap helyet.",
    "keywords": [],
    "generated_keywords": [
      "Együttesen",
      "Feltáró",
      "Kvalitatív",
      "Maros",
      "Továbbá"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2017,
    "title": "A Gyermelyi Románia Facebook oldalának elemzése és optimalizálása",
    "students": [
      {
        "name": "Máté Adél Beatrix",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Zsigmond István",
        "university": "Sapientia EMTE, egyetemi adjunktusÍ"
      }
    ],
    "content": "Napjainkban az online kommunikációs eszközök rendkívül fontossá váltak a márka és a fogyasztók közötti kapcsolat kialakításában és megtartásában. Kutatásom során egy online felületre, pontosabban a Gyermelyi Romania Facebook oldalára fókuszálok. Dolgozatom kiindulási pontja a Gyermelyi cég eddigi marketingtevékenysége Magyarországra és Romániára nézve. Megvizsgálom az eddigi online marketingkommunikációs terveit, illetve a Gyermelyi Romania Facebook felületét és a szakirodalom segítségével javaslatokat teszek az oldal megtervezésére és felépítésére vonatkozóan, hogy ezáltal optimalizálni lehessen az előbb említett oldalt.",
    "keywords": [],
    "generated_keywords": [
      "Gyermelyi",
      "Gyermelyi Romania Facebook",
      "Magyarországra és Romániára"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2017,
    "title": "Szervezeti imázs és intézményi identitás egyetemi és középiskolás diákoknál",
    "students": [
      {
        "name": "Portik Tímea Andrea",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Zsigmond István",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A PR, avagy a közkapcsolatok napjaink része: függetlenül attól, hogy tudatosan vagy tudattalanul alakítjuk arculatunkat, a környezetünk fejében kialakul egy bizonyos kép rólunk. Az imázs és az arculat gondos szerkesztése ugyanúgy jellemző az intézményekre is. Bár hajlamosak vagyunk elhinni, hogy csak a multinacionális vagy a feltörekvőben levő cégeknek szükséges a kidolgozott PR stratégia, az oktatási intézményeknek talán még nagyobb mentőövként szolgál. Kutatásomban két marosvásárhelyi felsőfokú oktatási intézmény belső és külső imázsát vizsgálom. Dolgozatom egyik fontos állomása a végzős középiskolások véleményének összegyűjtése és összevetése az egyetemen tanuló diákok elégedettségével. Mindemellett nagy hangsúlyt fektetek az intézmények PR stratégiáinak az elemzésére és a diákok intézményi identitásának a felkutatására különböző módszerek segítségével. Az eredmények alapján átvilágítható az intézmények hírneve, amely kapcsolatba állítható a potenciális felvételizők fejében kialakult imázzsal és a diákok intézményi identitásának létrejöttével.",
    "keywords": [],
    "generated_keywords": [
      "Az",
      "Dolgozatom",
      "Kutatásomban",
      "Mindemellett",
      "PR"
    ]
  },
  {
    "major": "Egészségmagatartás",
    "year": 2017,
    "title": "Helyzetjelentés a romániai asszisztált reprodukciós eljárásokat alkalmazó klinikákról",
    "students": [
      {
        "name": "Szilágyi Henrietta",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Krizbai Tímea",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: Statisztikai adatok szerint Romániában a 35 évnél idősebb nők 30%-a, illetve a 40 évnél idősebbek 50%-a meddő. A meddő házaspároknál 40%-ban a nők, 40%-ban a férfiak terméketlenek, és 20%-ban a meddőség oka ismeretlen marad (Bús 2011). A meddőséget sokan tabuként kezelik, és néha saját családjuk körében is szégyellik, holott ez elterjedt társadalmi problémának számít. Az a tény, hogy egy pár meddő, egyáltalán nem jelenti azt, hogy soha nem lehet saját gyermekük. A meddőség mindig páros gond, amit ma már a jól fejlődő orvostudománynak köszönhetően sikeresen kezelni lehet. Czeizel Endre szerint a lombikbébi módszer egy fantasztikus előrelépés a férfi, illetve a női meddőség kezelésében, sőt a genetikában is. A mesterséges megtermékenyítés az ikerszületések gyakoribb előfordulását is elősegítheti. Ennek a módszernek köszönhetően olvashatunk napjainkban a többes ikerszülésről, kezdve az ötös ikrektől egészen a kilencesig (Krizbai–Bartha 2015). Célkitűzés: Jelen vizsgálat célja a romániai meddőségi klinikáknak a meddőség kezelésében elért eredményeinek elemzése. Célom a klinikák által közölt statisztikai adatok alapján megvizsgálni, hogy a meddő párok milyen arányban fordulnak a klinikákhoz, milyen feltételeknek kell megfelelniük, mekkora összegre van szükség egy lombikbébi beültetéshez. Módszerek: A romániai lombikközpontok statisztikai jelentéseit elemzem. A hivatalos honlapokon szereplő adatok alapján készítek összehasonlító elemzést, illetve egy esettanulmányt a marossszentgyörgyi Zygota Meddőségi központról. Eredmények: 2012-ben Romániában 2000 mesterséges megtermékenyítésre került sor. A statisztikai adatok szerint évente tízezerre lenne szükség, mivel minden hatodik pár fogamzási problémákkal küzd (Vass Gy. 2014). Az Európai Humán Reprodukciós és Embrilógiai Társaság közleménye szerint 1978 júliusa óta világszerte 6 millió lombikbébi született (EHRET 2012). Következtetés: Jelen vizsgálat hasznos adatokat szolgáltat a romániai meddőségi klinikák helyzetéről. A továbbiakban igen fontos lenne azt vizsgálni, hogy világviszonylatban hol tartunk, milyen egészségügyi szabályozás áll az asszisztált reprodukciós eljárások mögött.",
    "keywords": [],
    "generated_keywords": [
      "40%-ban",
      "Bús",
      "Czeizel Endre",
      "Célkitűzés",
      "Célom"
    ]
  },
  {
    "major": "Egészségmagatartás",
    "year": 2017,
    "title": "A munkahelyi stressz mértéke két marosvásárhelyi magáncég dolgozóinál",
    "students": [
      {
        "name": "Ujfalvi Éva-Andrea",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Sántha Ágnes-Rózsa",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: „A stressz az élet sója – nélküle nem élnénk, csak vegetálnánk” (Selye János) Célkitűzések: Kutatásom témája a munkahelyi stressz oka és mértéke különböző munkakörökben. Feltételezem, hogy a munkahelyi stressz kihat az egészségi állapotunkra. Módszerek és eszközök: A vizsgálati populációm 160 felnőtt személy, akik két marosvásárhelyi magáncég, a Richter Gedeon és a Petry alkalmazottai. Célcsoportom egy standardizált, európai összehasonlító vizsgálatokban használt kérdőív online változatát töltötte ki. Eredmények: Várható eredményeim szerint a fizikai munkát végző személyek több munkahelyi stresszt érzékelnek, mint a szellemi beosztásokban dolgozók. Következtetés: Javaslatokat fogalmazok meg a munkahelyi stressz csökkentésére.",
    "keywords": [],
    "generated_keywords": [
      "Feltételezem",
      "Javaslatokat",
      "Módszerek",
      "Petry",
      "Richter Gedeon"
    ]
  },
  {
    "major": "Egészségmagatartás",
    "year": 2017,
    "title": "Szelfizés, avagy szociális megfelelés és önimádat a Facebookon.",
    "students": [
      {
        "name": "Kelemen Zelma Ágnes",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Krizbai Tímea",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: Az életünkben a világháló és a közösségi oldalak olyan mértékben vannak jelen, hogy nélkülük lassan semmit sem tudunk tenni, hogy érvényesüljünk. A közösségi oldalak túlzott használata lassan magával ragadja az embert, és teljesen behálózza a mindennapokat. Ami még ezekhez társul, az nem más, mint a szelfi, ami vonzza a generációkat, és személyiségzavarokat is okozhat. Célkitűzések: Jelen felmérés célja a fiatalok szelfikészítési szokásainak feltérképezése, illetve annak vizsgálata, hogy milyen kapcsolat van és önimádat, a narcisztikus hajlam és a szociális megfelelés között. Módszerek és eszközök: 18 és 28 év közötti fiatalok Facebook-profiljait elemezve azt vizsgálom, hogy milyen gyakran töltenek fel szelfiket, hol készítik, mi azok üzenete, illetve menyire népszerű a profil maga. Inkább szelfiket töltenek fel, csoportképeket posztolgatnak, vagy csak kapcsolat fenntartására használják a közösségi oldalt. 50 Facebook-profilt analizálok. Kitöltetem a felhasználókkal a szociális megfelelés kérdőívet (Stöber 2001) és az önimádati skálát (Rózsa és Komlósi 2014, illetve az Urbán és munkatársai (2014) által készített, részben eltérő fordítást). A kitöltőket két csoport osztom. Egyik csoportban lesznek azok a fiatalok, akik sokat szelfiznek, a másik csoportban azok a fiatalok, akik másfajta tartalmakat osztanak meg a Facebookon. Eredmények: Varható eredményként arra számítok, hogy akik többet szelfiznek, magasabb pontszámot érnek el az önimádat és a szociális megfelelőség skálákon. Következtetés: Fontos lenne olyan kampányokat és prevenciós programokat kidolgozni, amik arra figyelmeztetik a serdülőket, hogy milyen veszélyei lehetnek a szelfiknek, illetve hogy ehhez személyiségzavar is társulhat, még ha nem is tudunk róla.",
    "keywords": [],
    "generated_keywords": [
      "Facebook-profiljait elemezve azt vizsgálom",
      "Facebookon",
      "Jelen",
      "Módszerek",
      "Rózsa és Komlósi 2014"
    ]
  },
  {
    "major": "Egészségmagatartás",
    "year": 2017,
    "title": "A gyógyszermellékhatások bejelentésére vonatkozó ismeretek a laikusok körében",
    "students": [
      {
        "name": "Nyulas Kinga Ilona",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Krizbai Tímea",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: Egy korábbi kutatásunk során a romániai Gyógyszerügynökséghez 2005 és 2014 között bejelentett mellékhatásesetek (mennyiségi) elemzését végeztük el, megfigyelve, hogy az Európai Gyógyszerügynökség által 2012-ben életbe léptetett új irányelvek és jogi szabályozások, valamint a hazai hatóság által foganatosított intézményes beavatkozások hogyan befolyásolták ezek számát. Azt tapasztaltuk, hogy hazánkban a gyógyszermellékhatások jelentése számtalan esetben nem történik meg az érintettek tájékozatlansága, bátortalansága, közömbössége vagy időhiánya miatt. Az előző kutatás új kérdéseket vetett fel például arra vonatkozóan, hogy milyen mértékben tekinthető elégségesnek egy nemzetközi irányelv és jogi szabályozás bevezetése ahhoz, hogy javuljon a mellékhatások spontán történő bejelentése. Jelen kutatásunk célja megvizsgálni annak eredményességét, ha a gyógyszermellékhatások bejelentésére vonatkozó ismereteket személyes találkozások során is népszerűsítjük, és nem csak hivatalos forrásokból értesülnek az érintettek a jogi szabályozás létezéséről. Módszerek és eszközök: összehasonlító vizsgálat, 2 hasonló létszámú, gyógyszereket fogyasztó felnőtt laikus személyek csoportja között. Egyik csoport tagjait legalább egyszer személyesen oktattam gyógyszerbiztonság témában. A másik csoport tagjai csak a gyógyszerügynökség által hivatalosan közzétett tájékoztatók, valamint a média útján értesültek a gyógyszerek okozta mellékhatások bejelentésének lehetőségéről. Kérdőívek segítségével próbáltuk felmérni a mellékhatások bejelentésére vonatkozó ismereteket mindkét csoportban. Eredmények: a hivatalos tájékoztatások ellenére a gyógyszermellékhatások bejelentésével kapcsolatos jogokról és elvárásokról még ma sem tudnak sokat a laikusok. Mindez a farmakovigilancia-rendszer hatékony működését akadályozza, és hátráltatja a gyógyszerek előny/kockázat viszonyának nyomon követését. Következtetés: a személyes találkozások alkalmával történt gyógyszerbiztonságra vonatkozó ismertetés növeli az elköteleződést a mellékhatások bejelentése mellett, miután világosabbá vált annak fontossága és a mellékhatások előfordulását megelőző jellege.",
    "keywords": [],
    "generated_keywords": [
      "Bevezetés: Egy",
      "Európai Gyógyszerügynökség",
      "Gyógyszerügynökséghez",
      "Jelen",
      "Kérdőívek"
    ]
  },
  {
    "major": "Egészségmagatartás",
    "year": 2017,
    "title": "A marosvásárhelyi ápolók munkával való elégedettségének vizsgálata",
    "students": [
      {
        "name": "Pataki Tímea",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Sántha Ágnes- Rózsa",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: Az egészségügyi dolgozók a szolgáltatói társadalom egyik legnépesebb csoportját alkotják. Érzelmi megterheltségük, lelki és szakmai kiégésük, mindennapi stresszel való megküzdésük kiemelkedően fontos jelenség hazánkban is, ennek ellenére kevés hasonló vizsgálat született. Kutatásomban az ápolók mentális egészségét és pályaelhagyási szándékát, valamint összességében az ápolói szakma érzékelt presztízsét is vizsgálom. A vizsgálat a magán- és az állami kórházakra egyaránt kiterjed, így betekintést nyerhetünk a két szektor közötti hasonlóságokba és különbségekbe is. Célkitűzések: Vizsgálatom célja a marosvásárhelyi egészségügyben dolgozó segédszemélyzet, a szakápolók és segédápolók szakmai elégedettségének, megbecsültségének, észlelt presztízsének és mentális egészségének vizsgálata. Módszerek és eszközök: Kutatási eszközként egy saját készítésű standardizált kérdőívet használok. Az adatokon leíró és magyarázó statisztikai elemzést végzek az IBM SPSS Statistics statisztikai program segítségével. Vizsgálati mintámban számos helyi magánklinikán dolgozó ápoló, emellett a Megyei Sürgősségi Kórház több osztályának dolgozói, illetve a SMURD és a 2-es számú Poliklinika alkalmazottai tartoznak. Eredmények: Az ápolók észlelt szakmai presztízse jóval alatta marad az orvosokénak. Az állami kórházak alkalmazottai nagyobb fokú munkahelyi megterheltségről, ugyanakkor kisebb mértékű szakmai elégedettségről és megbecsültségről számolnak be, mint a magánklinikákon dolgozók. A régiség növekedésével az ápolók mentális egészsége romlik. A túlterheltség észlelése és a pályaelhagyás gondolata szignifikánsan összefügg. Következtetés: Az, hogy az ápolók milyen érzésekkel érkeznek munkahelyükre, milyen fizikai és érzelmi körülmények között dolgoznak, illetve mennyire éreznek szakmai elégtételt munkavégzésük során, nemcsak saját egészségükre és magánéletükre hat ki, hanem végső soron az egészségügyi intézményben folyó gyógyító munkára is. Ennek értelmében fontos célkitűzés az ápolók munkakörülményeinek javítása.",
    "keywords": [],
    "generated_keywords": [
      "IBM SPSS Statistics",
      "Kutatási",
      "Kutatásomban",
      "Megyei Sürgősségi Kórház",
      "Módszerek"
    ]
  },
  {
    "major": "Egészségmagatartás",
    "year": 2017,
    "title": "A média hatása a gyerekek agresszivitására",
    "students": [
      {
        "name": "Magyari Timea",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Krizbai Timea",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: A filmekben, sorozatokban sokszor jelenik meg erőszak. Az emberek elveszíthetik józan ítélőképességüket, többé nem tudnak különbséget tenni a TV-ben látott és a valóságos világ között. A televízió a gyerekekre gyakorolt hatásában a legaggasztóbb, hogy nagyon sok gyerek válogatás nélkül néz, nézhet bármilyen műsort. Ezért is nevezik a TV-t gyakran „elektronikus bébiszitternek”, „vezetékes drognak”. A médiaszabályozásban a tévétársaságok feladata az, hogy a törvény által meghatározott korhatár- besorolást alkalmazza a műsorokon, a mozifilmeknél ez a Korhatár Bizottság feladata. Ez a besorolás leírja, jellemzi azt, hogy mit tartalmaz az adott műsor, lehetőséget adván a szülőknek eldönteni azt, hogy megfelelő-e az adott műsor a gyereke számára. Célkitűzések: Jelen vizsgálat célja a gyerekek médiafogyasztási szokásainak vizsgálata a szülők prizmáján keresztül, illetve annak kutatása, hogy a gyerekek agresszivitását milyen mértékben befolyásolhatja az agresszív tartalmú rajzfilm. Szintén a kutatásom célja az is, hogy felmérjem azt, hogy a szülők mennyire ismerik a korhatár-besorolásokat, és mennyire veszik figyelembe ezeket. Módszerek és eszközök: A vizsgálati populáció 33 gyerek (6–9 év), akik egy kísérletben vesznek részt. A foglalkozás első felében az egyik csoport agresszív tartalmú, a másik csoport vidám, agresszivitásmentes filmet néz. Ezt követően mindkét csoport külön foglalkozáson vesz részt, és azt figyeljük, hogy a film milyen hatással volt a viselkedésükre. Ugyanakkor minden gyerek szüleivel kérdőívet töltetünk ki, mellyel felmérjük a gyerek otthoni tévé-, internet-, számítógép- és okostelefon-használati szokásait, ugyanakkor felmérjük azt is, hogy a szülők mennyire ismerik a korhatár-besorolásokat, és ezek mennyire befolyásolják abban, hogy a gyereküknek mit engednek nézni, játszani. Eredmények: A várható eredmény az, hogy az agresszív film nézése hatással van a gyerekek viselkedésére, ugyanakkor agresszív viselkedést is kiválthat bennük. Az is várható, hogy a szülők nem veszik figyelembe a korhatár-besorolásokat, tehát gyerekük bármikor bármit nézhet és játszhat. Következtetés: Fontos, hogy korlátozva legyen az, hogy mit nézhet a gyerek a tévében vagy az interneten, hogy milyen játékokat játszik, mivel ezzel is megelőzhetjük a gyerekekben kialakuló agresszivitást.",
    "keywords": [],
    "generated_keywords": [
      "Ezért",
      "Fontos",
      "Jelen",
      "Korhatár Bizottság",
      "Módszerek"
    ]
  },
  {
    "major": "Egészségmagatartás",
    "year": 2017,
    "title": "Középiskolások biciklizési szokásai három erdélyi városban",
    "students": [
      {
        "name": "Sófalvi Andrea",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 2. év"
      },
      {
        "name": "Kacsó Andrea",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Sántha Ágnes-Rózsa",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: A szabadidő eltöltésének módja a középiskolás fiatalok körében jellemzően a médiafogyasztás és a kortársakkal való szórakozás. Ezek mögött jelentősen elmarad a sport, a mozgás. A naponta és hetente többször testmozgást végző serdülők aránya hosszú ideig alacsony szinten stagnált, majd az utóbbi öt évben valamelyest emelkedett (Barna‒Kiss 2013). Ezek a javuló arányok adják kutatásunk hátterét. Cél: Témánk a középiskolások mozgáskultúráján belül a biciklizési szokások vizsgálata. Marosvásárhelyi, székelyudvarhelyi és csíkszeredai serdülők körében felvett adataink a kerékpározás gyakoriságát, körülményeit, nemek és korcsoportok szerinti különbségeit tárják fel. Módszerek és eszközök: Kutatásunk kérdőíves módszerrel készült, az adatokat standardizált kérdőívvel nyertük. Az adatokon leíró és magyarázó statisztikai elemzést végzünk. Mintánk elemszáma 1751 fő a három városban élő középiskolások közül. Várható eredmények: Az aktív kerékpárosok legtöbbje rendelkezik a kerékpárosok számára kötelezően előírt biztonsági felszerelésekkel, és használja is azokat. Azok, akik az iskolába nem kerékpárral közlekednek, ennek okát elsődlegesen a közúti biciklizés veszélyességében és nehézkességében látják. Következtetés: A kerékpárral közlekedő serdülők alacsony száma nemcsak környezeti, hanem egészségi problémákat is felvet, hiszen a mozgásszegény mindennapok már fiatal kortól kezdődően nagy részben felelősek a népesség rosszabb egészségi mutatóiért. A megvalósult, sikeres külföldi példák alapján egészségnevelő, a kerékpáros közlekedésre buzdító programok dolgozhatók ki, melyekhez jó alapot szolgáltatnak kutatási eredményeink. Továbbá ezek alapján kialakíthatóak valós, a kerékpáros közlekedés feltételeit megteremtő városfejlesztési stratégiák is.",
    "keywords": [],
    "generated_keywords": [
      "Azok",
      "Barna‒Kiss",
      "Marosvásárhelyi",
      "Mintánk",
      "Módszerek"
    ]
  },
  {
    "major": "Egészségmagatartás",
    "year": 2017,
    "title": "Fiatalok ismeretei a szexuális úton terjedő nemi betegségekről",
    "students": [
      {
        "name": "Szabó Evelyn",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Sántha Ágnes",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés A nyugati országok egyre nagyobb hangsúlyt fektetnek a szexuális úton terjedő betegségek megelőzésére, és arra buzdítják a szakembereket – orvosokat, pszichológusokat, tanárokat –, hogy minél aktívabban vegyenek részt a prevencióban. A fiataloknak életében az informális és a formális szexuális oktatás (szexedukáció) kiegészíti egymást. Célkitűzések Jelen vizsgálat célja a középiskolások körében végzett, a nemi betegségekre vonatkozó prevenció hatásának mérése, a valós szükségleteknek megfelelő tájékoztatás és a megelőzés jelentőségének tudatosítása. Módszerek és eszközök A vizsgálati populációt kilencedik osztályos középiskolások, a marosvásárhelyi református kollégium tanulói alkotják. Módszerem az ellenőrzött körülmények között végzett hatásvizsgálat. Ugyanazt a standardizált kérdőívet töltettem ki két, egymáshoz mindenben hasonló osztályban, hogy a diákok előzetes ismereteit felmérjem. Ezek után az egyik osztályban több alkalomból álló tájékoztató és megelőző tevékenységet folytattam a szexuális úton terjedő betegségekről. Végezetül mindkét osztállyal újra kitöltettem az eredeti kérdőívet. Ezzel felmértem, mennyire hatékony a prevenció módszere a szexuális úton terjedő betegségekkel kapcsolatos tudás, tájékozottság gyarapításában, közvetve a tudatos nemi életre való nevelésben, a szexuális egészség védelmében. Eredmények A kilencedikes diákok jelentős része már átélte első szexuális kapcsolatát. Fő tájékozódási csatornáik nem a szüleik vagy a szakemberek, hanem elsődlegesen a média, másodlagosan pedig kortársaik. A korosztályra jellemző, hogy inkább a barátaikkal beszélik meg szexuális élményeiket, mint szüleikkel. A diákok szégyellnek nyíltan beszélni a nemi betegségekről. Ugyanakkor kevés tudásuk van a nemi úton terjedő kórokról, mely tudás a megelőző tevékenységek következtében jelentősen javul. Következtetés Fontos a serdülők informális és formális szexuális oktatása, melyre irányelvek léteznek Európa-szerte. A szexedukációnak helye van az iskolában, az erről való nyílt kommunikáció a nemi egészség megőrzésének alapja lehet.",
    "keywords": [],
    "generated_keywords": [
      "A kilencedikes diákok",
      "Célkitűzések Jelen",
      "Európa-szerte",
      "Fontos",
      "Módszerek"
    ]
  }
]