[
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2018,
    "title": "Humor in Garfield",
    "students": [
      {
        "name": "Kolozsi Szidónia",
        "major": "Sapientia EMTE, Fordító és tolmács, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Imre Attila",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Humor is among the elements that are the most difficult to translate in verbal translations. The purpose of the study is to determine the type of verbal humor used in Garfield and to examine the quality of humorous translation in the Hungarian and English subtitles. The analysis of the study shows that the movie has a special style of humor that makes it unique compared to other comedies. According to my hypothesis, the use of humorous terms today is constantly and continually expanding along with language. Considering my findings, the success of the film lies not only in the specific characteristics of the characters, but in the particular use of verbal humor in the film. The humorous use of language in Garfield makes the film unique. The aspects that dominate in it are verbal irony, verbal satire and self-denigrating humor. This study is intended to help manage the translation of humor difficulties and to expand humor-related theories.",
    "keywords": [],
    "generated_keywords": [
      "English",
      "Garfield",
      "Hungarian"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2018,
    "title": "Komparative Analyse der deutsch—ungarischen Skriptfassung im Film „Fack ju Göhte”",
    "students": [
      {
        "name": "Németh István-Szabolcs",
        "major": "Sapientia EMTE, Fordító és tolmács, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Drd. Kommer Alois",
        "university": "Sapientia EMTE, társult oktató"
      },
      {
        "name": "Dr. Fülöp Ottilia",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Diese Arbeit beschäftigt sich mit der Übersetzung von Filmen, genauer gesagt mit der Synchronisation von Filmen. Der Film der in dieser Arbeit unter die Lupe genommen wird, ist der deutsche Film „Fack ju Göthe“. Erschienen ist der Film am 7. November 2013. Regisseur war: Bora Dagtekin. Das Budgetbetrug 5 Mio. Euro, und der Film brachte 78 Mio. Euro ein. Der Film hat eine Vulgäre Sprachweise die ideal ist um zu studieren, wie dieser Film ins Ungarische übersetzt wurde, denn es ist weit verbreitet, dass die ungarische Sprache ein großes Repertoire an Schimpfwörtern besitzt. Außerdem wird in dieser Arbeit untersucht wie deutscher Slang ins Ungarische übersetzt worden ist. Meine Wahl fiel grade deswegen auf diesen Film, weil es eine Menge Teile gibt, die man untersuchen kann (z.B. die Übersetzungsweise). Meine Hypothese war, dass die ungarische Synchronfassung viel mehr Schimpfwörter benutzen wird, als die Originalfassung, außerdem wird untersucht, ob die ungarische Synchronfassung zeitlich und übersetzungsmäßig in welcher Maße aufeinander abgestimmt wurde. Die Arbeitsmethode ist die Komparation, ich werde versuchen alle markanten Teile mit Sprüchen, Schimpfwörtern usw. aus beiden Fassungen zu extrahieren. Berücksichtigt wird: Übereinstimmung (darunter: Kulturelle, Slang…); Länge der Äußerung und u.a. Wortwitze. Aus der Originalfassung nahm ich nahezu 100 Dialogteile und verglich sie mit der ungarischen Übersetzung. Die Ergebnisse umfassen: die Maße der Vulgarität bezüglich der deutschen bzw. ungarischen Fassung, innerhalb dies über die Schimpfwörter, und u.a. die Qualität der Synchronfassung.",
    "keywords": [],
    "generated_keywords": [
      "78 Mio",
      "Berücksichtigt",
      "Bora Dagtekin",
      "Budgetbetrug 5 Mio",
      "Euro"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2018,
    "title": "The Tools of the Trade: Difficulties of Technical Translation",
    "students": [
      {
        "name": "Rappert Balázs",
        "major": "Sapientia EMTE, Fordító és tolmács, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Our paper discusses the various difficulties a translator may encounter while trying to translate technical texts, especially those dealing with pyrotechnics and the manufacturing of artisanal firework products. Such texts have a complex system of terms and expressions which may prove difficult to understand, let alone translate without a deep understanding of the way these pyrotechnic devices function – even for a professional translator. The first (theoretical) part of our paper focuses on the linguistic characteristics of Languages used for Special Purposes (frequently used as LSP in the paper) and certain methods and strategies of translation which may help make the translator’s work easier, such as corpus-translation, for example. Furthermore, we discuss frequent issues which arise in specific scenarios, such as lack of terms or untranslatability. The second (practical) part of the paper is an analysis of a translated sample-text from George W. Weingart’s Pyrotechnics (a comprehensive guide / manual for professional firework-makers and pyrotechnicians). The translation of the 7-page document was done by a professional translator and during our research, we corrected and analyzed the different terminological, grammatical or contextual mistakes connected to the technical nature of the text, furthermore, provided possible solutions for the correction of these mistakes.",
    "keywords": [],
    "generated_keywords": [
      "George W. Weingart",
      "LSP",
      "Languages",
      "Pyrotechnics",
      "Special Purposes"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2018,
    "title": "English through music and stories",
    "students": [
      {
        "name": "Mihók Helga",
        "major": "Sapientia EMTE, Fordító és tolmács, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "In this thesis I investigate the advantages of using songs and stories in teaching English as a foreign language. My hypothesis is that with songs and stories it is much easier to develop pupils’ foreign language skills in primary school. I analyzed different textbooks used in our educational system, but also books which are optional. I examined the topics and vocabulary of songs and stories. I conducted interviews with ESL teachers from our area: according to their opinion it is much easier to spark children’s attention, to engage their emotions and help their memory by using songs in teaching English. In these interviews I encounter different perspectives regarding the role of stories in language teaching. Teaching languages is more complex than using a song with a given topic. Teachers apply both tools in teaching English and by that they make the whole process funnier and easier.",
    "keywords": [],
    "generated_keywords": [
      "English",
      "I encounter",
      "Teachers"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2018,
    "title": "Myths related to the mother tongue",
    "students": [
      {
        "name": "Bors Gréta",
        "major": "Sapientia EMTE, Fordító és tolmács, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "My project is about myths and attitudes towards the mother tongue in multi- or bilingual environments, especially in Transylvanian communities. Terms such as dialect, attitude, linguistic ideology, linguistic identity, bilingualism, multilingualism, mother tongue, minority languages, etc. will be discussed. On the one hand I am studying three myths related to mother tongue from István Lanstyák’s study entitled General Language Myths. On the other hand I am studying several concepts related to mother tongue and bilingualism. I base my practical part on two online questionnaires. I am studying the Romanian and Hungarian speakers of Transylvania, especially their relationships with their mother tongue and the language of the other party. I made my questionnaires available to several age groups on the internet, more precisely on Facebook.",
    "keywords": [],
    "generated_keywords": [
      "Facebook",
      "General Language Myths",
      "Hungarian",
      "István Lanstyák",
      "Romanian"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2018,
    "title": "Terminological and sociolinguistic aspects of the language of hairdressing",
    "students": [
      {
        "name": "Rudolf Kincső",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "The language of hairdressing is a language for special purposes because it contains many special terms and expressions. Translating these special terms and expressions from the field of hairdressing sometimes proves to be problematic. The development of the language of hairdressing is closely related to the history of coiffure. Thanks to the new styles and new aesthetic interventions, hairdressing has changed significantly from prehistoric times to the present day. Many new tools have appeared and many new styles have evolved, which revolutionized hairdressing. Sometimes code-switching and international words are the best solutions to name the new terms. I analyze the terminological and sociolinguistic aspects of the language of hairdressing. I made interviews with four hairdressers and I made terminological databases (in English, Hungarian and Romanian languages), to see how the vocabulary has developed and continues to evolve in use; how the terminology is incorporated into our mother tongue and how the international words are used in hairdressing.",
    "keywords": [],
    "generated_keywords": [
      "English",
      "Hungarian",
      "Romanian"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2018,
    "title": "Superdiversity and sport: a case study",
    "students": [
      {
        "name": "Szabó Ernő",
        "major": "Sapientia EMTE, Fordító és tolmács, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "In this study, I discuss the effects of superdiversity on sports and sport language. Language and culture are crucial in the construction and enactment of sport, this is why the effects of superdiversity can have a major role in the development of sports and sport language. According to Blommaert, superdiversity refers to a current level of population diversity which is higher, than it was before. The multiculuralism of earlier times has shifted into what we call superdiversity. Superdiversity is characterized by the disappearance of predictability of a migrant or ethnic person’s sociocultural features. With the help of a case study about a local feminine football team, I examined the diversity of individuals from the team by interviewing them, and by examining a recording of their training. The interview and recording shows that superdiversity is present in the language of sport the same way as in culture. Players from different cultural, ethnic and racial backgrounds are able to understand and communicate with each other, despite speaking different languages thanks to the generalizing effect of superdiversity.",
    "keywords": [],
    "generated_keywords": [
      "Blommaert"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2018,
    "title": "Az erdélyi általános iskolások nyelvi normához való viszonyulása",
    "students": [
      {
        "name": "Kalapács Anita-Nóra",
        "major": "Sapientia EMTE, Fordító és tolmács, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Az anyanyelvi képzés, illetve annak hatékonysága sorsdöntő szereppel rendelkezik az oktatási folyamat teljes egészére. Befolyásolja a tanuló összes műveltségi területen nyújtott teljesítményét, az ismeretanyag befogadására, megértésére, illetve elsajátítására való képességét. Mindamellett hogy alapot biztosít mindenfajta kommunikációs helyzetben való aktív részvételnek, formálja a társas érintkezés megnyilvánulásait, ezen kívül egész kultúránk, hagyományaink, történelmünk értékrendszere szövi át. Kutatásomban az erdélyi kisebbségi magyar nyelvű anyanyelvoktatást helyeztem előtérbe. Ennek megfelelően, a tantervben előírt szempontok tükrében vizsgáltam meg egy magyar többségű település általános iskolájában az V, VI, VII, és VIII. osztályos tanulóinak írásos nyelvhasználatát. Célcsoportom összesen 151 személyből áll. Rövid elbeszélő jellegű fogalmazások keretein belül vizsgáltam a tanulók nyelvi megnyilvánulásait, írásbeli kifejezőképességüket, helyesírásukat, illetve azt, hogy a nyelvi norma követelményeinek mennyire tudnak eleget tenni.",
    "keywords": [],
    "generated_keywords": [
      "Kutatásomban",
      "Mindamellett",
      "Rövid",
      "hatékonysága sorsdöntő",
      "helyesírásukat"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2018,
    "title": "Subtitles and quality control",
    "students": [
      {
        "name": "Becze Hunor",
        "major": "Sapientia EMTE, Fordító és tolmács, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "For most people outside the industry, translating is more or less the same as taking a dictionary and retyping the source text in the target language. But is an in-depth knowledge of another language really enough to be a translator? I believe we all disagree. Often, \"outsiders\" cannot see the hard work that translators put into these short sentences just to entertain us. In the background they spend hours and hours thinking, finding the right word, the right abbreviation, fighting against time. In my paper I write about subtitles and quality control. I explain what that really means. What makes a good subtitle good? I focus on the rules, cultural differences, different grammars and all the things that subtitle translators are facing. I also discuss dubbing and fan-subbing. My studies were based on one of the most popular and top rated series of all time, The Big Bang Theory. I compare the official English, Hungarian and Romanian subtitles to see all the possible errors, mistakes, solutions and the art behind it.",
    "keywords": [],
    "generated_keywords": [
      "English",
      "Hungarian",
      "Romanian",
      "The Big Bang Theory"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2018,
    "title": "Rhyme translation",
    "students": [
      {
        "name": "Veress Emese",
        "major": "Sapientia EMTE, Fordító és tolmács, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "What can be common between literary and audio-visual translation? And how are they related to each other? No one would think of rhyme, but in this case it is the link between these two. In my paper I try to link and analyze these two topics in films. Rhyme translation is a genre known to many, but what if it is found in movies? In my project I present two films and an analysis of their corpuses, which are not written in rhyme in the source language but they are translated to Hungarian as such. These two films were translated by two different people, two people with different backgrounds. I also examine the extent to which the quality of translation is influenced by different skills. I look at how much the rhyming translation can be a loss or an advantage in a given situation and what a translator needs to add or omit in order to succeed.",
    "keywords": [],
    "generated_keywords": [
      "Hungarian"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2018,
    "title": "Fröccsöntő gép tervezése és kivitelezése",
    "students": [
      {
        "name": "Boros Albert",
        "major": "Sapientia EMTE, Gépészmérnöki, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Gergely Attila",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjainkban az élet elképzelhetetlen különböző műanyagok nélkül, melyek számos iparágban jelen vannak, mint például a járműiparban, élelmiszeriparban vagy akár szerszámgépiparban. Számos technológia létezik műanyagok feldolgozására, viszont a műanyag termékek jelentős többségét fröccsöntési eljárással készítik. A dolgozat célja egy laboratóriumi fröccsöntő gép tervezése és megépítése. Az általunk tervezett gép fő részeit képezi a polimer megömlesztését és szerszámba való befröccsöntését biztosító fröccsegység és a szerszámzáró egység. A fröccsegység egy hőmérséklet- szabályozó és pneumatikus rendszerrel lesz működtetve, míg a záró egység manuálisan. A tervezési paraméterek mellett figyelembe vettük, hogy a gép megépítése után az egyetem egy laboratóriumában fog helyet kapni, így segítve a diákok megismerkedését a fröccsöntés technológiájával.",
    "keywords": [],
    "generated_keywords": [
      "diákok",
      "helyet kapni",
      "például",
      "szerszámba",
      "viszont"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2018,
    "title": "Hidraulikus présgép tervezése és kivitelezése",
    "students": [
      {
        "name": "Lapohos Örs",
        "major": "Sapientia EMTE, Gépészmérnöki, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gergely Attila-Levente",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A műanyagok megjelenése kevesebb mint 200 éves múltra tekint vissza. Azonban pozitív tulajdonságaiknak (súly, könnyű megmunkálás, alacsony ár) köszönhetően mára már olyan mértékben elterjedtek, hogy a mindennapjaink elképzelhetetlenek műanyagok nélkül. Megtalálhatók a járműgyártásban, szerkezeti elemekben, háztartásokban, vezetékek alapanyagaként, elektronikában stb. A különböző termékek előállítása különböző alapanyagokat feltételez, melyek a műanyag tulajdonságától függően adott megmunkálási/gyártási eljárásokat igényelnek. Ilyen gyártási eljárás a műanyagok préselése, amely esetünkben egy hőre lágyuló műanyagra lesz alkalmazva. A dolgozat célja egy laboratóriumi présgép tervezése. Egy olyan szerkezetet igényel, amelynek főbb elemei: (i) egy nyomást létrehozó elem, jelen esetben egy kézi működtetésű hidraulikus emelő, (ii) a műanyag granulátum melegítésére szolgáló elem, ezáltal lehetővé téve az alapanyag formálását, (iii) a préselési forma.",
    "keywords": [],
    "generated_keywords": [
      "Megtalálhatók",
      "alacsony ár",
      "függően adott megmunkálási",
      "könnyű megmunkálás"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2018,
    "title": "Laboratóriumi polimer sajtoló berendezés tervezése és kivitelezése",
    "students": [
      {
        "name": "Kelemen Mihály Barna",
        "major": "Sapientia EMTE, Gépészmérnöki, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gergely Attila-Levente",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjaink egyik legjelentősebben fejlődő iparága a műanyagipar. Olyan mesterséges úton előállított polimerekről van szó, melyek megtalálhatók az élet számos területén, mint például a háztartásokban, építkezésben, járművekben, valamint az elektronikában is. Nagymértékű elterjedésük a XX. század második felétől indult meg. Felhasználás szerint megkülönböztethetünk hőre lágyuló és hőre keményedő műanyagokat. Feldolgozásuk többféle eljárással történhet, így sajtolással, fröccsöntéssel, valamint extrudálással is. Dolgozatomban egy sajtolási eljárást fogok bemutatni. A szerkezet egy sütőben megfelelő hőmérsékletre felhevített granulátumot fog összepréselni. A préselés manuálisan, egy kétkarú emelő segítségével fog történni. Fontos szerepet játszik a szerszám is, ami a műanyag formáját adja. A modellezés Autodesk Inventor környezetben készült.",
    "keywords": [],
    "generated_keywords": [
      "Autodesk Inventor",
      "Felhasználás",
      "Fontos",
      "Nagymértékű",
      "Napjaink"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2018,
    "title": "Laboratóriumi műanyag daraboló gép tervezése és kivitelezése",
    "students": [
      {
        "name": "Ilyés Attila",
        "major": "Sapientia EMTE, Gépészmérnöki, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gergely Attila-Levente",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatom célja egy műanyag aprítógép megtervezése és kivitelezése, ami segít a műanyag újrahasznosításában, ezáltal megpróbálva segíteni a környezetszennyezés problémáján is. Dolgozatommal egy olyan témát érintek, ami napjainkban egyre több szakterületen elhangzik, és gondot jelent. Ez a hulladék újrahasznosítása, azon belül is a műanyag palackoké (PET). Az általam kivitelezésre szánt gép a folyamat első fázisában játszik fontos szerepet. A már szelektált palackokat segít feldarabolni, felaprítani olyan méretre, hogy egy következő berendezésbe tudjuk felhasználni az aprítógép által előállított őrleményt. Az aprító egy könnyű vázszerkezeten helyezkedik el, egy villanymotor társaságában, aminek a sebességét és nyomatékát egy szíjtárcsás áttéttel alakítom az elvárt paraméterekre. Az aprítást a két tengelyre illesztett kések végzik, amelyek között fogaskerékhajtással valósul meg az erő átadása.",
    "keywords": [],
    "generated_keywords": [
      "PET",
      "meg az erő"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2018,
    "title": "Piezoelektromos kvarckristállyal történő tömegmérés folyadék közegben",
    "students": [
      {
        "name": "Süket L. Hunor",
        "major": "Sapientia EMTE, Mechatronika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Bíró Domokos",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Jelen tudományos diákköri dolgozat a piezoelektromos kvarckristállyal történő tömegmérési módszer alkalmazásának megvalósítását kívánja tárgyalni. A felmerült kérdés megválaszolásának indítékául szolgált, hogy a Sapientia EMTE Marosvásárhelyi Karán a Vékonyrétegek Kutatócsoport munkája során igény mutatkozott a mérési módszer folyadék közegben történő alkalmazására. A piezoelektromos kvarckristály rezonanciafrekvenciájának változását meghatározó kondenzálódott anyagmennyiség és közvetve a rétegvastagság mérése vákuum környezetben jól hasznosítható, nagy pontosságú és jól kidolgozott eljárás a vékonyrétegek növesztési folyamatában. Ezzel ellentétben a nagyobb viszkozitású közegekben, mint például a folyadékban leválasztott bevonatok esetében, a probléma sokkal kevésbé megoldott. A kérdés különböző aspektusainak vizsgálata jelenleg is tudományos dolgozatok tárgyát képezi. Ebben a dolgozatban az eddig elért eredményeket, rendelkezésre álló ismereteket kívánom összegezni, szemléltetni a megoldandó feladatok komplexitását. A módszer alkalmazásában felmerülő nehézségekre is teszek utalást, mindezt az egyetemen végzett mérésekkel is alátámasztva. Végül megoldási és megvalósítási javaslatokat teszek egy, a célnak megfelelő, a kísérletek során jól használható berendezés megvalósítására.",
    "keywords": [],
    "generated_keywords": [
      "Ezzel",
      "Jelen",
      "Sapientia EMTE Marosvásárhelyi Karán",
      "Vékonyrétegek Kutatócsoport",
      "folyadékban leválasztott bevonatok"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2018,
    "title": "Pneumobil elektropneumatikus rendszerének tervezése és kivitelezése",
    "students": [
      {
        "name": "Mátyás Álmos",
        "major": "Sapientia EMTE, Mechatronika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Tolvaly-Roșca Ferenc",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatunk célja egy sűrített levegővel meghajtott autó (pneumobil) motorjának optimális fogyasztását biztosító elektropneumatikus rendszer megalkotása. A pneumatikus végrehajtó és vezérlő elemek megválasztása, majd ezek nagynyomású levegővel való működtetése az elsődleges feladat. A pneumobilverseny futamainak megfelelően alkottuk meg az autót vezérelő algoritmust, majd ebből kiindulva terveztünk egy elektromos áramkört, amely az irányítás logikáját tárolja és végrehajtja. Az irányítási algoritmus végrehajtását egy mikrovezérlő segítségével valósítottuk meg.",
    "keywords": [],
    "generated_keywords": [
      "autót",
      "meg az"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2018,
    "title": "A Niles-féle fogaskerék-köszörűgép korszerűsített profilozó készülékének gyémánthegy-elfordító rendszere",
    "students": [
      {
        "name": "Márton Loránd",
        "major": "Sapientie EMTE, Fejlett Mechatronikai Rendszerek mesteri, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Máté Márton",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "A korszerűsített köszörűkorong-szabályzó berendezésnek a pozicionálás feladatán felül annak is eleget kell tennie, hogy a gyémánthegy tengelye a szabályozott felület merőlegesével minden pillanatban egy adott szöget zárjon. Ezen probléma megfelelő megoldását kerestük, melynek során lehetséges szabályozási módszereket vizsgáltunk meg és hasonlítottunk össze.",
    "keywords": [],
    "generated_keywords": [
      "Ezen",
      "eleget kell",
      "merőlegesével minden",
      "pozicionálás feladatán"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2018,
    "title": "Kültéri Mobilis Robot Platform",
    "students": [
      {
        "name": "Gábor Szabolcs-László",
        "major": "Sapientia EMTE, Számítógépes irányítási rendszerek mesteri, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Brassai Sándor Tihamér",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozatban bemutatom egy kültéri mobilis robot kivitelezéséhez szükséges lépeseket. A téma több területet érint: software, elektronika, és mechanika. A jelenlegi rendszer második körben továbbfejlesztett robot, a dolgozatban összehasonlításra kerülnek a két változat megoldásai, azok előnyei és hátrányai. Alkalmazott technológiák: Xillinx Vivado, MicroBlaze soft core processzor, alacsony szintű hardveres szabályozók implementációja, FPGA, ROS (Robot Operációs Rendszer) és saját hardver integrációja, mechanikus alkatrészek tervezése 3D nyomtatáshoz optimalizálva.",
    "keywords": [],
    "generated_keywords": [
      "3D",
      "Alkalmazott",
      "MicroBlaze",
      "ROS",
      "Robot Operációs Rendszer"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2018,
    "title": "NoSQL Apache Cassandra adatbázis klaszter alkalmazása IoT szenzoradatok és idősorozatok kezelésére",
    "students": [
      {
        "name": "Ferencz Katalin",
        "major": "Sapientia EMTE, Számítástechnika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Domokos József",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Az IoT eszközök elterjedése hatalmas mennyiségű adatbegyűjtésre ad lehetőséget. A hagyományos SQL (Structured Query Language) alapú adatbázis-kezelő rendszerek nem megfelelőek az ilyen típusú adatok tárolására. Ehhez a feladathoz az osztott adatbázis-kezelő rendszerek a legmegfelelőbbek. Az Apache Cassandra egy nyílt forráskódú elosztott adatbázisszerver szoftver, amelyet arra terveztek, hogy nagy mennyiségű adatot tároljon alacsony költségű szervereken, magas rendelkezésre állást szolgáltatva. A Cassandra gossip protokollt használ arra, hogy az osztott rendszert alkotó szerverek információt osszanak meg egymással. Lekérdezőnyelve a CQL. A jelen dolgozatban bemutatom a hagyományos, SQL alapú adatbázis-kezelő rendszerek egy alternatíváját, a NoSQL típusú adatbázis-kezelő rendszereket, összefoglalom ezeknek a rendszereknek a fő típusait, illetve részletesen kitérek az Apache Cassandra nyílt forráskódú elosztott adatbázisszerver telepítésére, konfigurálására és működésére. Mindezek mellett bemutatok egy saját fejlesztésű Raspberry Pi fejlesztőrendszerhez csatolható szenzoradatgyűjtő prototípus áramkört és ennek működését, illetve a Pi4Java API-n alapuló adatgyűjtő Java alkalmazást.",
    "keywords": [],
    "generated_keywords": [
      "Apache Cassandra",
      "Az Apache Cassandra",
      "CQL",
      "Cassandra",
      "IoT"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2018,
    "title": "RF modulokon alapuló helymeghatározás FPGA segítségével",
    "students": [
      {
        "name": "Székely István Zsolt",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Brassai Sándor Tihamér",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A projekt célja egy lokalizálandó eszköz, robot pozíciójának a meghatározása valós időben. A projekt a háromszögelési technikát alkalmazva beméri a távolságot négy rögzített ponthoz képest. A távolság meghatározására DWM 1000 szélessávú RF modulokat alkalmaztam. Mivel az alkalmazott rádiófrekvenciás modul igényel egy vezérlő áramkört, ezért én egy ESP8266-ost modult alkalmaztam ennek vezérlésére. Az általam használt módszer a távolság mérésére a kétoldalú kétutas távolságmérés, valamint ennek egyéb változatai. A dolgozatban megtalálható az általam alkalmazott mérési módszerek részletes leírása, saját, valamint mások által elért eredmények. A mérési eredményeket befolyásolta több tényező is, mint például az, hogy hány rögzített pontú modulhoz mértem a távolságot, milyen környezetben mértem, valamint maguk az eszköznek a beállításai. Az alkalmazásban három vagy négy rögzített, valamint egy mozgó eszköz működik. A kapott eredményeket javítom, valamint egy körkörös háromszögelési technikát alkalmazva meghatározom az eszköz pozícióját. A pozíciót egy újabb szűrő algoritmus segítségével fogom tovább javítani. A számításigényes feladatok egy FPGA alapú áramkörön futnak, mivel ennek az eszköznek megvannak a szükséges erőforrásai ahhoz, hogy valós időben, az új adat érkezése előtt képes legyen kiszámítani a pozíciót. Az FPGA-t és az mikrokontrollert egy soros protokoll segítségével kapcsolom össze. Az FPGA csak a mozgó eszközön található meg.",
    "keywords": [],
    "generated_keywords": [
      "DWM",
      "ESP8266-ost",
      "alkalmazott mérési módszerek",
      "hány rögzített pontú",
      "legyen kiszámítani"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2018,
    "title": "A „lejtőn guruló golyó” rendszer szabályozása adaptív DLQR és DLQG algoritmusok alkalmazásával",
    "students": [
      {
        "name": "Gábor Árpád",
        "major": "Sapientia EMTE, Automatizálás, 4. év"
      },
      {
        "name": "Galaczi László-Alpár",
        "major": "Sapientia EMTE, Automatizálás, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. György Katalin",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozatunk célja az adaptív DLQR és a Kálmán-szűrő kombinációjából összeállított DLQG szabályozási algoritmus alkalmazása az irányítástechnikában ismert „lejtőn guruló golyó” (ball and beam) rendszeren. A szabályozó feladata, hogy a lejtő dőlésszögét úgy változtassa, hogy a rajta guruló golyó egy előírt értékű pozícióban álljon meg. A DLQR szabályozó algoritmust egy már meglévő fejlesztőlapon programozzuk. Ez a szabályozási algoritmus feltételezi a rendszer matematikai modelljének az ismeretét. Az analitikusan meghatározható modell nemlineáris egyenletekkel jellemezhető. Ezért a linearizált matematikai modell paramétereit egy online paraméterbecslő alkalmazásával határozzuk meg, így már alkalmazható az adaptív DLQR szabályozó. Mivel a rendszeren a mérhető állapotok zajosak (vagy nem teljesen mérhetők), így egy Kálmán-szűrő segítségével becsülhetjük a rendszer be és kimenetéből az állapotokat, így már alkalmazható a DLQG szabályozó is. A motor a lejtőhossz közepén van felfüggesztve, így a lejtőt mindkét irányba meg tudjuk dönteni. A lejtő elfordulását (dőlésszögét) a motorba beépített inkrementális adóval, a golyó pozícióját pedig egy a lejtőre elhelyezett, nyomásra érzékeny, membrános szerkezetű, lineáris potenciométerrel mérjük. A dolgozatunkban tanulmányozzuk az online paraméter becslő előnyeit, a DLQR követő szabályozó hangolási módszereit, valamint a Kálmán-szűrő különböző típusainak a tesztelését.",
    "keywords": [],
    "generated_keywords": [
      "DLQG",
      "DLQR",
      "Ezért",
      "Kálmán",
      "Kálmán-szűrő"
    ]
  },
  {
    "major": "Hardverfejlesztések",
    "year": 2018,
    "title": "Az elektrosztatikus tér szerkezete",
    "students": [
      {
        "name": "Kovács Attila",
        "major": "Sapientia EMTE, Számítástechnika, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Kenéz Lajos",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Életünk villamos térben zajlik, emiatt mindennapjaink során gyakran tapasztaljuk ennek jelenlétét. Ez részben köszönhető annak a ténynek, hogy a technikai fejlődés révén ezt a jelenséget sikerült a mi hasznunkra fordítani, és környezetünk zsúfolva van ezt felhasználó eszközökkel, de a természetben megtalálható jelenségek is jelentősen közrejátszanak. Például a légkör felső rétegében elhelyezkedő, pozitív töltéseket tartalmazó ionoszféra és a Föld között állandó villamos tér van jelen. Az ennek következtében a környezetünkben jelen lévő statikus villamos tér a föld felszínén 100-200 V/m körüli térerősségű is lehet. A dolgozat célkitűzése egy párhuzamos fegyverzetpár által létrehozott elektrosztatikus tér ekvipotenciális görbéinek, illetve annak tanulmányozása, hogy milyen torzulások jelentkeznek a széleffektusok miatt a homogén elektrosztatikus tér megfelelő görbéihez képest. Ezt úgy valósul meg, hogy henger (vagy egyéb) alakú vezető és szigetelő anyagokból készült tárgyakat helyezünk el az elektródák között lévő (szigetelő) folyadékba, az elektromos szempontból homogén térrészbe, és kimutatjuk, hogy miként változtatják meg ezek a tárgyak az elektrosztatikus teret.",
    "keywords": [],
    "generated_keywords": [
      "Föld",
      "Például",
      "az",
      "elektrosztatikus teret",
      "hogy henger"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2018,
    "title": "Webböngészőre optimalizált játékmotor nagyméretű RTS játékokhoz",
    "students": [
      {
        "name": "Kántor Zsolt",
        "major": "Sapientia EMTE, Számítástechnika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Kovács Lehel István",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozat egy korszerű webes technológiákat alkalmazó játékmotor fejlesztési folyamatát, felépítését és felhasználási köreit tárgyalja. A Javascript és WebGL alapú szoftver nagy tömegek valós idejű szimulációjára specializálódott, elsősorban stratégiai játékokhoz. A játékműfaj és a nem szokványos platform elvárásainak megfelelően a hangsúly az optimalizált grafikai megoldásokon, robusztus útkeresési algoritmusokon és ágensek közti interakción van. Mindezek mellett a bemutatott szoftverben rejlő piaci lehetőségekre is kitér a dolgozat.",
    "keywords": [],
    "generated_keywords": [
      "Javascript",
      "Mindezek",
      "WebGL",
      "grafikai megoldásokon"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2018,
    "title": "Billentyűzési ritmus alapú másodlagos azonosító modul PHP web alkalmazásokhoz",
    "students": [
      {
        "name": "Ágoston István",
        "major": "Sapientia EMTE, Informatika, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Szabó László-Zsolt",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjainkban a weboldalakon való bejelentkezés rutinossá vált, általában a felhasználó választ egy vagy két jelszót, és ezeket használja, ha regisztráció szükséges. Mindezek ellenére bizonyított, hogy a weboldalakon egyszerű felhasználónév és jelszó párossal bejelentkezni, másodlagos ellenőrzés nélkül, nem biztonságos. Mikor érzékeny adatokat (banki adatbázis, rendőrségi nyilvántartó adatbázis), rendszert kezelünk, minimalizálnunk kell annak az esélyét, hogy egy jogosultságok nélküli külső személy feltörhesse a rendszerünket. Ennek megelőzésére számos módszert alkalmaznak, egyike ezeknek a viselkedési biometrián alapuló azonosítás, mely a felhasználó egyedi viselkedési mintáit elemezve egy másodlagos ellenőrzéssel képes biztonságosabbá tenni a rendszert. Ez a dolgozat a billentyűzési ritmus alapú azonosítással kapcsolatos kísérleteink és eredményeinket tartalmazza. A munka során kialakítottunk egy másodlagos jelszó-ellenőrzési modult, amelyet web alkalmazásokban lehet használni. Az azonosító algoritmusok kutatása során először pár jól bevált algoritmust alkalmazunk, majd ezek közül egyesek eredményén javítani próbálunk előfeldolgozással, illetve módszerek lehetséges kombinálásával. Bár a témát több éve kutatják, teljes sikert még nem könyveltek el ezen a téren, mivel az eddigi rendszerek a csak billentyűzési ritmus alapú azonosítással a megengedettnél nagyobb hibaszázalékkal rendelkeznek. Másodlagos azonosításra, más módszerekkel is kombinálva viszont használhatóak. Célunk egy, az eddigi algoritmusok tesztelésére alkalmaz rendszer kialakítása, a legmegfelelőbb ismert algoritmusok alkalmazása, és mindeközben saját adathalmaz gyűjtése.",
    "keywords": [],
    "generated_keywords": [
      "Mikor",
      "Mindezek",
      "Másodlagos",
      "alkalmaz rendszer kialakítása",
      "ellenőrzés nélkül"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2018,
    "title": "Korai stádiumban levő agytumor felismerése multispektrális MRI felvételekben",
    "students": [
      {
        "name": "Szabó Zsófia",
        "major": "Sapientia EMTE, Számítástechnika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Szilágyi László",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "Napjainkban az agytumor évente több százezer ember halálát okozza. Bizonyított tény, hogy a diagnózis felállítása után átlagosan 14 hónapig él még a beteg. Mivel a tumor korai felismerése a gyógyulás kulcsát jelenti, ezért fontos olyan számítógépes eljárások kidolgozása, melyek az orvosok munkáját segítik. Kutatásom célja egy intelligens és automatikus döntéshozó algoritmus kidolgozása a korai stádiumban lévő agytumor felismerésére és határainak feltérképezésére MRI felvételek alapján. Az algoritmus megvalósításához véletlen döntési erdőket alkalmaztam. Az osztályozást megelőzően a képi adatok hisztogramját egységesítettem egy lineáris transzformációval, valamint statisztikai és textúrajellemzőkkel bővítettem a képpontokat leíró jellemzővektort. Az algoritmus tesztelésére a MICCAI BRATS 2016 adatbázisában közzétett 54 darab, korai stádiumban levő tumort tartalmazó MRI felvételt használtam. Jelenleg az algoritmus a legjobb beállításokkal 80%-os átlagos Dice score értéket tud elérni. További jellemzők előállításával és a felismert tumort szabályosabbá tevő morfológiai utófeldolgozással várhatóan még javítani tudok a pontosságon.",
    "keywords": [],
    "generated_keywords": [
      "Bizonyított",
      "Dice",
      "Jelenleg",
      "MICCAI BRATS 2016",
      "Napjainkban"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2018,
    "title": "Hol vagytok, székelyek? – Adatelemzés és vizualizáció",
    "students": [
      {
        "name": "Rapa Csaba Erik Károly",
        "major": "Sapientia EMTE, Számítástechnika, 3. év"
      },
      {
        "name": "Nagy Albert Tamás",
        "major": "Sapientia EMTE, Számítástechnika, 3. év"
      },
      {
        "name": "Bak Dávid",
        "major": "Sapientia EMTE, Számítástechnika, 3. év"
      },
      {
        "name": "Salamon Evelin Mónika",
        "major": "Sapientia EMTE, Informatika, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Jánosi-Rancz Katalin Tünde",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A dolgozat alapötletét a Csala Dénes által meghirdetett SzékelyData adatvizualizációs pályázat adta. Célunk a Facebookról letöltött, nagyobb székelyföldi településeken született személyek adatainak a tisztítása és vizualizációja. Az adatokat egy több szótárelemből álló vektor alkotja, mely feldolgozás előtt tisztításra szorul a többnyelvűség, ékezetek, túlrészletezettség, rövidítés, fiktív adatok, hibás attribútummal való kitöltés miatt. Ezen adatok tisztítására mutatunk be ötleteket, majd statisztikát számítunk, levonjuk a tanulságot, és különböző módon vizualizáljuk ezeket.",
    "keywords": [],
    "generated_keywords": [
      "Csala Dénes",
      "Ezen",
      "Facebookról",
      "SzékelyData",
      "fiktív adatok"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2018,
    "title": "Féléves csecsemők agyi MRI felvételeinek szegmentálása",
    "students": [
      {
        "name": "Győrgy-Novák László-Zsolt",
        "major": "Sapientia EMTE, Számítástechnika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Szilágyi László",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "A mágneses rezonanciás képalkotás (MRI) a korszerű orvosi diagnosztika egyik alapeszköze, mivel általában jó kontrasztos képeket készít. Tapasztalati úton megállapították, hogy a 6 hónapos csecsemők agyi MRI felvételein a legnehezebb megkülönböztetni egymástól a koponyában jelen levő 3 fő szövettípust: a szürkeállományt, a fehérállományt és a gerincvelő-folyadékot. Amerikában egy nagy horderejű kutatást szerveznek, melynek során a csecsemők agyának fejlődését figyelik meg egy éves korig, és összevetik a későbbiekben kialakuló betegségekkel (pl. autizmus, skizofrénia, stb.). Az agyi szövetek mennyiségének hatékony vizsgálata egy olyan automatikus eljárást igényel, mely képes nagy pontossággal szétválasztani a szövettípusokat. Kutatásom során egy ilyen algoritmust kívánok megvalósítani az MICCAI iSeg-2017 versenyen közzétett hat hónapos csecsemők agyi MRI felvételeinek precíziós kiértékelésére. Az eddigi munkám során megoldottam a következő részfeladatokat: (I) különböző felvételek képpontjainak intenzitás-hisztogramjait egymáshoz igazítottam, ezáltal előkészítettem az adatokat az osztályozáshoz; (ii) osztályozó algoritmusnak ideiglenesen a KNN algoritmust alkalmaztam; (iii) az osztályozás eredményeként kapott szegmenseket medián szűrővel tettem szabályosabbá. A rendelkezésemre álló tíz MRI felvételt az ún. „leave one out\" technikával alkalmaztam tanításra és tesztelésre. Az osztályozási pontosság mindegyik felvételen 75-80% között van. Várhatóan ezen még sokat lehet javítani egy komplexebb osztályozó algoritmus segítségével.",
    "keywords": [],
    "generated_keywords": [
      "Amerikában",
      "KNN",
      "Kutatásom",
      "MICCAI",
      "Tapasztalati"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2018,
    "title": "Képosztályozás Tensorflow-val",
    "students": [
      {
        "name": "Kántor András",
        "major": "Sapientia EMTE, Számítástechnika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Jánosi-Rancz Katalin Tünde",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Az agyunkkal oly egyszerűnek tűnik a látás. Semmi erőfeszítés nem kell az embernek, hogy megkülönböztessen egy oroszlánt egy jaguártól, felismerjen egy embert, vagy akár bizonyos jeleket. Azonban ezek már kihívást jelentenek a számítógépek számára. Egyszerűnek tűnik, ugyanis az agyunk hihetetlenül jó a képek megértésében. Az elmúlt években jelentős fejlődést értek el a gépi tanulás terén ezen problémák megoldása érdekében. Rájöttek, hogy viszonylag pontos eredményeket érhetnek el, hogyha konvolúciós neurális hálót alkalmaznak. Ezek az alkalmazások évről évre egyre nagyobb fejlődést mutatnak. A TensorFlow egy szoftverkönyvtár gépi tanulási algoritmusok leírására és végrehajtására. A TensorFlow roppant flexibilis, széleskörű algoritmusok megvalósítására alkalmas, beleértve sokrétegű neurális háló alkalmazásait, például a beszédfelismerésben, a számítógépi látásban, megjelenítésben, a robotikában, az információ kinyerésben. A projektem képek kategorizálását valósítja meg TensorFlow használatával. Eleinte egyszerű képekkel lesz tanítva a háló, ahol csak a vizsgálni kívánt tárgy van a képen, majd egyre bonyolultabbakkal. Ezeket a betanított hálókat hasonlítja össze, teszteli a hálók eredményességét, pontosságát.",
    "keywords": [],
    "generated_keywords": [
      "Rájöttek",
      "Semmi",
      "TensorFlow",
      "beszédfelismerésben",
      "például"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2018,
    "title": "Adatbányászat és vizualizáció szociális hálókról",
    "students": [
      {
        "name": "Portik Hunor",
        "major": "Sapientia EMTE, Informatika, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Egyed-Zsigmond Előd",
        "university": "INSA, Lyon, egyetemi docens"
      }
    ],
    "content": "Az adatbányászat napjainkban egy igen komoly téma lett, megéri hangsúlyt fektetni eme hasznosnak bizonyuló kutatásra. A válasz a helyzetnek megfelelő adatfeldolgozáson alapul. Első fázisban információt gyűjtünk (adatbányászat), meg kell tisztítanunk azt (feldolgozás), továbbá megfelelően is kell tálalnunk, hogy az érthető és világos legyen az emberek számára (vizualizáció). Jelenleg már léteznek jó megközelítő módszerek arra, hogy helyesen tudjuk kiválogatni és tisztítani az adatokat. Az alapötlet az, hogy az emberek többsége szereti, ha az előtte levő adathalmaz számára nem csak hogy ízlésesen, de ugyanakkor átlátható és követhető módon legyen ábrázolva, hogy grafikusan megjelenve önmagáról „beszélhessen”. A választás elsődlegesen a hazai újságokra esett, amelyekből szeretnénk a legtöbbet kihozni, új perspektívából szemlélni, hogy minél jobban átlátható legyen a tartalom, s az azok közti összefüggés. Egyik ilyen ötlet az ún. „hírátvevő gráf” lenne, amelyen azt vizsgáljuk, hogy melyek azok a helyi hírforrások, amelyek dominánsak, s melyek azok, amelyek idéznek más újságokból, esetleg át is veszik azokat. Összességében különböző nézőpontokból biztosítja a vizuális élmény fokozását, mely által az innovációnk megvilágítja azok jelentőséget.",
    "keywords": [],
    "generated_keywords": [
      "Jelenleg",
      "amelyekből szeretnénk",
      "emberek számára",
      "helyi hírforrások",
      "kell tálalnunk"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2018,
    "title": "Automatikus számítógépes eljárás a diabetikus retinopátia diagnosztizálására és előrehaladottsági állapotának felmérésére",
    "students": [
      {
        "name": "Borsos Bálint",
        "major": "Sapientia EMTE, Automatizálás és alkalmazott informatika, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Szilágyi László",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "Napjainkban 400 millió ember szenved cukorbetegségben, és ez a szám a WHO szerint várhatóan megduplázódik 2030-ig. Sajnos a diabétesz több mechanizmus mentén is vakságot okozhat, ezek a glaukóma és a retinopátia. Ezen dolgozat a retinopátiával együtt járó elváltozásokról (mikroaneurizmák, bevérzések, valamint a lágy- és kemény exudátumok), továbbá az érhálózat, a sárga- és vakfolt feltérképezéséről szól. Jelen kutatás során egy Kowa VX-10 alpha digitális szemfenékkamera képeivel fogok dolgozni, amelyeket az Indian Diabetic Retinopathy Image Dataset (IDRiD) adatbázisból kaptam. Ezen képeket előfeldolgozásnak vetem alá a zajok kiszűrése céljából, majd homogén foltokat keresek a szűrt képeken. Az előfeldolgozás befejeztével osztályozó algoritmusokat fogok használni a különböző anatómiai részek és elváltozások felismerésére. Az algoritmus fejlesztése során a rendelkezésemre álló képek 75%-át tanulásra, 25%-át tesztelésre fogom felhasználni. A program elkészülte után a statisztikai minőség indikátorok minél magasabb eredményeire törekszem, amely az általános szűrővizsgálat érdekében meg kell közelítse a 100%-ot.",
    "keywords": [],
    "generated_keywords": [
      "Ezen",
      "IDRiD",
      "Indian Diabetic Retinopathy Image Dataset",
      "Jelen",
      "Kowa VX-10"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2018,
    "title": "3D emberi modell mozgatása inerciális szenzorok által szolgáltatott adatok feldolgozásával",
    "students": [
      {
        "name": "Simandi Noémi",
        "major": "Sapientia EMTE, Számítástechnika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Vajda Tamás",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A virtuális valóság, a robotika, a játékipar és orvostudomány fejlődésével egyre nagyobb az igény a 3D modellezésre. Ezért elengedhetetlen olyan módszerek kidolgozása, amelyek egyre egyszerűbbé és kezelhetővé teszik ezt a problémát. Léteznek fejlesztői környezetek, ahol már építettek be olyan könyvtárakat, amelyek erre a célra szolgálnak. Ilyen például az Unity, amely platformspecifikus graphics APIt és C# programozási nyelvet használ 2D, 3D játékok és szimulációk programozására. Ebben a dolgozatban egy 3D emberi modell mozgatásán van a hangsúly, inerciális szenzoroktól kapott adatok alapján. Továbbá bemutatásra kerül a quaternion algebra, ennek a sajátosságai és alkalmazásai, illetve egy Unityben programozott 3D karakter megvalósításának és mozgatásának a háttere.",
    "keywords": [],
    "generated_keywords": [
      "3D",
      "APIt",
      "C#",
      "Ezért",
      "Léteznek"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2018,
    "title": "Képfelismerés a böngészőben mély konvolúciós neurális hálózatok használatával",
    "students": [
      {
        "name": "Parajdi Laszlo Francisc",
        "major": "Sapientia EMTE, Informatika és szoftverfejlesztés, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Egyed-Zsigmond Előd",
        "university": "INSA-Lyon, egyetemi docens"
      }
    ],
    "content": "Manapság a képfelismerés nagyon népszerű, amelynek egyik meghatározó tényezője a GPU hardverének fejlesztése volt. Ez oda vezetett, hogy különböző szervezetek és cégek nagy mennyiségű erőforrásokat fektettek be és kutatásokat végeztek az algoritmusok fejlesztése érdekében. A mély konvolúciós neurális haló (CNN) egy különös gráf modell, amely sok tesztelés során jónak minősült, elfogadható teljesítménnyel rendelkezik a képfelismerés és képcímkézés terén. Néha az emberi teljesítményt is felülmúlta egyes területeken belül. A kézzelfogható eredmények: a jó pár számú eszköz és szoftver, amelyek segítségével készíteni, tanítani és futtatni tudunk CNN modelleket. Elkezdeni használni egy ilyen szoftvert néha viszont nagyon bonyolult. Mi próbálunk pillantást vetni a böngészőn belüli környezetre, ahol a JavaScript nyelv a domináns, és a CNN-ek jelen vannak különböző könyvtárakon belül. Munkánk során a JavaScript könyvtárak egyikét vettük vizsgálat alá, választottunk egy kicsi CNN modellt és megmértük, milyen gyorsan és pontosan működik különböző felépítésű gépeken és böngészőkön belül. Készítettünk egy olyan weboldalt, amelynek egyszerű felhasználói felülete van, ahol kiválaszthatunk egy képekkel tele könyvtárat a helyi fájlrendszeren belül, és ezeket a CNN modell segítségével előre meghatározott kategóriákba soroljuk. A kategorizálás során minden egyes kép feldolgozásának a sebességét és pontosságát megmérjük, majd összehasonlítjuk a méréseket, és megmutatjuk az eredményeket. Célunk az, hogy egyszerű megoldást nyújtsunk a képfelismerésre, ahol nincs szükség külön dedikált szoftver telepítésére. Megoldásunkban egy egyszerű böngésző elegendő, és ugyanakkor a képek a felhasználó számítógépén maradnak.",
    "keywords": [],
    "generated_keywords": [
      "CNN",
      "CNN-ek",
      "Elkezdeni",
      "JavaScript",
      "Készítettünk"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2018,
    "title": "Szimulált robotraj vezérlése",
    "students": [
      {
        "name": "Péter Levente",
        "major": "Sapientia EMTE, Számítástechnika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Szántó Zoltán",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A robotraj egy több robotból álló rendszer, amely nagy számú, egyszerű robotokat tartalmaz. Ezek a robotrajok mindig olyan feladatra hivatottak, ami egyetlen robot számára túl nagy kihívás lenne. A robotrajok koordinálása a robot és környezete közötti, illetve a robotok egymás közötti kölcsönhatása figyelembe vételével történik. Ezt kiegészítjük egyes robotok számára specifikus feladattal is, melynek hatása így kiterjed az egész rajra. A dolgozat során a területlefedés problematikáját tanulmányoztuk, ami annyiból áll, hogy a rendelkezésünkre álló robotraj a lehető legnagyobb területeket lefedje anélkül, hogy a csapat elszakadna. Tekintettel arra, hogy a robotraj egy ismeretlen területen halad, figyelembe kell venni a statikus és dinamikus akadályokat is. A robotok kizárólag a saját érzékelőikre támaszkodnak. Minden egyes robot távolságmérések alapján dönti el, hogy miként fog tovább haladni. A robotok érzékelői kétféle távolságot szolgáltatnak. Az egyik az akadályok közelségét adja meg, a másik távolság a robotok egymáshoz viszonyított helyzetét adja meg vektorok formájában. Ezen értékekből állítjuk fel a vonzó és a taszító erőket, amelyek hatására fog a robot mozdulni az eredő vektor irányába. A robotrajt szimulált footbotok alkotják. A robotok közelségszenzorokkal rendelkeznek, amelyeket az akadályok detektálására es kikerülésére használják. Ugyanakkor a robotok a Colored Blob kamera szenzorral is rendelkeznek, ami színeket érzékel, és ez alapján távolságot ad meg a kamera és a detektált színforrás között. A robotokon LED-ek segítségével különböző azonosító színeket állítunk be, melyeket a többi robot kamerája segítségével érzékelne. Az algoritmust az ARGoS szimulációs környezetben teszteltük.",
    "keywords": [
      "robotraj",
      "területlefedés",
      "ARGoS szimulátor "
      
    ],
    "generated_keywords": [
      "Colored Blob",
      "Ezen",
      "Minden",
      "Ugyanakkor",
      "feladatra hivatottak"
    ]
  },
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2018,
  "title": "Jogosulatlan használat észlelése egérmozgás alapján",
  "students": [
    {
      "name": "Réman Krisztina",
      "major": "Sapientia EMTE, Informatika, 3. év"
    },
    {
      "name": "Dénes-Fazakas Lehel",
      "major": "Sapientia EMTE, Számítástechnika, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Antal Margit",
      "university": "Sapientia EMTE, egyetemi docens"
    }
  ],
  "content": "A dolgozat célja a felhasználók folyamatos azonosítása egérmozgás alapján. A viselkedés alapú biometrikus azonosítás egy formáját, az egérdinamikát vizsgálja, amely nem igényel külön hardvert, és képes kiegészítő hitelesítési rétegként működni. A módszer lényege, hogy a rendszer a felhasználó egérmozgásaiból profilt épít, majd egy bináris osztályozó segítségével képes eldönteni, hogy az aktuális egérmozgás egyezik-e a korábbi profillal. Bár az egérdinamika önmagában nem elég biztonságos azonosításhoz, hatékonyan kiegészítheti a hagyományos hitelesítési módszereket.",
  "keywords": [
    "biztonság",
    "viselkedés alapú biometria",
    "egérmozgatás dinamika",
    "azonosítás"
  ],
  "generated_keywords": [
    "géphasználat megfigyelés",
    "felhasználói viselkedés",
    "kiegészítő hitelesítés"
  ]
},
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2018,
  "title": "Szerző ellenőrzése forráskód alapján",
  "students": [
    {
      "name": "Pelok Benedek-Mihály",
      "major": "Sapientia EMTE, Informatika, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Antal Margit",
      "university": "Sapientia EMTE, egyetemi docens"
    }
  ],
  "content": "A dolgozat célja, hogy gépi tanulási módszerek segítségével meghatározza egy forráskód szerzőjét stilisztikai jellemzők alapján. A vizsgálat során olyan programozási szokásokat elemeznek, mint a kulcsszavak használata, változónevek stílusa és megjegyzések gyakorisága. Az így kinyert jellemzők alapján egy osztályozót tanítanak be, amely a programkód szerzőjének azonosítására képes. A dolgozat 81%-os pontossággal mutatja be az alkalmazott módszer hatékonyságát a 2014-es Google Code Jam kódjai alapján.",
  "keywords": [
    "biztonság",
    "programozói stílus",
    "szerző azonosítása",
    "gépi tanulás"
  ],
  "generated_keywords": [
    "kódszerzőség",
    "forráskód elemzés",
    "stílusmintázat"
  ]
},
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2018,
  "title": "Tornagyakorlatok elemzése Kinect segítségével",
  "students": [
    {
      "name": "Nagy Izabella",
      "major": "Sapientia EMTE, Számítástechnika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Vajda Tamás",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    }
  ],
  "content": "A dolgozat célja egy olyan szoftver létrehozása, amely Kinect segítségével képes elemezni a felhasználó által végzett tornagyakorlatokat. A rendszer a mozgást egy referenciamozgással hasonlítja össze, és visszajelzést ad a gyakorlat helyességéről. A hasonlóság mérésére a Dynamic Time Warping algoritmust használták, figyelembe véve a csomópontok helyzetét és a köztük lévő szögeket. Az elemzések szerint a legnagyobb pontosságot a két paraméter kombinációja biztosította. Az eredmény egy tanulni képes szoftver, amely felismeri a mozgást és visszacsatolást ad.",
  "keywords": [
    "Kinect",
    "skeleton",
    "mozgáskövetés",
    "DTW algoritmus",
    "Unity"
  ],
  "generated_keywords": [
    "tornagyakorlat elemzés",
    "testtartás értékelés",
    "mozgás összehasonlítás"
  ]
},
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2018,
  "title": "Járás alapú személyazonosítás mobileszköz segítségével",
  "students": [
    {
      "name": "Fülöp Timea",
      "major": "Sapientia EMTE, Informatika, 2. év"
    },
    {
      "name": "Mille János",
      "major": "Sapientia EMTE, Informatika, 2. év"
    },
    {
      "name": "Németh Krisztián-Miklós",
      "major": "Sapientia EMTE, Informatika, 2. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Antal Margit",
      "university": "Sapientia EMTE, egyetemi docens"
    }
  ],
  "content": "A dolgozat célja a felhasználók azonosítása járási stílusuk alapján, amely viselkedés alapú biometrikus módszer. A járásmintákat mobiltelefonba épített gyorsulásérzékelő és giroszkóp segítségével rögzítették. Az adatokat kétféleképpen szegmentálták: fix hosszúságú szegmensekre, valamint lépésenkénti szegmensekre. Ezekből különböző jellemzőket nyertek ki, amelyek alapján osztályozókat tanítottak be. Az IDNet adathalmazon végzett mérések során az ellenőrző rendszer 97%-os pontosságot ért el.",
  "keywords": [
    "viselkedési biometria",
    "inerciális szenzorok",
    "járás alapú személyazonosítás"
  ],
  "generated_keywords": [
    "mobil alapú azonosítás",
    "járásmintázat elemzés",
    "szenzoros adatfeldolgozás"
  ]
},
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2018,
  "title": "Szimulált robotkar vezérlése Kinect szenzorral",
  "students": [
    {
      "name": "Barabás Levente István",
      "major": "Sapientia EMTE, Számítástechnika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Szántó Zoltán",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    }
  ],
  "content": "A dolgozat célja egy ember-gép interfész kialakítása, amelyben a felhasználó mozgásait Kinect szenzor segítségével érzékelik és vezérlő jelekké alakítják át egy szimulált robotkar számára. A rendszer képes egyszerre vezérelni egy mobilis platformot és egy robotkart, utóbbi referenciaértékeit inverz geometriai számításokkal állítják elő. A megvalósításhoz a KUKA youBot robotmodell szimulációját alkalmazták a V-REP környezetben. A teszt során a felhasználónak egy labirintuson kellett végigvezetnie a robotot és egy tárgyat célba juttatnia.",
  "keywords": [
    "Kinect",
    "KUKA youBot",
    "távvezérlés",
    "human-machine-interface"
  ],
  "generated_keywords": [
    "robotika szimuláció",
    "inverz kinematika",
    "mozgásvezérlés Kinecttel"
  ]
},
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2018,
  "title": "Vending Machines Management System",
  "students": [
    {
      "name": "Bondor Tamás",
      "major": "Sapientia EMTE, Informatika, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Jánosi-Rancz Katalin Tünde",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    }
  ],
  "content": "A projekt célja egy olyan rendszer kifejlesztése, amely segíti a cégeket az árusító automaták nyomon követésében és menedzselésében. A rendszer lehetővé teszi, hogy a felhasználók könnyen elérjék az automatákhoz kapcsolódó információkat: ki, mikor, mivel töltötte fel az automatát, mennyi pénz érkezett be, mennyi a profit. Emellett tárolja a cég alkalmazottainak, irodáinak és leltárának adatait is.",
  "keywords": [
    "tőkekövető rendszer",
    "automaták",
    "menedzselés",
    "nyomon követés"
  ],
  "generated_keywords": [
    "árusító automaták kezelése",
    "profitkövetés",
    "vállalati leltármenedzsment"
  ]
},
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "Tanulmányi, kutatói és szakmai pályázatok kihasználása az erdélyi magyar egyetemisták részéről",
    "students": [
      {
        "name": "Portik Timea",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Vajda András",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Kihasználják-e az erdélyi magyar egyetemisták a pályázati lehetőségeket egyetemeiken vagy éppen a saját egyetemükön kívülieket? Egyáltalán hallottak-e már pályázati lehetőségekről? Melyek az egyetemisták motivációi, és milyen befolyásoló tényezők játszanak közre abban, hogy pályáznak vagy sem? Kutatásom az előbbiekben megfogalmazott kérdésekre kereste a válaszokat az erdélyi magyar egyetemi hallgatókkal kapcsolatban. Nap, mint nap rengeteg információ ér bennünket és a telekommunikáció fejlődésével soha nem tapasztalt lehetőségek nyílnak meg az információszerzés és annak továbbítása terén. Ugyanakkor az oktatás is kezd egyre jobban felzárkózni és teret adni az IT eszközöknek, valamint egyre inkább kitekint a világ fele és kapcsolati lehetőségeket biztosít a diákoknak. Ezért úgy gondolhatnánk, hogy nyilvánvaló, hogy az úgynevezett „információs társadalom” az új készségek és ismeretek elsajátítását feltételezi, ha tagjai élnek, illetve élni kívánnak mindazokkal a lehetőségekkel, amit a technikai és oktatási fejlődések eredményeznek. Mindezek az új ismeretek magukba foglalják, hogy a rendelkezésünkre álló lehetőségek tárházából meg tudjuk találni és esetleg ki tudjuk választani azt, ami minket érdekel. Az, hogy az egyetemisták mennyire élnek a lehetőségekkel és használják fel a rendelkezésükre álló segítségeket a kutatásomból kiderül.",
    "keywords": [],
    "generated_keywords": [
      "Ezért",
      "Kihasználják-",
      "Kutatásom",
      "Melyek",
      "Mindezek"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "Az online médiaműveltség nyomában. A Sapientia EMTE Marosvásárhelyen tanuló diákjainak médiatudatossága.",
    "students": [
      {
        "name": "Szikszai Ibolya-Tünde",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Vajda András",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Információs társadalmunkban egyre nehezebb szelektálnunk, az internet folyton bővülő tartalmai között körülményes megtalálnunk azt, amire valóban szükségünk van. E problémából kiindulva azt a célt tűztem ki, hogy felmérem a Sapientia EMTE Marosvásárhelyen tanuló diákjainak online médiaműveltségét. Egy aktuális képet nyújtok arról, milyen szintű a jövő értelmiségi rétegének médiatudatossága, és rámutatok a tanulók kritikus gondolkodásának mértékére a nagy információáradatban. A Marosvásárhelyen magyarul oktató egyetemek viszonylatában a Sapientia az a hely, ahol különböző szakcsoportok vannak jelen. Felmérésemben különös tekintettel leszek arra, hogy azonos térben milyen méreteket ölt a humán, műszaki és kertész szakcsoportok online médiaműveltsége. Érdekel továbbá, hogy mennyire tudatos azon diákok médiafogyasztása, akik azt tanulják, hogyan készítsenek az online média számára termékeket, programokat vagy marketingeszközöket. Fontos, hogy milyen megértési mechanizmusok érvényesülnek, van-e, aki segítsen, ha elakadnak az információtúltengés miatt. Lényeges szempont az is, milyen mértékben online médiafogyasztók az egyetemisták. Az adatgyűjtést kérdőíves módszerrel végzem a Sapientia EMTE Marosvásárhelyi Karán. Keresztmetszeti vizsgálatom révén összevetem az egyetemisták online médiaműveltségének szintjét nemükkel és szakcsoportjukkal. Várható eredményeim alapján az egyetemisták online médiaműveltségének szintje igen változatos méreteket ölt, valamint magasabb szintű azon diákok médiaműveltsége, akik az online média számára készítenek termékeket. Létfontosságú kiemelnem, hogy a médiaműveltség folyamatos, tehát nem skatulya. A kutatásom egy jelenlegi képet nyújt, amihez képest megfelelő készségek révén a diákok bármikor előreléphetnek, vagy ha nem fejlesztik magunkat, alacsonyabb szintre is kerülhetnek.",
    "keywords": [],
    "generated_keywords": [
      "Fontos",
      "Keresztmetszeti",
      "Lényeges",
      "Létfontosságú",
      "Marosvásárhelyen"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "Internetes csoportok. Kék Bálna internetes játék - városi legenda?",
    "students": [
      {
        "name": "Máté Brigitta",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Vajda András",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A mai internetes világban az emberek egyre több időt töltenek a számítógép, laptop fekete tükre előtt. Itt élik meg azokat a tapasztalatokat, amiket a virtuális világon kívül is megélhetnének. Gondolok itt elsősorban a baráti kapcsolatok kialakítására, különböző csoportokhoz való csatlakozásra és a csoporton belüli kommunikációra, vagy az információszerzésre/informálódásra. Dolgozatom célja, hogy rámutassak a Kék Bálna néven ismert internetes játékhoz/csoporthoz való csatlakozás okaira, ami többek életét vette el, jelentős visszhangot keltve mind a nemzetközi, mind pedig a hazai médiában. Épp ezért kutatási módszeremnek a tartalomelemzést választottam. Dolgozatomban öt magyar és öt román, interneten megjelent hivatalos cikket elemzek. Mivel dolgozatom a Kék Bálna problematikájára akar rámutatni, ennek apropóján az online világ titkos csoportjainak jelenségét vizsgálja. Fontos, hogy megértsük az internet természetét és pszichológiáját, az internet környezetét, ezen belül az online álarcokat, amiket az egyének maguk elé tartva anonimitást élvezhetnek bizonyos csoportokban. Megvizsgálom a csoportdinamikát a kibertérben, azt, hogy mennyire képesek a csoport tagjai a konformitás keretén belül mozogni, emellett pedig, hogy a Kék Bálna esetében a csoportokban a moderátor szerepe mennyire volt elengedhetetlen tényező annak érdekében, hogy a csoporttagok elvégezzék a kiszabott feladatokat. A kérdés az, hogy mennyiben tekinthető pletykának és szóbeszédnek, illetve városi legendának a Kék Bálna?",
    "keywords": [],
    "generated_keywords": [
      "Fontos",
      "Gondolok",
      "Kék Bálna",
      "Megvizsgálom",
      "csoporton belüli"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "Idős emberek digitális kompetenciái",
    "students": [
      {
        "name": "Molnár Edina",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Tőkés Gyöngyvér",
        "university": "Sapentia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatomban a romániai idős személyek internetezési szokásairól és digitális jártasságáról készült vizsgálatom adatait mutatom be. A vizsgálatom feltáró és minőségi jellegű. A célom mindazoknak a kérdéseknek és problémáknak a feltárása, amelyek a romániai idős emberek digitális gyakorlatához fűződnek. Adatgyűjtésemet két idős férfi és három idős nő megkérdezése képezi. Az esetek kiválogatásában törekedtem arra, hogy a nemi megoszlás és lakhely szempontjából változatos eseteket tanulmányozzak. Az öt vizsgált személyből hárman egy vidéki kisvárosban (Székelykeresztúr), egy személy Marosvásárhelyen és egy személy falun (Bálványosváralja) él. Az adatgyűjtés strukturált és félig strukturált beszélgetésekkel készült. Az öt személlyel egy előre elkészített kérdőív alapján strukturált beszélgetést folytattam és kérdőívet töltöttem ki, majd a kérdőívben rögzített adatokat szabad beszélgetésekkel egészítettem ki. A megkérdezett idős személyek elsősorban kapcsolattartásra és saját érdeklődésük kielégítésére használták a számítógépet és az internetet, azonban az élethelyzetek egyedisége a digitális gyakorlatokban is megmutatkozik. Eredményeim összhangban vannak a szakirodalmi ismeretekkel, amely szerint az idős emberek digitális gyakorlatai és műveltsége általában alapfokú. Abban az esetben, ha az idős személyek a fiatalabb családtagok támogatását élvezik, akkor digitális jártasságuk is fejlettebb.",
    "keywords": [],
    "generated_keywords": [
      "Abban",
      "Adatgyűjtésemet",
      "Bálványosváralja",
      "Eredményeim",
      "Marosvásárhelyen"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "Párkapcsolati hiedelmek a fiatalok körében",
    "students": [
      {
        "name": "Heidel Zsuzsa Evelin",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gagyi József",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "Dolgozatom témája a babona fogalmát járja körbe, mivel a tudományos elképzelések ellenére mindenki babonás valamilyen szinten, még akkor is, ha azt állítják, hogy nem. Akarva akaratlanul mindenki a „hatása” alatt van, még akkor is, ha váltig állítja, hogy nem. Bár előfordulhat, hogy nagy jelentőséget nem tanúsít neki, de ott bujkál az, hogy „mi van, ha mégis.” Ebből kiindulva, jogosan merül fel a kérdés, hogy lényegében mi is a babona, és miért hiszünk benne? Dolgozatomban mindamellett, hogy a babona jelentésének magyarázatát írom le, a fő hangsúly a párkapcsolatban megjelenő babonákra tevődik, ami bizonyosságot ad arra a feltételezésre, hogy a technológia világában sem tűntek el a hiedelmek, sőt erősen él a mindennapi kapcsolatainkban anélkül, hogy tudatában lennénk a babonás viselkedésünknek. Hogy hogyan is kapcsolódik a párkapcsolat a babona világához? Mi más lehetne a legkézenfekvőbb, mint a varázslat és a mágia azon világa, amit napjainkban is szerelemnek nevezünk, és ha elveszítjük, akár irracionális cselekvésekre is hajlandóak vagyunk, hogy visszaszerezzük.",
    "keywords": [],
    "generated_keywords": [
      "Akarva",
      "Dolgozatom",
      "babona",
      "hajlandóak vagyunk",
      "irracionális cselekvésekre"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "Online jelenlét",
    "students": [
      {
        "name": "Szabo Erzsébet",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gagyi József",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "Dolgozatom a manikűrös cégek piaci, illetve médiában való kommunikációjáról szól, és azt bontja ki, hogy hogyan és milyen módon reklámozzák nevüket és termékeiket. Dolgozatomban a Pearl Professional Nail System manikűrhöz szükséges kellékeket forgalmazó cég online és a médiában való jelenlétét követtem, illetve Suzie Moskalt, a Nail Career Education néven futó YouTube csatorna vezetőjét, aki egyben hivatásos manikűrös is 30 éve. Kutatásom során arra az eredményre jutottam, hogy online jelenlét nélkül senki sem tudja igazán reklámozni, hirdetni magát a 21. században.",
    "keywords": [],
    "generated_keywords": [
      "Nail Career Education",
      "Pearl Professional Nail System",
      "Suzie Moskalt",
      "YouTube",
      "bontja ki"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "Apple- és Samsung-tulajdonosok fogyasztói motivációjának elemzése",
    "students": [
      {
        "name": "Deák Tímea",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Zsigmond István",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjainkban számtalan vállalat, valamint cég terméke és szolgáltatása harcol a fogyasztók figyelméért. Kutatásomat a vásárlói döntés, a fogyasztói motiváció kérdéskörében végeztem, ezen belül pedig az Apple- és Samsung-tulajdonosok vásárlási motivációinak elemzését, a döntéseik hátterében álló attitűdök feltárását céloztam meg. A fogyasztók vajon saját vagy mások véleményeire támaszkodnak, amikor eldöntik, hogy milyen terméket vagy szolgáltatást kellene használniuk? Vásárolnak-e csak azért, mert az a legújabb, legnépszerűbb termék, vagy inkább azért, mert ténylegesen szükségük van rá és/vagy szeretnék azt? Kutatási eredményeimmel rámutatok arra, hogy a vásárlókat mennyire tudják befolyásolni a neves márkák, a divat és a környezetükben lévők véleménye. A fogyasztók nagyon eltérően határozzák meg a termékekkel és szolgáltatásokkal szembeni igényeiket. Kutatási eredményeim hasznosításaképpen, a márkaválasztás motivációjának hátterére utalva tanácsokat, tippeket fogalmazok meg a fogyasztási cikkek marketingjére vonatkozóan. Ha tudatában vagyunk a különböző fogyasztói csoportoknak a márkaválasztással kapcsolatos jellegzetességeivel, akkor ezáltal eredményes marketingprogramok dolgozhatunk ki a vásárlási tétek kezelése, a bizonytalanság csökkentése érdekében, melynek következtében a kutatási eredményeket felhasználó vállalatok, adott esetben az Apple és a Samsung növelhetik eladásaikat, valamint nagyobb biztonsággal számíthatnak a – most már – jobban megismert fogyasztóik hűségére.",
    "keywords": [],
    "generated_keywords": [
      "Apple",
      "Kutatási",
      "Napjainkban",
      "Samsung",
      "legnépszerűbb termék"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "A zenekari identitás kommunikációja. Esettanulmány a Bori X applikációról",
    "students": [
      {
        "name": "Nagy Rebeka Nóra",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fülöp Otília",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A zene előállításának, terjesztésének és fogyasztásának, valamint a zenéről való gondolkodásnak és kommunikációnak is az egyik legfontosabb eszközévé vált a web 2.0-ának is nevezett új médiahelyzet. A zenekarok számára fontos az értékesítési csatornáiknak a kialakítása és menedzselése; az online szolgáltatások egy része a közösségi média tartalommegosztó szegmense. A zeneipar digitálissá válása a fogyasztóknak kedvezett a zenei anyagok hordozhatóságával és a fájlformátumok átalakulásával. Az utóbbi tette lehetővé a zeneszámokhoz való hozzáféréseket, kialakítva a zenei fogyasztók tudatos vásárlását. Dolgozatom témájának azért választottam egy adott zenei jelenség kutatását és tudományos elemzését, mert érdekel a média és a társadalom kölcsönhatása. A célom, hogy bemutassam a multimediatizálódás folyamatát és azt, hogy ez a folyamat hogyan teszi lehetővé a zenéhez való hozzáférést. Az esettanulmány folyamán egy, a magyar popzene történetében először megjelent alternatív lehetőséget mutatok be: a Péterfy Bori & Love Band 10. évfordulójára készült jubileumi albumhoz tartozó telefonos applikáció lesz a kutatásom témája. Ez alapján ismertetem, milyen alternatív hozzáférés társulhat a kereskedelemhez, akár digitális alkalmazáson keresztül. Kutatásomban fel szeretném tárni, hogy milyen típusú koncepcióval állítja fel a zenekar a kommunikációs stratégiáját. A lehetséges eszközöket, a módszereket és a használt platformokat szeretném bemutatni. Hipotézisem alátámasztásához a tartalomelemzés módszerét alkalmazom, mely során személyes tapasztalati úton nézem meg, és a szakirodalom alapján értékelem a kutatásomat. Az eredményem alapjául szolgálhat további vizsgálatoknak, és esetlegesen a média konvergencia különleges eseteként lehetne tovább tárgyalni.",
    "keywords": [],
    "generated_keywords": [
      "Hipotézisem",
      "Kutatásomban",
      "Péterfy Bori & Love Band 10",
      "jubileumi albumhoz tartozó telefonos",
      "mert"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "Erdélyi magyar egyetemisták színházlátogatási szokásai",
    "students": [
      {
        "name": "Tuzson Kamilla-Lilla",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Vajda András",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A XXI. század számtalan szórakozási lehetőséget kínál az egyetemisták számára. Ezek között említhetjük a kultúra fogyasztásnak azt a formáját, mely szórakozást, kikapcsolódást és tanulást egy időben biztosít: a színházba járást. Ám az internet és a digitális technológia világában, mennyire játszik fontos szerepet a színház napjaink egyetemistái számára? Mit jelent számukra a kultúra, és mennyire játszik fontos szerepet az életükben, illetve szabadidejük eltöltésében? Jelen dolgozatomban ezen témakört járom körül, és az erdélyi magyar ajkú egyetemisták színházlátogatási szokásait és a színházhoz való viszonyulásukat vizsgálom különböző szempontok alapján. Kutatási eredményeimre alapozva egy átfogó képet mutatok be a színházlátogatási szokásokról, valamint rávilágítok a családi háttér, illetve az anyagi helyzet szerepére a színházlátogatási szokások alakulásában. Továbbá megvizsgálom a színházaknak a diákok számára nyújtott lehetőségeit, valamint a színházak által kihasznált online terek minőségét. Végül a kutatásom során feltárt hiányosságok és gyengeségek orvoslására javaslatokat fogalmazok meg.",
    "keywords": [],
    "generated_keywords": [
      "Jelen",
      "javaslatokat fogalmazok meg",
      "század számtalan szórakozási lehetőséget kínál"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "Zenei brandépítés egy példája Marosvásárhelyen",
    "students": [
      {
        "name": "Bereczki Szilárd",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gagyi József",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "A dolgozatom arról a fajta brandépítésről szól, amely a zenei szcénát jellemzi. A tanulmány egy ilyen régiót, várost helyez előtérbe, ami nem más, mint Erdély, és ezen belül Marosvásárhely. Annak ellenére, hogy Marosvásárhelynek nem híres a zenei világa, mint például Bukarestnek, Pécsnek vagy Miskolcnak, mégis megjelenik ez a fajta márkázás. Ebben a kutatásban a példa, amely alapján eredményeket tudok bemutatni a témával kapcsolatosan, az Autostop marosvásárhelyi rockbanda, akik idén ünneplik a zenekar létrejöttének a 35. évfordulóját. Az ő történetük alapján végzem a kutatást, és próbálok eredményt leszűrni. A főbb kutatási kérdések: Hogyan alakult ki a brand? Ez miben segítette őket? Hogyan tartották fent? Hogyan működik jelenleg?",
    "keywords": [],
    "generated_keywords": [
      "Autostop",
      "Bukarestnek",
      "Erdély",
      "Hogyan",
      "Marosvásárhely"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "A példaképválasztás a közösségi médiában",
    "students": [
      {
        "name": "Csáki Csilla",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 1. év"
      },
      {
        "name": "Pap Beáta",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Kovács Barna",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Témánk a közszereplők hatása az Instagram és Facebook (mint a két legnépszerűbb követési funkcióval ellátott közösségi oldal) esetében. Azt a hipotézist szeretnénk igazolni/cáfolni, hogy a mai fiatalok „nem a saját életüket élik”. Mivel kutatásunk a középiskolás és egyetemista fiatalok közötti „hősválasztási” különbségekre is kiterjed, az ezek közötti eltérésekre és változásokra is rámutatunk. Meg akarjuk tudni, hogy társadalmi szempontból milyen jelentősége van a példaképválasztásnak, és ez által a jövőkép kialakításának az influencerek hatása alatt. Ezen belül egy olyan változását is vizsgáljuk a példakép választásának, ami az életkor függvényében történik. Különböző életkorban más és más személyek inspirálhatják az egyéneket, ennek miértjére is rávilágítunk. Kérdőívek segítségével a marosvásárhelyi Református Gimnázium tizenegyedikes és végzős diákjait, valamint ezzel párhuzamosan interneten keresztül a Sapientia (Marosvásárhelyi Kar) diákjait vizsgáljuk. A pontosabb értékelés és következtetés, valamint hitelességvizsgálat miatt 9 középiskolással és 9 egyetemista hallgatóval csoportos beszélgetést tartunk, tehát fókuszcsoportos beszélgetésen kérdezzük őket a példaképeikkel kapcsolatban, a válaszokat rögzítjük, valamint figyelembe vesszük az értékelés során.",
    "keywords": [],
    "generated_keywords": [
      "Ezen",
      "Instagram és Facebook",
      "Marosvásárhelyi Kar",
      "Református Gimnázium",
      "Sapientia"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "Ösvényhasználat Nagyernyében",
    "students": [
      {
        "name": "Lengyel József",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gagyi József",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "Dolgozatom célja, hogy megvizsgáljam a nagyernyei ösvényhasználatot. Az ösvény az egymástól távolabb élő emberek közötti fizikai kapcsolatteremtés legegyszerűbb formája. Kutatási kérdéseim közé tartozik, hogy kik, hogyan és milyen céllal alakították ki és használták az ösvényeket, valamint hogyan befolyásolták az ösvények a mai infrastruktúra kialakulását. A kutatásomat interjúk segítségével végzem, az interjúkban idős emberek számolnak be arról, hogy az ösvényhasználat hogyan történt a hatvanas- hetvenes években. A kapott információkat összevetve a napjaink ösvényhasználati szokásaival vonhatunk le következtetéseket, miért és milyen formában, hogyan változtak és alakultak át az ösvények.",
    "keywords": [],
    "generated_keywords": [
      "hogy kik",
      "hogyan",
      "át",
      "élő emberek"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "Az alkoholizmus társadalmi megítélése az erdélyi magyar hírportálok tükrében",
    "students": [
      {
        "name": "Kolozsi Edina",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fülöp Otília",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Kivonat A kutatásom célja, hogy felmérjem, milyen képet adnak az erdélyi magyar hírportálok az olvasóknak az alkoholizmus betegség koncepciójáról. Kérdésköreimbe tartozik: ki nevezhető alkoholistának; hogyan járulhatunk hozzá ahhoz, hogy valaki kigyógyuljon az alkoholizmusból; hogyan kell kommunikálni a családunkban lévő alkoholfüggővel; valamint, milyen kommunikációs hibák befolyásolják a betegséget. Az első hipotézisem szerint az erdélyi magyar média egyoldalúan egyéni problémaként mutatja be az alkoholizmust. A második hipotézisem: ahogyan a média az alkoholizmusról beszél, az túlmegy a bemutatás keretein és elítélő, kirekesztő diskurzust tanúsít. A kutatás során 6 hírközlési oldalt tanulmányoztam: a Székelyhon, Transindex, Maszol, Marosvásárhelyi Rádió, Erdély Fm és Nőileg hírportálokat. Megvizsgáltam az alkoholizmussal kapcsolatos témák megjelenésének gyakoriságát. Összesen 64 cikket tanulmányoztam. A cikkek tartalomelemzése azt mutatja, hogy a hipotézisek helytállóak. Bár nem a média tehet az alkoholizmus téves megítéléséről, az elemzett cikkek azt mutatják, hogy a média fenntart és/vagy megerősít egy kommunikációs szempontból tarthatatlan képet a betegségről.",
    "keywords": [],
    "generated_keywords": [
      "Erdély Fm",
      "Kérdésköreimbe",
      "Marosvásárhelyi Rádió",
      "Maszol",
      "Székelyhon"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "A Maros megyei parlamenti képviselők online és offline politikai, illetve politikai marketingkommunikációja",
    "students": [
      {
        "name": "Balog Hunor Levente",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Kovács Barna",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A Maros megyei politikai kommunikáció folyamatos fejlődés alatt áll. A politikusok egyre inkább folyamodnak új stratégiákhoz és meggyőzési technikákhoz igénybe véve az újmédia által kínált lehetőségeket. A politikai kommunikáció új tudományterületek segítségével operál és fejlődik. A politikai színpadon Maros megyében teret követel magának a politikai marketing, amely érdekes módon befolyásolja a politikai ígéretek és eredmények közti viszonyrendszert. A dolgozatomban megpróbálok válaszokat találni és újabb kérdéseket feltenni ezzel a témával kapcsolatban, hisz a Maros megyei parlamenti képviselők online és offline politikai és politikai marketingkommunikációját fogom vizsgálni. A kutatásom során megvizsgálom a parlamenti képviselők 2016-os kampányuk során tett ígéreteiknek a relevanciáját a 2017-es évre vonatkoztatva, és ezzel párhuzamosan kielemzem a politikai és marketingkommunikációjuk tartalmát. A kutatásom során két kutatási módszert használok: az interjút és a tartalomelemzést. A kutatásom segítségével megtudhatjuk, hogy jogos-e a következő állítás: A politikai kommunikáció nem az ígéretek teljesítésére koncentrál, hanem azok generálására.",
    "keywords": [],
    "generated_keywords": [
      "Maros",
      "feltenni ezzel",
      "hanem azok generálására",
      "során tett",
      "érdekes módon"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "Marosvásárhelyen tanuló általános iskolások Facebook-használati szokásai",
    "students": [
      {
        "name": "Burian Erika",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok mesteri, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Kósa István",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "A kutatás általános iskolások Facebook-használati szokásaira fókuszál. A kérdésfelvetést az a tapasztalat indította el, hogy a fiatalok nap, mint nap használják a Facebookot, itt posztolják, hogy mi történt velük, hogy érzik magukat, vagy éppen hol vannak, és mivel foglalkoznak. A Facebook vajon befolyásolhatja gondolatmenetünket, érzelemvilágunkat vagy az offline kapcsolatok kialakulását? A vizsgálat célja rálátást nyerni az általános iskolások Facebook-használati szokásaira, a közösségi oldalakkal kapcsolatos attitűdjeikre, valamint arra, hogy mennyi időt használják a Facebookot, és milyen formában. A kutatást kérdőíves módszer segítségével végezzük el Marosvásárhelyen tanuló általános iskolások körében; az eredményeket az SPSS statisztikai program segítségével dolgozzuk fel. A kérdőíves vizsgálat három részből áll: az első részben az általános demográfiai adatokat kérdezzük meg; a második részben a Facebook-használati szokásokat mérjük fel a diákok körében. A kérdőív harmadik részében pedig a Facebookkal kapcsolatos véleményüket vizsgáljuk. A kutatás elkészítését nagymértékben támogatja a 2017 tavaszán elvégzett előkutatás általános iskolások körében; egy kérdőíves vizsgálat 78 fővel, melynek eredményei és tapasztalatai jó kiindulópontot jelentenek a jelenlegi kutatáshoz. Az eredmények tanulságosnak bizonyulnak, bemutatjuk például, hogy a vizsgált populáció fiataljai milyen arányban vannak jelen a közösségi oldalon, és hogyan élik meg azt, illetve, hogy mennyire tartják fontosnak a Facebookot, és mi a véleményük az online térben való ismerkedésről.",
    "keywords": [],
    "generated_keywords": [
      "Facebook",
      "Facebook-használati",
      "Facebook-használati szokásaira",
      "Facebook-használati szokásaira fókuszál",
      "Facebookkal"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "Az önkéntesség motivációs hátterei",
    "students": [
      {
        "name": "Incze-Borbándi Johanna-Mária",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fülöp Lóránd",
        "university": "Sapientia EMTE, társult oktató"
      }
    ],
    "content": "Kivonat Dolgozatom az erdélyi önkéntesség témakörének vizsgálatát/elemzését tűzte ki célul. Az önkéntesség témája fontos kérdés, mert egyre több fiatal (14-25 éves korosztály) vállal önkéntes tevékenységet egy vagy több szervezetnél. Az eddigi kutatások rámutattak, hogy milyen hatása van az önkéntességnek, hogyan hatnak a társadalomra a vállalkozó szellemű egyének és az általuk létrejött események, tevékenységek sorozatai. Több kutatás is foglalkozott már azzal a kérdéskörrel, hogy miért, milyen indíttatásból vállalnak önkéntes munkát bizonyos személyek. Kérdéses viszont, hogy a belső indíttatás, az eltökéltség hogyan jelenik meg a közösségi média felületein, egyáltalán van-e kapcsolat egy önkéntes közösségi felületén kommunikált személyisége és annak a civil szervezetnek az alapértékei között, amelyben az önkéntes tevékenykedik? Ha van, ez az összefüggés miben, hogyan nyilvánul meg? A kérdés vizsgálatára első körben a tartalomelemzés módszerével tervezek kutatást, amikor erdélyi civil szervezetek weboldalait és közösségi felületeit hasonlítom össze a náluk tevékenykedő önkéntesek személyes profiljával. Ezt követően a május–augusztus időszakban Erdély nagyobb városaiban véletlenszerűen kiválasztott civil szervezetek önkénteseivel és vezetőivel fókuszcsoportos beszélgetéseket szervezek. Célom kutatásaimmal az erdélyi önkéntesség mint kommunikációs modell meghatározása, a motiváció, a közösségi média, a szervezet és önkéntese közötti értékcsere, értékátadás, az ismertség és az elismertség közötti összefüggések feltárása. Kutatásommal szeretnék többlettudást adni a kommunikáció tudományához. Tervem, hogy a kutatásom eredményei segíteni fogják a civil szervezetek human erőforrás vagy akár PR-os munkáját abban a tekintetben, hogy mivel, hogyan tud motiválni és megszólítani új vagy régi önkénteseket, valamint rálátást nyer arra, hogy a fiatalok hogyan jelenítik meg az általa képviselt szervezet értékeit, alapelveit. Előadásomban bemutatom a kutatás elméleti és módszertani hátterét.",
    "keywords": [],
    "generated_keywords": [
      "Célom",
      "Előadásomban",
      "Erdély",
      "Kutatásommal",
      "Kérdéses"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "Iskolások digitális kompetenciája a szülői nevelési stílusok tükrében, illetve a fordított szocializáció jelensége a digitális eszközök viszonylatában",
    "students": [
      {
        "name": "Barbócz Zsolt",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Krizbai Timea",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A technológia olyan mértékű fejlődésen ment keresztül az elmúlt évtizedekben, amire nem volt még példa a történelem során. Annak, hogy eszközeink fejlődtek, és nagyobb teret nyertek hétköznapjainkban természetes velejárója, hogy a fiatalok egyre hamarabb lépnek kapcsolatba vele. A gyors léptékű fejlődéssel járt az, hogy azok, akik nem érdeklődtek a technológia iránt, lemaradtak. Mivel a gyerekek egy inger gazdag környezetbe születtek, számukra teljesen megszokott a technológiai eszközök használata. Kutatásomban általános iskolás gyerekek digitális kompetenciáját fogom felmérni, figyelembe véve a szülők nevelési stílusát is. Azzal, hogy jobban belelátunk ebbe, ki tudunk alakítani egy olyan kedvezőbb oktatást, amivel meg tudjuk könnyíteni a gyerekek fejlődését a digitális eszközök kezelésében. Kutatásom által szeretnék egy átfogóbb képet kapni a 10–14 év közötti gyerekek technológiai tudásáról, eszközhasználatáról. A kutatás kitér arra is, hogy a gyerekek milyen nevelésben részesülnek, és ez milyen hatással lehet a digitális eszközökkel való kapcsolatukra. A fordított szocializáció egy önkéntes döntést jelent azzal kapcsolatban, hogy kit utánozunk. Ez alatt azt szeretném megvizsgálni, hogy mennyire jellemző az a folyamat, amely során a gyerekek tanítják szüleiket, nagyszüleiket a digitális eszközök használatára. A történelemben inkább volt megfigyelhető az, hogy az idősebb tanította a fiatalabbat, ám a technológia fejlődésének hatására kialakult egy olyan folyamat, amely során változtak a szerepek. Szeretném megtudni minőségi és mennyiségi módszerekkel, hogy mennyire kimutatható ez a jelenség ebben a korosztályban. Eddigi kutatások kimutatták azt, hogy van olyan térség, ahol a szülők 40%-a a gyerekétől tanul. Kérdés viszont, hogy ez a jelenség megfigyelhető-e a környezetünkben, illetve milyen összefüggés van a gyerek digitális kompetenciája, illetve a fordított szocializáció ezen formája között, továbbá az is, hogy milyen hatása van erre a folyamatra a szülők nevelési stílusának. Kutatásom még kezdeti fázisában tart.",
    "keywords": [],
    "generated_keywords": [
      "Azzal",
      "Kutatásomban",
      "Kérdés",
      "digitális kompetenciája",
      "fordított"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2018,
    "title": "A média hatása a szépségideálra",
    "students": [
      {
        "name": "Szász Kinga",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gagyi József",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "Kutatásom célja megvizsgálni a média hatását a fiatal generáció egészséges életmódról és szépségideálról alkotott képére egy vidéki településen (a szülőfalumban), ami egy hosszabb kutatás része. Egyrészt a követett mintákat elemzem közelebbről, hogy a vidéki lányok szépségideálja és az egészséges életmódról való felfogása mennyire tér el az általánostól/a várositól. Fontos szempont volt számomra, hogy témámban otthonosan mozogjak, olyan témát válasszak, ami aktuális, érdekes úgy számomra, mint a társadalom számára. Egy olyan tényezőről van szó, ami körülvesz minket a mindennapokban, mindenki beszél erről. Nőként, kozmetikai szereket vásárló személyként engem is érdekel a szépség és a szép keresése, és érdekelni kezdett, hogyan alakulnak ki a társadalomban a szépségeszmények és egészség ideáljai, valamint hogyan terjednek. Egyáltalán milyen szerepet kap az emberi életben a szép test, a szép ruha és a divatos viseletek, és mit gondolnak ezekről az emberek. A kutatás elvégzéséhez interjús módszert alkalmazok, kitérek az interjúalanyok azonos és különböző pontjaira, hasonló és eltérő elképzeléseikre a szépségideálról, a szépségápolásról, valamint a tudatos divatstílus kialakítására.",
    "keywords": [],
    "generated_keywords": [
      "Egyrészt",
      "Fontos",
      "aktuális",
      "alkotott képére",
      "hasonló"
    ]
  },
  {
    "major": "Egészség-magatartás",
    "year": 2018,
    "title": "Ápolók munkával való elégedettsége Erdélyben",
    "students": [
      {
        "name": "Gyenes Csenge",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Sántha Ágnes",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Romániában a bérszint és a munkahelyi feltételek olyan alapvető tényezők, amelyek meghatározzák a szakmai élet minőségét, illetve munkával való elégedettségét és hozzájárulnak az elvándorlás melletti döntéshez. Az ápolók elvándorlása szemszögéből figyelemreméltó tényező a külföldön lévő magas fizetések, a jelenlegi anyagi állapottal való elégedetlenség, valamint a család fenntartásának igénye. Az alacsony szakmai életminőség jelentősen hozzájárul az egészségügyi személyzet elvándorlási arányának növekedéséhez. A kutatás célja megvizsgálni az ápolók munkaelégedettségét, hogy melyek azok az elemek, amelyek befolyásolják mindezt. Az ápolók munkaelégedettsége kihat a munkájukra, a betegek ezáltal nem megfelelő vagy jobb minőségű ellátásban részesülnek. Fontos felmérni mindazokat a tényezőket, melyek pozitív vagy negatív irányba befolyásolják az elégedettségüket. A kutatás mérőeszközéül egy standardizált kérdőív, a budapesti Semmelweis Egyetem Egészségügyi Kara által összeállított, Romániára adaptált online és papír alapú változata szolgált. A kérdőív kitöltésének időtartama kb. 30 perc. A kutatás Románia Maros, Hargita, Kovászna, Szatmár és Szilágy megyéire terjed ki.",
    "keywords": [],
    "generated_keywords": [
      "Hargita",
      "Kovászna",
      "Románia Maros",
      "Romániában",
      "Romániára"
    ]
  },
  {
    "major": "Egészség-magatartás",
    "year": 2018,
    "title": "Migrációs hajlandóság és pályaelhagyási szándék az erdélyi egészségügyi ápolók körében",
    "students": [
      {
        "name": "Szász Beáta",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Sántha Ágnes",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: Napjainkban sokszor hallhatunk a migrációról. Különösen súlyos az egészségügyi személyzet (orvosok, szakápolók) külföldi munkavállalása, amely az ország egészségügyi rendszerére rossz hatással van, hiszen létszámhiányt, ennek következtében pedig a dolgozók túlterheltségét okozza. Módszerek: Kutatásom célcsoportja az itthon maradt erdélyi egészségügyi ápolók. Vizsgálatom központi kérdése, hogy ezen személyek mennyire elégedettek munkájukkal, mennyire érzik megbecsülve azt, mekkora körükben a pályaelhagyási, illetve migrációs hajlandóság, és amennyiben vannak ilyen terveik, mivel indokolják azokat. A döntéseik, itthon maradásuk, esetleges migrációs szándékaik okára szeretnék fényt deríteni. Elemzésem alapját a Sapientia EMTE Életminőség Kutatóközpontjának vizsgálata jelenti, melynek keretében standardizált kérdőívet vettünk fel erdélyi magyar és román ápolók körében. Eredmények: Eredményeim arra világítanak rá, hogy a kiégés jeleit mutató ápolók körében nagyobb a pályaelhagyás gondolata. Továbbá aki eddigi életpályáján már gondolt a pályaelhagyásra, illetve a kivándorlásra, annak alacsonyabb a jóllét-szintje és több a depressziós tünete, mint a munkájával elégedett társainak. A pályaelhagyás illetve kivándorlás gondolata a munkahely szakterületével és a munkaköri régiséggel is összefügg. Következtetések: Az egészségügyet érintő létszámhiány és a dolgozói elégedetlenség olyan jelenségek, amelyek a foglalkoztatáspolitika változtatásával mérsékelhetők. Kutatási eredményeim fontos lépést jelentenek az ápolók helyzetének valós, aktuális felmérésében.",
    "keywords": [],
    "generated_keywords": [
      "Eredményeim",
      "Következtetések",
      "Módszerek",
      "Sapientia EMTE Életminőség Kutatóközpontjának",
      "aktuális"
    ]
  },
  {
    "major": "Egészség-magatartás",
    "year": 2018,
    "title": "A Maros megyei felnőtt népesség jólléte",
    "students": [
      {
        "name": "Hajdu Eszter",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák, 1. év"
      },
      {
        "name": "Hegyi Brigitta",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Sántha Ágnes",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés Az erdélyi magyarság rossz közérzetéről gyakran szó esik a hétköznapokban. Ennek egyik feltűnő jele az utóbbi évek, évtizedek nagy arányú kivándorlása. Kutatásunk célja valós, aktuális képet nyújtani a Maros megyei magyarok jóllétéről és az azzal összefüggő tényezőkről. Módszerek és eszközök Elemzésünk alapjául a Hungarostudy-Erdély kérdőív segítségével 2015–2016 során felvett adatokat használjuk, melynek egy kérdéssora a WHO-5 Jóllét (wellbeing) kérdéseit tartalmazza. A minta elemszáma 383 fő. Eredmények A jóllét leginkább a középkorúakra, a nőkre, a társsal élőkre, a jó anyagi helyzetűekre és a vallásos meggyőződést valló felnőttekre jellemző. A jóllétet a legerősebben az anyagi helyzet határozza meg, így a jóllét inkább jellemző a jövedelmükből jól kijövő személyekre, mint a gondokkal küzdő, esetleg eladósodott családok tagjaira. Továbbá a jóllétet jelentősen befolyásolja az, hogy a válaszadó életében előfordultak-e negatív életesemények az elmúlt évben. A jóllét hiánya betegségtünetekkel is összefüggésbe hozható. Következtetések A Maros megyei felnőtt népességben a jóllét meghatározói leginkább anyagi természetűek. Kutatásunk újdonságát az adja, hogy a WHO-5 jóllét kérdéscsoportját első alkalommal kérdezték le az erdélyi magyar népesség egy részének reprezentatív mintáján.",
    "keywords": [],
    "generated_keywords": [
      "Bevezetés Az",
      "Elemzésünk",
      "Ennek",
      "Hungarostudy-Erdély",
      "Következtetések A Maros"
    ]
  },
  {
    "major": "Egészség-magatartás",
    "year": 2018,
    "title": "Mennyire hasznos a Google abban, hogy megtalálja a legjobb kolorektális rákról szóló weboldalakat? Keresztmetszeti vizsgálat",
    "students": [
      {
        "name": "Katona Beata",
        "major": "MOGYE, magyar tagozat, 4. év"
      },
      {
        "name": "Kasza Dalma",
        "major": "MOGYE, magyar tagozat, 4. év"
      },
      {
        "name": "Kiss Konrád-Ottó",
        "major": "MOGYE, magyar tagozat, 4. év"
      },
      {
        "name": "Maior David",
        "major": "MOGYE, román tagozat, 4. év"
      },
      {
        "name": "Hegyessy Loránd",
        "major": "MOGYE, magyar tagozat, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Nădăşan Valentin",
        "university": "MOGYE, Közegészségügyi Tanszék, előadótanár"
      }
    ],
    "content": "Célkitűzés: A tanulmány célja annak kivizsgálása, hogy a kolorektális rákról szóló webhelyek magyar, román és angol nyelvű Google-rangsora megfelel-e az adott webhely hitelességének, teljességének és pontosságának értékelésében. Módszerek: A minta 25 weboldalt tartalmaz mindhárom nyelv esetében. Minden weboldal hitelességét, teljességét és pontosságát két független értékelővel értékeltük. A hitelességet, a teljességet és a pontosságot 0 és 10 közötti skálán pontoztuk. A Pearson vagy Spearman korrelációs tesztet alkalmaztunk a webhelyek Google-rangsora és a megfelelő minőségi pontszámok közötti kapcsolat felmérésére. Eredmények: Ami az angol kolorektális rákos weboldalakat illeti, mérsékelten fordított korrelációt találtunk Google-rangsoruk és teljességi pontszámuk között (Pearson r = -0,4650, p = 0,0192), és nincs összefüggés a Google-rangsor, a hitelesség és a pontossági pontszámok között. Ami a magyar és a román kolorektális rákkal kapcsolatos weboldalakat illeti, a Google rangsora nem korrelált a vizsgált minőségi mutató egyikével sem. Következtetés: a Google-rangsort a kolorektális rákos webhelyek minőségi mutatójaként csak az angol honlapokon lehet felhasználni, és csak a teljességre vonatkoztatva. A böngészőt használó személyeket figyelmeztetni kell arról, hogy szakmai tanácsokat kérjenek a vastagbélrákról felmerült kérdéseik megválaszolására.",
    "keywords": [],
    "generated_keywords": [
      "Ami",
      "Célkitűzés",
      "Google",
      "Google-rangsor",
      "Google-rangsora"
    ]
  },
  {
    "major": "Egészség-magatartás",
    "year": 2018,
    "title": "Elvárható-e, hogy a magyar, román, angol nyelvű, depresszióról szóló magasabban rangsorolt weboldalak hitelesebb, teljesebb és pontosabb információt tartalmazzanak, mint az alacsonyabban rangsoroltak?",
    "students": [
      {
        "name": "Kasza Dalma",
        "major": "MOGYE, magyar tagozat, 4. év"
      },
      {
        "name": "Kiss Konrád-Ottó",
        "major": "MOGYE, magyar tagozat, 4. év"
      },
      {
        "name": "Katona Beáta Kinga",
        "major": "MOGYE, magyar tagozat, 4. év"
      },
      {
        "name": "Maior David",
        "major": "MOGYE, román tagozat, 4. év"
      },
      {
        "name": "Kirchmaier Ádám",
        "major": "MOGYE, magyar tagozat, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Nădășan Valentin",
        "university": "MOGYE, Közegészségtani Tanszék, előadótanár"
      }
    ],
    "content": "Célkitűzés: A tanulmány célja annak kivizsgálása, hogy a depresszióról szóló magyar, román és angol nyelvű, magasabban rangsorolt Google keresési oldalak nagyobb hitelességgel, teljességgel és pontossággal rendelkeznek-e az alacsonyabb rangsorolt webhelyekhez képest. Módszerek: A keresztmetszeti tanulmány 25 magyar, 25 román és 25 angol nyelvű weboldalt tartalmaz, amelyek a depresszióról tájékoztatják az egészségügyi szaktudással nem rendelkező lakosságot. Minden weboldal Google-rangsorát rögzítettük, és a webhelyeket az általánosan elfogadott egészségügyi információ minőségi mutatói alapján értékeltük. A minőségi mutatók a hitelesség, teljesség és pontosság, amelyeket 0-tól 10-ig terjedő skálán pontoztunk. A Pearson vagy a Spearman korrelációs tesztet használtuk fel a webhelyek Google-rangsora és a minőségi pontszáma közötti kapcsolat felmérésére. Eredmények: az angol nyelvű minta közül a Google rangsorai mérsékelten és fordítottan korreláltak a teljességgel (Pearson r = -0,6113, p = 0,0012) és a pontossági pontszámokkal (Pearson r = -0,5159, p = 0,0083); továbbá a magyar nyelvű minta közül a Google rangsorai csak mérsékelten korreláltak a hitelességi pontszámokkal (Spearman r = -0,4231, p = 0,0351). Nem találtunk összefüggést a román nyelvű webhelyek Google-rangsorai és a hozzájuk tartozó minőségi pontszámok között. Következtetés: A legmagasabb rangsorú angol nyelvű weboldalakon a felhasználók valószínűleg jobb minőségű információkat fognak találni a depresszióról. A magyar és román felhasználók számára, akik megbízható weboldalakat keresnek a depresszióról, fontos tudni, hogy a Google-rangsorolás nem tükrözi az egészségügyi honlapok minőségét.",
    "keywords": [
      "egészségorientált magatartás",
      "az egészséggel kapcsolatos információk minősége",
      "depresszió "
    ],
    "generated_keywords": [
      "Célkitűzés",
      "Google"
    ]
  },
  {
  "major": "Egészség-magatartás",
  "year": 2018,
  "title": "Általános egészségműveltség mérése kisgyermekes szülők körében",
  "students": [
    {
      "name": "Szombat Orsolya",
      "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Sántha Ágnes",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    }
  ],
  "content": "A kutatás célja annak vizsgálata, hogy kisgyermekes szülők mennyire tájékozottak a gyermekeiket érintő betegségek, fertőzések és védőoltások terén. Egy online kérdőívet használtak, amelyet egy korábbi standardizált kérdőív alapján állítottak össze és erdélyi környezetre adaptáltak. Az eredmények azt mutatják, hogy a magasabb iskolai végzettségű, illetve egészségügyi képzésben részesült szülők jelentősen tájékozottabbak. A szülők életkora és családszerkezete szintén hatással van az egészségműveltségre. A szülők többsége szakemberekhez fordul kérdéseivel, nem pedig az interneten keres diagnózist.",
  "keywords": [
    "egészségműveltség",
    "szülő",
    "gyermek",
    "védőoltás",
    "megbetegedés",
    "vírus",
    "fertőzés",
    "gyermekorvos",
    "egészségügyi szakember",
    "internetes diagnózis"
  ],
  "generated_keywords": [
    "szülői egészségértés",
    "egészségügyi ismeretek kisgyermekes családokban",
    "orvosi tanácsadás kontra internetes önellenőrzés"
  ]
},
{
  "major": "Egészség-magatartás",
  "year": 2018,
  "title": "A szociális média és egészség kapcsolata",
  "students": [
    {
      "name": "Kacsó Andrea",
      "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Krizbai Tímea",
      "university": "Sapientia EMTE, egyetemi adjunktus"
    }
  ],
  "content": "A kutatás célja annak vizsgálata volt, hogy a közösségi média milyen hatással van a fiatalok mindennapjaira és egészséges életmódjára. Egy saját készítésű online kérdőív segítségével derült ki, hogy bár a fiatalok aktívan használják a közösségi médiát, csak kevesen követnek egészséggel kapcsolatos tartalmakat. Többségük nem az egészséges életmóddal kapcsolatos információk miatt böngészi a közösségi oldalakat, hanem szórakozás céljából. A vizsgálat eredményei szerint a közösségi médiának nincs jelentős hatása az egészségi állapotukra, ugyanakkor sokan fontosnak tartják az egészségtudatos viselkedést és aktívan tesznek is érte szabadidejükben.",
  "keywords": [
    "az egészséggel kapcsolatos információk minősége",
    "gyermekkori elhízás",
    "szociális média",
    "egészség",
    "egyetemisták",
    "befolyásolás"
  ],
  "generated_keywords": [
    "egészségtudatos életmód fiatalok körében",
    "közösségi média használat",
    "egészségkommunikáció online platformokon"
  ]
}


]