[
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2019,
    "title": "Comparative Analysis of Translations in the Field of Pyrotechnics",
    "students": [
      {
        "name": "Rappert Balázs",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "The main focus of our paper consist of the difficulties of translating technical texts about pyrotechnics from English to Hungarian, taking into consideration the scarcity of terms related to the field in the target language. The paper discusses the various aspects of specialized languages, terminology and technical translation, and also details the legal and historical background of fireworks-manufacture as a hobby in Hungary. The latter is exceptionally relevant to this study, since technical jargon (used by individuals who practice pyrotechnics as a hobby, most often illegally) is an almost exclusive source of terminology in the target language. The second part of our paper contains a comparative analysis of the translation of a sample document from George Washington Weingart’s book entitled \"Pyrotechnics\". The document was sent to be translated by two different people: an experienced technical translator with 20 years of experience and an experienced amateur pyrotechnician, familiar with the field. Our paper compares the two translations with regards to their use of terminology, register and how well they convey the general message of the source language text.",
    "keywords": [],
    "generated_keywords": [
      "English",
      "George Washington Weingart",
      "Hungarian",
      "Hungary",
      "Pyrotechnics"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2019,
    "title": "Translanguaging in Teaching English as a Foreign Language",
    "students": [
      {
        "name": "Kalapács Anita",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "This study explores the use of translanguaging as pedagogy in the context of teaching and learning English as a foreign language. When it comes to foreign language teaching, the most discussed and researched group is probably that of first grader pupils (aged 6-7). This study’s target group, however, is made up of young adults who learn English as an additional language at the university. We examined the methods, strategies English teachers use to teach the basics of the language, respectively – and especially focusing on – translanguaging as a strategy in interactions between teachers and students in the classroom. Using audio recordings, we have examined three different teachers’ English language courses (two of each) in the context of a Hungarian university in Târgu Mureș, Romania. The main goal of this study is twofold: on the one hand, to identify the use of Hungarian (L1) and Romanian (L2) in the EFL classes; and on the other hand, to examine the functions served by translanguaging in these cases.",
    "keywords": [],
    "generated_keywords": [
      "EFL",
      "English",
      "English language",
      "Hungarian",
      "L1"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2019,
    "title": "Translating the series \"The Pacific\"",
    "students": [
      {
        "name": "Bálint Tamás",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Imre Attila",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Translating is a difficult task in itself, and it is more than offering a word-for-word rendition of the text from one language to another, especially when we deal with the translation of a TV-series, in which case further challenges may be expected. The TV-series The Pacific showcases an extremely varied set of obstacles, ranging from technical translation, slang, taboo, cultural references to specific abbreviations. We analysed two different Hungarian translations (subtitle and dubbing) of the original American English, enabling us to discover a lot of interesting yet different approaches the translators have taken in certain cases. In our paper we focus on the most problematic terms we found, discussing them in different categories. Our intention is to highlight the best possible way of translating these terms, while revealing possible errors and mistranslations the translators made during their work.",
    "keywords": [],
    "generated_keywords": [
      "American English",
      "Hungarian",
      "The Pacific"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2019,
    "title": "Translation issues in \"Suits\"",
    "students": [
      {
        "name": "Baloga Abigél-Nóra",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Imre Attila",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "While translating TV-series, translators have to focus on different aspects, such as limited number of characters, lip movement, accuracy to mention but a few. Our paper investigates the subtitling and dubbing issues connected to the popular TV-series, Suits. In order to compare the quality of the subtitle – created by amateur subtitlers – and of (most probably professional) dubbing, we divided certain problematic terms into different categories: abbreviations and areas of expertise (law, economics, biology and others). Since Suits presents the life of lawyers, many translation issues derive from various legal terms, but we cannot overlook the importance of other fields either, because each category presents terms that require a certain level of professionalism in exchange for an accurate translation. We aim at presenting the differences between the Hungarian subtitle and dubbing of Suits by discussing both poor renditions and mistranslations, not forgetting to highlight accurate ones as well.",
    "keywords": [],
    "generated_keywords": [
      "Hungarian",
      "Suits",
      "–"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2019,
    "title": "Translation of Fictional Language in the Harry Potter Book Series by J. K. Rowling into Hungarian and Romanian",
    "students": [
      {
        "name": "Jakab-Tatár Edina",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Imre Attila",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "The main topic of our study is the translation of fictional language in the Harry Potter book series (including character names, plants, objects, Latinisms, etc.), comparing the Hungarian and Romanian solutions to the original, but to each other as well.",
    "keywords": [],
    "generated_keywords": [
      "Harry Potter book series",
      "Hungarian",
      "Latinisms",
      "Romanian"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2019,
    "title": "The Big Bang Theory",
    "students": [
      {
        "name": "Sándor Hermina",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Imre Attila",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Abstract The aim of our project is to analyse the Hungarian dubbing of the American sitcom The Big Bang Theory by comparing the English subtitle of the first two seasons with the Hungarian dubbing. First of all, in the theoretical part we will present the history of dubbing along with the history of other audio-visual translations. Secondly, we will give the definitions of the various translation strategies used for a proper and adequate dubbing. Therefore, in the practical part we will analyse in contrast the subtitle of the source text with the Hungarian dubbed version, by focusing on the translation strategies specified in the theoretical part. The classification of terms and phrases will be explained as well. Hence, we will attain a complete and accurate overview on the quality and significance of the Hungarian dubbed version of The Big Bang Theory.",
    "keywords": [],
    "generated_keywords": [
      "American",
      "English",
      "Hungarian",
      "The Big Bang Theory",
      "The aim of our project"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2019,
    "title": "Challenges in Subtitling Castle and Elementary",
    "students": [
      {
        "name": "Koka Alice",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Imre Attila",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Our project’s title is Challenges in Dubbing, “Castle” and “Elementary.” The reason for our choice is that we enjoy TV series, cliff-hangers and crime stories. In our thesis we deal with legal terminology, thus we have analysed the translation of a few legal terms from the original English into Hungarian; more precisely we compare the English subtitle and the Hungarian dubbing. The project started by collecting legal terms from the series Castle and Elementary, then we categorized these terms into two major categories: law and criminalistics. Within these two categories we established sub-categories, such as people, abbreviations, or ranks. We analyse the quality of the Hungarian dubbing in Castle’s Season 1 (ten episodes), completed with four more episodes from the second season, to match Elementary’s Season 1 with 14 episodes.",
    "keywords": [],
    "generated_keywords": [
      "Castle",
      "Castle and Elementary",
      "Challenges in Dubbing",
      "Elementary",
      "English"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2019,
    "title": "The Language of Videogames",
    "students": [
      {
        "name": "Váncza Tibor",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Imre Attila",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "The title of our paper is self-explanatory regarding its content: The Language of Videogames. We explain the rationale of our topic in the introductory part, also offering introductory ideas about videogames. The theoretical part describes types of videogames, the videogame industry and its structure, also dealing with the process of game development. We argue for the importance of terminology in videogames, mentioning the most important translation issues involved, including sexuality and taboo present in videogames. In our research, we have focused on the analysis of data collected from a popular videogame, Watch Dogs 2. We analyse terms organized in various categories, such as slang, taboo and swear words, acronyms and abbreviations. Certain translation techniques and transfer operations are exemplified while translating slang, acronyms and abbreviations, but we also discuss and scale how offensive and vulgar swear and taboo words are in the collected samples. The conclusions of the study prove that videogames have their own market and industry revolving around money, but we also argue that the boundaries of the entertainment industry are blurred.",
    "keywords": [],
    "generated_keywords": [
      "The Language of Videogames",
      "Watch Dogs 2"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2019,
    "title": "Műanyag granulátum előállító berendezés",
    "students": [
      {
        "name": "Kedves Botond-Ferenc",
        "major": "Sapientia EMTE, Gépészmérnöki szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gergely Attila",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjainkban jelentős problémát jelent a műanyagok újrahasznosítása, melynek alapja a szelektív hulladékgyűjtés. A dolgozat célja egy granulátumkészítő gép ismertetése, mely egy műanyag- újrahasznosító gyártósoron alkalmazható. Az újrahasznosítható műanyag egy extruder segítségével polimerszálakká alakul át, és ezeket a szálakat fel kell darabolni, mivel granulátum formában kedvezőbbek a felhasználási területei. A granulátum új alkatrészek gyártásához használható fel különböző technológiák segítségével. Ezt a feladatot hivatott elvégezni a granulátumkészítő gép. A dolgozat ismerteti a berendezés tervezési lépéseit, melyhez társul a 3D modellezés, illetve matematikai számítások. A végeredmény egy olyan költséghatékony berendezés, mely kivitelezhető mind laboratóriumi berendezésként, mind ipari felhasználásra.",
    "keywords": [],
    "generated_keywords": [
      "3D",
      "Napjainkban",
      "kell darabolni"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2019,
    "title": "Laboratóriumi extruder gép tervezése és kivitelezése",
    "students": [
      {
        "name": "Gyárfás Attila",
        "major": "Sapientia EMTE, Gépészmérnöki szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gergely Attila",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A műanyagipar a 21. század egyik leggyorsabban fejlődő iparága. Bár a műanyag-feldolgozás mindössze 200 éve jelent meg, manapság az élet szinte minden területén jelen van. A dolgozat célja egy műanyag extruder berendezés felépítésének és tervezési lépéseinek bemutatása, amely újrahasznosított polimerek feldolgozására is alkalmas. A polimerek újrahasznosításakor a hulladékműanyag-alkatrész darabolás után az extruder gépbe kerül, ami ezt újraolvasztja és átpréseli egy szerszámon egy ún. filamentet, vagyis polimerszálat hozva létre. A polimerszál darabolásával újrahasznosított polimergranulátumot kapunk, melyet fel lehet használni új alkatrészek gyártásához, illetve az alakadó szerszám cseréjével különböző profilú műanyag szál gyártható. A berendezés felépítése hasonló az iparban használt extruder berendezésekéhez, azonban a költségek csökkentése érdekében néhány építőelem eltérő, ilyen például az extruder csiga, ami egy fafúróval van helyettesítve.",
    "keywords": [],
    "generated_keywords": [
      "lehet",
      "melyet",
      "század"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2019,
    "title": "Rubik-kockában fellépő jelenség vizsgálata",
    "students": [
      {
        "name": "Fekete Hunor-József",
        "major": "Sapientia EMTE, Mechatronika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Egyed-Faluvégi Erzsébet",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Manapság már sokan hallottak a Rubik-kockáról mind logikai játékról. Mivel nagy népszerűségre tett szert az évek során, ezért versenyszinten is bevezették. Ez azt vonta maga után, hogy egyre több gyártó jelent meg a piacon, amelyek fejlesztéseket tettek annak érdekében, hogy minél nagyobb élményt nyújtson a felhasználók körében. A Rubik-kocka egy 26 elemből álló logikai játék, mely elemek összerakásával a kocka belsejében egy gömbfelület jön létre. Ez az alakzat biztosítja az oldalak elforgatását, mely oldalak egy kereszthez vannak rögzítve különböző rugóállandóval rendelkező rugók segítségével. A dolgozat célja egy olyan berendezés tervezése és kivitelezése, mellyel meg lehet határozni a kocka elforgatásához szükséges nyomatékot a különböző rugók esetében, és ezáltal ki lehet választani azt a rugót, amely biztosítaná a kocka könnyebb forgatását minimális túllövés mellett. A berendezés villamos részét egy szervomotor, egy áramérzékelő, egy mikrovezérlő és a hozzá tartozó kijelző képezi. A kijelző pontos információt ad az elforgatáshoz szükséges áramerősségekről, mely adatokat felhasználva meg lehet határozni a forgatónyomatékokat.",
    "keywords": [],
    "generated_keywords": [
      "Rubik-kocka",
      "Rubik-kockáról mind logikai",
      "kocka",
      "meg lehet"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2019,
    "title": "Ágaprító gép tervezése és kivitelezése",
    "students": [
      {
        "name": "Hodgyai Norbert",
        "major": "Sapientia EMTE, Gépészmérnöki szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gergely Attila",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A nagymértékű erdőkitermelés és exportálás miatt hazánkban a tüzelőfaárak jelentősen emelkedtek az utóbbi években. Az erdőkitermelésben az ágak és kisebb átmérőjű fák hulladékként jelennek meg, viszont tüzelőanyagként használhatók. Azonban ezek láncfűrésszel vagy körfűrésszel való darabolása nem költséghatékony. A dolgozatban egy olyan gép tervezését mutatjuk be, amellyel gyorsan és egyszerűen elvégezhetjük az ágak és kisebb átmérőjű fák darabolását. A feldarabolt faanyagot szilárd tüzelésű kazánok táplálására használhatjuk. A gép tervezése során figyelembe vett főbb szempontok az egyszerűség, termelékenység, valamint a rendelkezésre álló elemek mellett minél több szabványos alkatrész felhasználása.",
    "keywords": [],
    "generated_keywords": [
      "amellyel gyorsan",
      "elemek mellett",
      "termelékenység",
      "viszont"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2019,
    "title": "Környezetbarát fűtési rendszer tervezése",
    "students": [
      {
        "name": "Kósa Arnold",
        "major": "Sapientia EMTE, Mechatronika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Pásztor Judit",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      },
      {
        "name": "Dr. Sánta Róbert",
        "university": "Szabadkai Műszaki Főiskola, egyetemi adjunktus"
      }
    ],
    "content": "Napjainkban az épületek energiaköltségei között a legnagyobb tételt a fűtés jelenti. A növekvő igények szükségszerűvé tették olyan fűtési alternatívák kidolgozását, amelyek képesek biztosítani az emberek számára a komfort érzetet. Az egyik legjobb megoldás a hőszivattyús fűtés, amely nagy hőenergiájú, de alacsony hőmérsékletű hőforrásokat aknáz ki. A cél egy olyan biztonságos fűtési rendszer tervezése, amely minimális emberi beavatkozással képes automata módon működni, és nem káros a környezetünkre. Ezen dolgozat során egy családi ház két szobájának a fűtése kerül megtervezésre. A helyiségek fűtését egy komposztkazán és az őszi-tavaszi levegő hőenergiáját kihasználó hőszivattyús fűtési rendszer végzi. A dolgozatban kiszámításra kerül az a hőveszteség, amelyet pótolnia kell a fűtési rendszernek. Ehhez szükséges egy úgynevezett fűtési kör, amely folyamatosan hőt ad le a szobákban. A fűtési körhöz csatlakozik a hűtő kör, vagyis egy hőszivattyú, mely fűtésre alkalmassá teszi a hőforrásoktól származó energiát. Az utolsó kör felel a hőenergia szállításáért, itt történik hő felvétele a hőforrásoktól, és elszállítása a hőszivattyúig. A tervezés adatai alapján kerülnek kiválasztásra fűtőberendezés alkatrészei.",
    "keywords": [],
    "generated_keywords": [
      "Ezen",
      "Napjainkban",
      "egy hőszivattyú",
      "hőenergia szállításáért",
      "hőmérsékletű hőforrásokat"
    ]
  },
  {
    "major": "Gépészmérnöki",
    "year": 2019,
    "title": "Aktív pneumatikus felfüggesztés tervezése és vezérlése",
    "students": [
      {
        "name": "Demeter László",
        "major": "Sapientia EMTE, Mechatronika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Forgó Zoltán",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Napjainkban a számítástechnika rohamos fejlődésének köszönhetően a járműipar minden részén hatalmas fejlődés és innováció tapasztalható. A hajtáslánc alakult a leginkább az utóbbi időben, ugyanakkor talán elmondható, hogy a felfüggesztések terén volt a legkevesebb újítás, főleg ami a teherjárműveket illeti. Adottak a jelenlegi fő rugózási és lengéscsillapítási rendszerek, az acélrugós és a pneumatikus, mindkettő a saját előnyeivel és hátrányaival. Ideális lenne tervezni egy olyan felfüggesztést, aminek köszönhetően ötvözni tudnánk a rugós és légpárnás felfüggesztések fő erősségeit, azaz a jó úttartást és egyszerű szerkezetet a terhelhetőséggel, adaptálhatósággal és legfőképp a kényelemmel. Egy ilyen egyszerű szerkezet megtervezése és szabályzása, vezérlése képezi a dolgozat témáját. Tesztkörnyezet megtervezése, matematikai modell felépítése, majd erre szabályzórendszerek tervezése, összehasonlítása, végül pedig az ideális felépítés és a meghajtás elvi terve a főbb érintett témák.",
    "keywords": [],
    "generated_keywords": [
      "Ideális",
      "Napjainkban",
      "járműipar minden",
      "köszönhetően ötvözni"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2019,
    "title": "Intelligens polc",
    "students": [
      {
        "name": "Somai László",
        "major": "Sapientia EMTE, Távközlés szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Domokos József",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Nagy méretű és nagy forgalommal rendelkező raktárak esetében egyre fontosabb szemponttá válik, hogy a készleten lévő termékek számát minél rövidebb idő alatt tudják pontosan meghatározni és követni. Dolgozatom célja egy olyan rendszer kidolgozása, amely automatizálja a raktár polcain lévő termékek számának pontos meghatározását. A polcon elhelyezkedő termékek számát a polcra nehezedő súlyból határozom meg mérőcellák alkalmazásával, a nagy raktár távolságait ESP32 chippel felszerelt WIFI modul segítségével hidaltam át. A WIFI modul UDP-csomagokon keresztül küldi fel a szenzoroktól érkező adatokat egy számítógépen futó UDP szervernek. Az adatok feldolgozása után a kapott információt MySQL adatbázisban tárolom. A felhasználó és az adatbázis között egy Laravel keretrendszerben megírt weboldal teremt interface-t.",
    "keywords": [],
    "generated_keywords": [
      "Dolgozatom",
      "ESP32",
      "MySQL",
      "UDP",
      "WIFI"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2019,
    "title": "Webprogramozás IoT alapú fűtésszabályzó",
    "students": [
      {
        "name": "Rapa Csaba Erik Károly",
        "major": "Sapientia EMTE, Számítástechnika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Bakó László",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjainkban nagyon nagy hangsúlyt fektetünk az energiatakarékosságra, amivel földünk egészségét és saját pénztárcánkat is megóvjuk. Hála a technológiai fejlődésnek, manapság egyre elterjedtebbek az okos otthonok ahol az eszközök egymással tudnak kommunikálni. Ezt hívjuk dolgok internetének melynek rövidítése az IoT (Internet of Things). Dolgozatom okos otthonhoz tartozó fűtésszabályzóról szól. Hőmérsékletszenzorok segítségével hőt és nedvességet tudunk mérni. Ezeket WIFI-n keresztül továbbítjuk egy Raspberry Pi-nek ami az időjárás-előrejelzésekből és a mért adatokból kiindulva döntéseket hoz és szabályozza a fűtő- vagy épp a hűtőrendszert.",
    "keywords": [],
    "generated_keywords": [
      "Hőmérsékletszenzorok",
      "Internet of Things",
      "IoT",
      "Napjainkban",
      "Raspberry Pi-"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2019,
    "title": "Reakció sebességmérő és fejlesztő rendszer",
    "students": [
      {
        "name": "Kovács Attila",
        "major": "Sapientia EMTE, Számítástechnika szak, 3. év"
      },
      {
        "name": "Oláh Kátai Péter",
        "major": "Sapientia EMTE, Számítástechnika szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Vajda Tamás",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bizonyos tevékenységeink igencsak megkövetelhetik, hogy jó koordinációval, reflexidővel, összpontosítással, éberséggel rendelkezzünk, így ezen képességek fejlesztése jó hatással lehet ezen tevékenységeink kimenetére, illetve fizikai vagy akár mentális készségeink javítására. Mindemellett fontos hogy a készségfejlesztés olyan módon történjen, hogy tudjuk azt személyes igényeinkre, környezetünkre szabni, valamint az adott ügyességi szintünkhöz alakítani a nehézségét az elvégzendő műveletsornak, ilyen módon meglévő határainkat feszegetve és kitolva a gyorsabb fejlődés érdekében. Rendszerünk mindezen célkitűzésekkel igyekszik, hogy felhasználójának a lehető legrugalmasabb, legsokoldalúbb felhasználást nyújtsa, hogy minden korosztály használhassa azt termettől, mozgási korlátoktól függetlenül. A megvalósítás során egy szenzorhálózatot hoztunk létre, amely könnyen konfigurálható, illetve egy telefonos applikációval vezérelhető, így lehetővé téve, hogy monitorizálni tudjuk a felhasználó teljesítményét és fejlődését. A vezeték nélküli kapcsolatnak köszönhetően személyre szabható elrendezést, illetve nehézségi szintet biztosít, hogy mindenki megtalálhassa a számára legmegfelelőbb fejlődési ritmust. Arra törekedtünk, hogy az emberek számára könnyen beszerezhető lehessen azáltal, hogy a rendszerkomponensek kiválasztásánál a költséghatékonyságnak nagy jelentőséget tulajdonítottunk. Emellett a rendszer konfigurálását leegyszerűsítettük, és az autonómiáját a lehető legnagyobbra növeltük, hogy a felhasználás se okozzon nehézséget.",
    "keywords": [],
    "generated_keywords": [
      "Mindemellett",
      "felhasználás",
      "ilyen módon meglévő",
      "jó hatással lehet",
      "jó koordinációval"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2019,
    "title": "Az elektromos tér szerkezete",
    "students": [
      {
        "name": "Kovács Attila",
        "major": "Sapientia EMTE, Számítástechnika szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Kenéz Lajos",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Az elektromosság felhasználása napjainkban igencsak széles körben elterjedt, így mindennapi életeink jelentős részét képezi. Ezt az állítást mi sem támasztja alá jobban, mint az a tény, hogy a készülékek, amiket nap mint nap használunk, ennek a jelenségnek a felhasználásával működnek, gondolhatunk itt a számítógépeinkre, okostelefonjainkra, a lakásaink falában elhelyezett vezetékekre, az internetre. Mindezek következményeképpen az elektromos tér körülvesz minket szinte minden pillanatban, abban élünk, viszont ennek ellenére az átlagember igencsak keveset tud erről, illetve ért ennek az alapvető jelenségnek a hátteréről, környezetére gyakorolt hatásáról. Az általunk megvalósított szerkezet célja, hogy az elektrosztatikus térnek a tanulmányozását, megértését könnyebbé tegye az emberek számára különféle vizsgálati és vizualizációs módszerek alkalmazásával. Egy vízzel telt medencében ilyen teret alakítunk ki különféle geometriájú tulajdonságokkal rendelkező kondenzátorlapokkal, majd egy elektródával, amely a teljes teret bejárja, feltérképezzük a kialakult potenciál-eloszlást a medencén belül. Ezután különféle anyagminőséggel és formával rendelkező tárgyakat ebbe a térbe helyezve tanulmányozhatjuk, hogy azok polarizációja révén miképpen módosul a kialakult tér. A potenciál-eloszlás szemléltetésére egy erre a célra fejlesztett, 3 dimenzióban reprezentálni képes szoftver szolgál, ami lehetővé teszi a medencében levő tér közeli, részletes tanulmányozását, ezáltal egy „kézzelfogható” és jól megérthető analógiát nyújtva annak szerkezetére nézve.",
    "keywords": [],
    "generated_keywords": [
      "Mindezek",
      "itt",
      "kialakult",
      "megértését könnyebbé tegye",
      "okostelefonjainkra"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2019,
    "title": "HuGo",
    "students": [
      {
        "name": "Kovács Attila",
        "major": "Sapientia EMTE, Számítástechnika szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Brassai Sándor Tihamér",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Napjainkban a robotika igencsak feltörekvőben van, és mindinkább életünk részét képezi, ilyen módon a lehetőségek igencsak nagy tárházát tárva elénk. Ma már sok területen találhatunk olyan robotokat, amelyek valamilyen funkciót töltenek be annak érdekében, hogy leegyszerűsítsék tennivalóinkat, vagy olyan feladatokat végezzenek el, amikre nekünk nincs időnk vagy lehetőségünk. Mindezek ellenére bizonyos szerepkörök betöltésére, felépítésünkből adódóan, mégis mi, emberek lennénk a legalkalmasabbak, viszont kell találnunk egy módot, hogy helyettesíteni tudjuk magunkat ezeken a területeken. Az emberszerű (humanoid) robotok ilyen módon történő alkalmazása lehetővé tudja tenni ezt számunkra, ha ezen robotoknak a tervezésétől egészen a kivitelezéséig arra törekszünk, hogy a lehető legtöbb emberi képességgel ruházzuk fel azokat, amelyek szükségesek lehetnek. Hogy ez a szemlélet minél több emberhez eljuthasson, a megvalósítás során olyan eszközök és módszerek felhasználását választottuk, amelyek a legtöbbünk számára elérhetőek lehetnek. A HuGo névre hallgató robot tervezésénél ezeket a kritériumokat vettük figyelembe, és úgy alkottuk meg, hogy rendelkezzen az emberi egyensúlyi, látási érzékeléshez hasonló „érzékekkel”, képes legyen emberszerű mozgásformákra, és rendelkezzék mindazon szabadságfokokkal, amelyekkel egy ember is. Mindezt szervomotorok, különféle szenzorok felhasználásával és FPGA alapú vezérléssel valósítottuk meg.",
    "keywords": [],
    "generated_keywords": [
      "HuGo",
      "Mindezek",
      "emberek lennénk",
      "emberi képességgel",
      "ilyen módon"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2019,
    "title": "WIFI meteorológiai állomás",
    "students": [
      {
        "name": "Sólyom Zsolt",
        "major": "Sapientia EMTE, Számítástechnika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Turos László-Zsolt",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjainkban az időjárás tulajdonságainak mérése és megfigyelése igencsak fontos feladattá vált. A mért adatok összességéből képesek leszünk időjárás-előrejelzéseket készíteni. Ehhez csupán az olyan paraméterek mérésére van szükség, mint például a szél iránya és sebessége, a csapadék mennyisége, a légnyomás mértéke, valamint a hőmérséklet és a páratartalom nagysága. A mérési eredményeket szolgáltató állomás egy WIFI-hálózathoz kapcsolódik, amelyen keresztül elér egy adatfeldolgozó szervert. Az adatait a szervernek továbbítja, amely a feldolgozást végzi. A feldolgozás során az állomásban meghatározott idő alatt mért adatokból számtani középarányt számolunk, majd ezt a szerver feltölti egy adatbázisba. Az adatbázisban tárolt adatok megjelenítésére két általam fejlesztett alkalmazás is a rendelkezésünkre áll. Az egyik egy Androidos alkalmazás, amely megjeleníti a mért adatokat, valamint grafikusan is képes ábrázolni azokat. A másik egy Windows asztali minialkalmazás, amely kizárólag a jelenlegi legfrissebb adatok megjelenítésére alkalmas.",
    "keywords": [],
    "generated_keywords": [
      "Napjainkban",
      "WIFI-hálózathoz",
      "Windows",
      "mérésére van szükség",
      "valamint grafikusan"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2019,
    "title": "Quadkopter stabilizálása különböző szabályozók alkalmazásával",
    "students": [
      {
        "name": "Székely István-Zsolt",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Brassai Sándor Tihamér",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "A projekt célja egy négy propelleres drón, quadkopter vízszintes stabilizálása. A projekt keretén belül különböző szabályozási módszerek vannak kipróbálva, mint például PID, kaszkád PID, vagy RST. A quadkopter pillanatnyi orientációja egy inerciális mérőegység segítségével van meghatározva. Az algoritmusok, amelyek szabályozzák a rendszert, egy FPGA lapra vannak feltöltve, mivel bizonyos algoritmusok, mint például az RST, erőforrásigénye nagyobb, ezért egy hagyományos mikrokontroller nem képes adott időtartamon belül elvégezni a műveleteket. A dolgozatban bővebb információt lehet találni a szabályozókkal elért eredményekkel kapcsolatban. A vízszintes stabilizálás befejezése után egy pályakövetési algoritmus lesz beépítve a rendszerbe, melynek segítségével a quadkopter autonóm módon tud egy előírt pályán haladni.",
    "keywords": [],
    "generated_keywords": [
      "PID",
      "RST",
      "autonóm módon",
      "időtartamon belül"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2019,
    "title": "Saját tervezésű, RISC processzor megvalósítása és tesztelése FPGA áramkörön",
    "students": [
      {
        "name": "Nagy Serbán Tünde",
        "major": "Sapientia EMTE, Számítástechnika szak, 2. év"
      },
      {
        "name": "Gáll János",
        "major": "Sapientia EMTE, Számítástechnika szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Bakó László",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjainkban a számítógépek világa rohamosan fejlődik a különböző elemek újratervezésével, optimalizációjával. A processzor a számítógép központi feldolgozó egysége, amely végrehajtja az utasításokat. Több típusú processzort terveztek meg különböző architektúrákkal (Harvard-architektúra, Neumann-architektúra). Mi egy saját tervezésű processzort terveztünk és implementáltunk a Harvard architektúra elveinek felhasználásával. Kutatásunk célja összehasonlítást végezni az eredeti Xilinx PicoBlaze processzor és az általunk megtervezett processzor között a számítási teljesítmény és folyamatvezérlési alkalmazásokhoz való alkalmasság szempontjából. A teszteket benchmark kódok segítségével végezzük, melyek assembly nyelvben íródtak. A tesztelés folyamata: a processzort feltöltjük az FPGA lapra, amelyen van egy analóg- digitál (AD) és egy digitál-analóg (DA) átalakító, amelyeken keresztül jeleket küldünk egy oszcilloszkópnak, majd innen leolvassuk az értékeket.",
    "keywords": [],
    "generated_keywords": [
      "Harvard",
      "Harvard-architektúra",
      "Napjainkban",
      "Neumann-architektúra",
      "Xilinx PicoBlaze"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2019,
    "title": "Autonóm vonalkövető és útvonaltervező mobilis robot tervezése és kivitelezése",
    "students": [
      {
        "name": "Ugrai Márton",
        "major": "Sapientia EMTE, Számítástechnika szak, 4. év"
      },
      {
        "name": "Zsigmond Andor-Attila",
        "major": "Sapientia EMTE, Automatizálás és alkalmazott informatika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Domokos József",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Napjainkban a közlekedés forradalmát éljük. Ez igaz több szempontból is, mivel a technológia rohamos fejlődésével egyre több elektromos hajtású autó jelenik meg a piacon, valamint egyre több gyártót foglalkoztat az önvezető autó fogalma. Valószínűleg ez ihlette a nagyszebeni Continental nevű céget is, amikor 2017 december közepén kihirdette a 2018-as műszaki versenyét. A verseny lényege röviden az volt, hogy a csapatoknak építeniük kellett egy-egy olyan autonóm járművet, ami képes egy vonalat (utat) követni, valamint útelágazások esetében döntéseket hozni egy rövidebb útvonal vagy köztes pontok érintése érdekében, ahol az állomásokat vonalra ragasztott QR-kódok jelölték. Dolgozatunk ezen feladatok teljesítésének során akadt kihívásokat, problémákat és megoldásokat tartalmazza, valamint azt, hogy miként próbáltunk költséghatékonyan olyan robotot építeni, amely eleget tesz a követelményeknek. Bár belátjuk, hogy az általunk használt módszerek csak részben alkalmazhatóak az autóiparban, összességében észrevehető ez a verseny és az autóipart napjainkban foglalkoztató probléma közötti párhuzam.",
    "keywords": [],
    "generated_keywords": [
      "Continental",
      "Napjainkban",
      "QR-kódok",
      "Valószínűleg",
      "alkalmazhatóak az autóiparban"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2019,
    "title": "Mobilis robotszakaszok irányítása",
    "students": [
      {
        "name": "Tordai Lóránd",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 4. év"
      },
      {
        "name": "Nagy Lehel",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Márton Lőrinc",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "Napjainkban a technológia fejlődése lehetővé teszi olyan intelligens eszközök kifejlesztését, amelyek segítségével a járműveket önvezetővé tehetjük. Munkánk során egy önvezető robotautó csapatot alkottunk kisméretű mobilis robotokból laboratóriumi körülmények között. Robotcsapatunk képes önállóan egy sötét alapon lévő világos színnel jelölt pályán haladni egy vezért követve. A robotokra felszerelt lézeres távolságmérő érzékelők segítségével a robotok képesek egymás között konstans előírt távolságot tartani és az ütközéseket elkerülni. A robotcsapat felügyeletére és lokalizációjára egy webalapú szoftvert készítettünk. Továbbfejlesztésként egy képfelismerő algoritmus segítségével meghatározzuk a robotcsapat minden tagjának a helyzetét, lehetővé téve a formációban haladást sávkövetés nélkül is.",
    "keywords": [],
    "generated_keywords": [
      "Munkánk",
      "Napjainkban",
      "egy webalapú"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2019,
    "title": "Számítógép-vezérelt hőgradiens rendszer tervezése és kivitelezése",
    "students": [
      {
        "name": "Zakariás Attila",
        "major": "Sapientia EMTE, Automatizálás szak, 2. év"
      },
      {
        "name": "László Tamás",
        "major": "Sapientia EMTE, Automatizálás szak, 2. év"
      },
      {
        "name": "Krizbai Csaba",
        "major": "Sapientia EMTE, Automatizálás szak, 2. év"
      },
      {
        "name": "Szabó Tamás",
        "major": "Sapientia EMTE, Automatizálás szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Papp Sándor",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Célunk megtervezni és megépíteni egy hőgradiens asztalt, melynek lényege az, hogy egy jó hővezető lemez két végét állandó, egymástól különböző hőmérsékleten tartjuk, ennek következtében lineáris hőeloszlást tudunk létrehozni. A rendszer felhasználói, a kertészmérnökök vagy biológusok az asztal felületére növényi magvakat vagy mikroorganizmus-telepeket helyezhetnek el, amelyeknek a hőmérsékletet leszámítva azonos körülményeket biztosítunk. Az esetenként több hetes folyamatot végigkövetve megkapjuk a számukra optimális fejlődési hőmérsékletet. A berendezés alapját egy 200*100*1 cm-es alumíniumtömb képezi. A tömb egyik felén a fűtést 20 darab fűtőellenállással valósítottuk meg, amelyhez terveztünk egy fázishasító tápegységet. Ennek a fűtő tápegységnek az alapja egy PIC típusú mikrovezérlő, amely a saját fejlesztésű firmware segítségével nagy felbontással vezérelhetővé teszi a pillanatnyi fűtőteljesítményt. A tömb másik feléhez egy réz hőcserélőt rögzítettünk, amelyben egy hőszivattyú-berendezéssel lehűtött kb. -2°C-os folyadékot keringetünk. A hőmérsékletet egy DS1820 típusú érzékelőrendszer segítségével 10 különböző ponton, meghatározott időközönként mérjük, és grafikonon ábrázoljuk. Terveztünk még egy szintén PIC mikrovezérlőn alapuló központi vezérlőegységet, amelyen nyomógombok és egy LCD kijelző segítségével könnyedén beállíthatjuk az asztal két végén a kívánt hőmérsékleteket. Ezt a vezérlőegységet csatlakoztattuk egy számítógéphez, és készítettünk neki egy kezelőfelületet, ezáltal valós időben láthatjuk a hőmérsékletváltozásokat és ellenőrizhetjük az egész berendezés működését.",
    "keywords": [],
    "generated_keywords": [
      "DS1820",
      "PIC",
      "egy hőszivattyú-berendezéssel",
      "lineáris hőeloszlást",
      "meg"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2019,
    "title": "Egérdinamika alapú behatolás-érzékelő rendszer",
    "students": [
      {
        "name": "Dénes-Fazakas Lehel",
        "major": "Sapientia EMTE, Számítástechnika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Antal Margit",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Az elmúlt években a számítógépes felhasználók hitelesítésének számtalan módja jelent meg. Ezek közül a legelterjedtebb jelszóval történik, amelynek az a hátránya, hogy csak egyszer történik meg a belépés alkalmával. Az egérdinamika-alapú viselkedési biometria egy újfajta ellenőrzési módszer. Nem igényel semmilyen új beviteli eszközt, és segítségével megoldható a folyamatos hitelesítés. Dolgozatomban bemutatok egy egérdinamika-alapú hitelesítési rendszert, amely gépi tanulás segítségével épített bináris osztályozóval működik. Ezt követően pedig egy saját gyűjtésű, 21 személy egérdinamikai adatait tartalmazó adathalmazt ismertetek, illetve a hitelesítő rendszer teljesítményanalízisét végzem el az adathalmazon.",
    "keywords": [],
    "generated_keywords": [
      "egérdinamikai",
      "épített bináris"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2019,
    "title": "Algoritmusok utasításszámra való optimalizálása script nyelvekben",
    "students": [
      {
        "name": "Kézdi Örs-Sebestyén",
        "major": "Sapientia EMTE, Informatika szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Horobeț Emil",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A mai gépek kapacitása mellett a programfejlesztők az algoritmusaikat nem kifejezetten bináris kód szintjén és memóriaigény szempontjából kell, hogy optimalizálják (azt megteszik legtöbb esetben az okos interpreterek), hanem alternatív megközelítésekben, akárcsak az utasítás számbeli optimalizálás. Több nyelvben is a gondolkodásmód inkább az „elemek megfelelő összepakolására” fekteti a hangsúlyt, ahol minden „modulnak” megvan a saját költsége. A Minecraft command block nyelve is inkább ilyen fajta gondolkodást követel meg, és a benne írt algoritmusok a nyelv korlátozott lehetőségei miatt hasznosan átültethetők más, hasonlóan korlátozott nyelvbe, így teret nyerve magának a tiszta algoritmikának. Fő témaként a világ generálás problémáját szeretném megoldani minél optimálisabban, alsó hangon kell hozzá pszeudorandom számgenerálás analitikus módszerekkel, fill algoritmus és egyéb algoritmusok. Ez irányba már elkészítettem egy, a nyelvre implementált, gyors hatványozás algoritmust.",
    "keywords": [],
    "generated_keywords": [
      "Minecraft",
      "bináris",
      "fill algoritmus",
      "hanem alternatív megközelítésekben",
      "hangon kell hozzá"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2019,
    "title": "Hat hónapos csecsemők agyi MRI felvételeinek atlasz alapú szegmentálása",
    "students": [
      {
        "name": "Kucsván Zsolt Levente",
        "major": "Sapientia EMTE, Számítástechnika szak, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Szilágyi László",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "Az emberi agyat normál esetben három szövettípus alkotja: fehérállomány, szürkeállomány és agy- gerincvelői folyadék. A csecsemők agya a születéstől számított egy éven belül fejlődik a legdinamikusabban. Ekkor képződnek az említett szövetek, valamint fejlődnek ki a különböző kognitív, illetve motorikus funkciók. Ez az időszak kritikus különböző betegségek kialakulásánál, mint például a skizofrénia vagy az autizmus, így egyre nagyobb figyelem van fektetve ennek a megfigyelésére. Nagy kihívást jelent, hogy a körülbelül hat hónapos csecsemők agyáról készült MRI felvételeken a különböző agyi szövetek színei nagyon közel állnak egymáshoz, így nagyon nehéz mind szakértő orvos által, mind automata módon szegmentálni ezeket a felvételeket. Jelen dolgozat egy olyan módszert és annak kihívásait, valamint eredményességét mutatja be, mely egy statisztikai térképet épít fel a tanulásra rendelkező adatokból. Egy csecsemő agyi felvételeinek szegmentálása során a felépített térképünk meg tudja mondani minden képpontról, hogy az más csecsemők agyában milyen valószínűséggel tartozik egy adott szövethez. Amikor egy gépi tanulási eljárást megtanítunk a csecsemő agyi felvételek színek alapján történő szegmentálására, az előzetesen megalkotott statisztikai térképekkel többletinformációt adhatunk az algoritmus számára. Ennek alapján pontosabban meg tudjuk határozni a képpontok különböző szövetekhez tartozását.",
    "keywords": [],
    "generated_keywords": [
      "Amikor",
      "Ekkor",
      "Jelen",
      "alapján történő szegmentálására",
      "fehérállomány"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2019,
    "title": "Algo-Rhythmics: Tánctól a kódig",
    "students": [
      {
        "name": "Nagy Eszter Jáhel",
        "major": "Sapientia EMTE, Informatika szak, 3. év"
      },
      {
        "name": "Osztián Pálma-Rózália",
        "major": "Sapientia EMTE, Informatika szak, 3. év"
      },
      {
        "name": "Cosma Cristian",
        "major": "Sapientia EMTE, Számítástechnika szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Kátai Zoltán",
        "university": "Sapientia EMTE, egyetemi docens"
      },
      {
        "name": "Osztián Erika",
        "university": "Sapientia EMTE, egyetemi tanársegéd"
      },
      {
        "name": "Dr. Jánosi-Rancz Katalin Tünde",
        "university": "Sapientia EMTE, egyetemi docens"
      },
      {
        "name": "Tekse Csaba",
        "university": "Lateral"
      }
    ],
    "content": "Algoritmikus gondolkodás. Hogyan lehet elsajátítani a leghatékonyabban ezt, ami a négy alapvető készség egyikének képezi a részét? Richard Tinning kutatása válasz lehet erre, amely egy szokatlan asszociációt léptet érvénybe: összekapcsolja az emberi mozgást a didaktikával. Célunk egy olyan interaktív szoftver kialakítása volt, amely keresi a választ a fenti kérdésre, és erre a kutatásra alapozza jellegét. Projektünk a keresési és rendezési algoritmusok megtanítására specializálódott, és arra hívatott, hogy a programozás és a tánc ötvözésével segítsen az algo-ritmikus gondolkodás kialakításában, miközben bővíti ennek fogalmát. Ezek mellett lehetőséget biztosít a tartalmának dinamikus és változatos összeállítására, ami mind a szerkezet, mind az interaktivitási szint meghatározását jelenti. Mindezt szem előtt tartva egy olyan „táncparkettet” valósítottunk meg, amelyen a „koreográfus” (tanár) összeállíthat kurzusokat, ami a számos változatú tanítási lépés (videó, animáció, levezénylés, kódépítés, életre kelt kód) variációinak összessége. Ezt követően a „táncos” (tanuló) az előzőleg felállított kurzus interaktív tanulási folyamatának eredményeként eljut a tánctól a konkrét kódig, ami együtt jár az algoritmus elsajátításával. Mindeközben egy „tükröt” állítunk vele szembe, hogy nyilvánvaló legyen előtte is az előrehaladása. Tanulási folyamatról lévén szó, természetes, hogy hibázik, vagy segítséget kér. Az ilyen alkalmak összesítése biztosítja kutatásunk alapját. Rávilágít arra, hogy milyen interaktivitás-szintű tanítási lépések mely sorrendje és kombinációja bizonyul a leghatékonyabbnak.",
    "keywords": [],
    "generated_keywords": [
      "Hogyan",
      "Projektünk",
      "Richard Tinning",
      "Tanulási",
      "arra hívatott"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2019,
    "title": "Quick CarWash Finder – Szabad autómosó-kereső integrált informatikai rendszer",
    "students": [
      {
        "name": "Kapás Orsolya",
        "major": "Sapientia EMTE, Informatika szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Jánosi-Rancz Katalin Tünde",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjainkban egyre több ember rendelkezik saját autóval, és nehéz találni egy olyan autómosodát, amely rövid várakozási sorral rendelkezik, és nem is létezik olyan a környékünkön, amelynek zsúfoltságáról tájékozódhat az ügyfél. A dolgozatom célja az, hogy tájékoztatást nyújtson egy adott mosoda zsúfoltságáról. A mosoda tulajdonosa, alkalmazottjai vagy akár az ügyfelek is jelenthetik azt, hogy egy mosoda mennyire zsúfolt. Az alkalmazás felhasználói megnézhetik a közelben lévő autómosodák foglaltságát és lehetőségük van mosási időpontfoglalásra is. Ezen kívül kiválaszthatják a számukra elhelyezkedésben, árban és minőségben legmegfelelőbb mosodát. A rendszer megvalósítására egy-egy alkalmazást hoztam létre, egyiket a mosoda, másikat pedig az ügyfél számára. A mosodaalkalmazás feladata az ügyfelek és az autóik, valamint a mosásokkal kapcsolatos információk nyilvántartása. Az ügyfélalkalmazáson keresztül lehet tájékozódni a legközelebbi mosodák árajánlatairól, zsúfoltságáról, illetve mosásfoglalás is végrehajtható. Mindkét alkalmazás megjelenít minden fontos információt az adott felhasználó számára, ugyanakkor lehetővé teszi új információk hozzáadását és módosítását is. Fontos, hogy az ügyfelek számára az alkalmazás könnyen elérhető és használható legyen mind a fiatalabb, mind az idősebb generáció számára, és az alkalmazottak szempontjából pedig a gyorsaság az elsődleges cél, ezáltal is csökkentve az esetleges zsúfoltság kialakulását.",
    "keywords": [],
    "generated_keywords": [
      "Ezen",
      "nyújtson"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2019,
    "title": "Szoftver által definiált hálózat POX kontroller segítségével",
    "students": [
      {
        "name": "Farkas Zsombor",
        "major": "Sapientia EMTE, Számítástechnika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Szántó Zoltán",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "A számítógépes hálózatok rendkívül fontos részét képezik az ember mindennapi életnek, hiszen ezeken keresztül valósul meg a mérhetetlen információ átvitel az egyszerű email-küldéstől a videohívásig. Ezen hálózatok jelen vannak mind a privát, mind az ipari szférában, és a technológia rohamos fejlődésével egyre összetettebbé, gyakran nehezen átláthatóvá és karbantarthatóvá válnak. A szoftver által definiált hálózatok (SDN) a hagyományos hálózatok gyengeségeit próbálják előnyökké alakítani. Működési elvük alapja, hogy szétválasztják az adat- és irányítássíkokat. Ennek érdekében egy központi kontrollert alkalmaznak, mely képes, jól meghatározott szabály táblák alapján, a hálózatot (újra)konfigurálni. A dolgozatomban tanulmányoztuk az SDN-típusú hálózatokat, illetve a nyílt forráskódú, python alapú, POX kontrollert alkalmaztuk. Miután egy hálózati infrastruktúrát elkészítünk, a felhasználónak lehetősége van megadni, hogy mely kommunikációs végpontok között szeretne adatfolyamot létrehozni. A kontroller pedig különböző kritériumok alapján úgy alkotja meg a szabályokat, hogy ezen adatfolyam megvalósuljon. A rendszer tesztelésére a Mininet hálózati emulátort alkalmaztuk.",
    "keywords": [],
    "generated_keywords": [
      "Ezen",
      "Mininet",
      "Miután",
      "POX",
      "SDN"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2019,
    "title": "Hangvezérelt mobilis robot",
    "students": [
      {
        "name": "Nagy Szabolcs",
        "major": "Sapientia EMTE, Automatizálás szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Dávid László",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "A dolgozat célja egy olyan hanggal vezérelt parancsszó-felismerő program fejlesztése, mely alkalmas különféle mobilis robotok vezérlésére. Az előkészítés alatt két lehetőséget tanulmányoztam: a klasszikus Rejtett Markov Modellt, illetve a neuronhálókon alapuló mély tanulásos beszédfelismerést. Tekintettel a neuronhálók jövőbeli szerepére, a második módszert választottam. A legelterjedtebb módszer a Hidden Markov Model (HMM), melyet éveken keresztül tökélyre fejlesztettek. Mindezek ellenére manapság már kezd kimenni divatból, és a neuronhálós megoldások veszik át helyét, pontosabban a konvolúciós neuronhálók. Dolgozatom elkészítéséhez a Tensorflow nevű nyílt forráskódú keretrendszert használtam, melyben felépítettem egy olyan konvolúciós neuronhálót, amely alkalmas a parancsszavak felismerésére, majd a betanított neuronháló kiexportálható bármilyen más operációs rendszerre. Tekintettel elterjedtségére, én Android-alapú okostelefont választottam céleszköznek, melyen a betanított háló ismeri fel a parancsszavakat, majd bluetooth-csatornán keresztül küldi a megfelelő vezérjelet egy Arduino mikrovezérlőnek. A mikrovezérlő ennek megfelelően megvezéreli a robotot. Az elért eredmények azt bizonyítják, hogy ez egy járható út, viszont gondot jelent a folyamatos beszéd kiszűrése, pontosabban a nem parancsszavakat tartalmazó folyamatos beszéd. A problémát úgy lehetne kiküszöbölni, hogy nagyobb adathalmazt használunk, még azokból a szavakból is, melyek nem parancsszavak. Így a neuronháló könnyebben megkülönbözteti a valós parancsszavakat a rájuk csak hasonlítóktól.",
    "keywords": [],
    "generated_keywords": [
      "Android-alapú",
      "Arduino",
      "HMM",
      "Markov Model",
      "Mindezek"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2019,
    "title": "Augmentált valóságon alapuló mobilos játék Vuforia segítségével",
    "students": [
      {
        "name": "Ambarus Ádám",
        "major": "Sapientia EMTE, Számítástechnika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Szántó Zoltán",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Napjainkban a legfontosabb eszközeink közé tartozik a telefonunk. A fejlett technológiának köszönhetően az egyszerűbb teendőinket már a telefonjainkon is elvégezhetjük, nem szükséges számítógép elé ülnünk. Ilyen teendő lehet a böngészés, elektronikus levelek küldése és fogadása, vagy akár a játszás. A technológia rohamos fejlődésével a szórakoztatóipar is rákényszerül arra, hogy újabb és újabb módszerekkel kápráztassák el a felhasználókat. A dolgozat egy olyan mobilos játék megvalósítását tűzte ki célul, amely a valós környezetet tudja kibővíteni, díszíteni virtuális elemekkel. Ezzel a felhasználó egyfajta kiterjesztett, augmentált valóságot fog érzékelni. A játék játszásához szükséges egy kompatibilis okostelefon, egy gaming kontroller és egy virtual reality (VR) szemüveg. A telefont hozzá kell illeszteni a VR szemüveghez, és feltelepíteni a játékot. Mivel a telefon kijelzője így nem elérhető, a játék irányításához a kontrollert csatlakoztatjuk a telefonhoz. A felhasználó a játék használatakor a telefon kameráján keresztül a fejére helyezett VR szemüvegben a való világot látja, amelyhez hozzáadódnak a virtuális elemek: egy pálya és karakterek. Ezeket az elemeket több szögből lehet megfigyelni. A szemüveg és a telefon kombinációjával a játék nagyobb, valósághű élményt tud nyújtani a klasszikusokhoz viszonyítva. Az alkalmazás megvalósításához a Unity játékmotort, illetve a Vuforia SDK-t használtuk.",
    "keywords": [],
    "generated_keywords": [
      "Ezzel",
      "Ilyen",
      "Napjainkban",
      "Unity",
      "VR"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2019,
    "title": "Kézfejvénák bejelölése félig automatikus szegmentálási módszerekkel",
    "students": [
      {
        "name": "Mészáros Adél",
        "major": "Sapientia EMTE, Számítástechnika szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Lefkovits László",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "A folyamatosan fejlődő képalkotó eljárások a modern orvosi gyakorlat egyik nélkülözhetetlen eszközévé váltak. Az orvosi képek feldolgozása, ezen belül a vénák képekből való kinyerése egy igényes és fontos feladat. A felületi véredények látható spektrumban alig, leginkább infravörös sugárzáson alapuló képalkotással válnak szemmel láthatóvá. Az érrendszer vizsgálata felhasználható az orvoslásban és személyazonosításban egyaránt. Dolgozatomban és a fejlesztett applikációban az NCUT által közzétett, nyilvános képadatbázist dolgozom fel, amely 2040 NIR (near infrared) képet tartalmaz 102 személy kézfejéről. A kutatás célja a képadatbázis bejelölése és az erek rajzolatának kinyerése bináris kép formájában. A feldolgozási folyamatot három szakaszra osztottam fel: előfeldolgozás, szegmentálás és kiértékelés. Az előfeldolgozás feladata a képi információ egységesítése, melyre a következő műveletsorrend bizonyult a legmegfelelőbbnek: zajszűrés, megvilágítás kiegyenlítése és kontrasztnövelés. A szegmentálást kísérletek alapján valósítottam meg különböző szűröket alkalmazva. A szegmentálási eredmény kiértékelése szemmel történt, mivel ezeken a képeken az erek nincsenek bejelölve. Az erek szegmentálására többféle szűrést és képfeldolgozási algoritmust szükséges alkalmazni. A jelen dolgozatban bemutatásra kerülnek az alkalmazott szűrők és a megfelelő paraméterek értékeinek hatásai a feldolgozandó képekre. Továbbá meghatároztam a szűrők megfelelő alkalmazási sorrendjét a lehető legjobb szegmentálási eredmény elérése érdekében. A képfeldolgozó programot Java nyelven fejlesztettem, felhasználva az ImageJ programcsomagot és a környezet által felkínált osztályokat, függvényeket.",
    "keywords": [],
    "generated_keywords": [
      "ImageJ",
      "Java",
      "NCUT",
      "NIR",
      "Továbbá"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2019,
    "title": "hisztogramkiegyenlítés Orvosi képek diagnosztikai célú szegmentálása felügyelettel tanuló osztályozó algoritmusok segítségével",
    "students": [
      {
        "name": "Borsos Bálint",
        "major": "Sapientia EMTE, Automatizálás és alkalmazott informatika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Szilágyi László",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "Az orvosi képalkotás gyors fejlődésének köszönhetően rendkívül gyorsan nő a „szolgálatba álló” orvosi képalkotó berendezések száma és a naponta létrejövő orvosi adat mennyisége. Ezt az ütemet nem képes tartani a felvételeket szakszerűen kiértékelni képes humán szakemberek száma. Ezért elengedhetetlenül szükséges egy olyan algoritmusbázis létrehozása, amellyel hatékonyan meg lehet segíteni az orvosok munkáját. Amennyiben az automatikus adatfeldolgozó algoritmusok megfelelő pontossággal elvégzik a felvételek előszűrését, orvosaink képesek lesznek korai stádiumban felismerni minden olyan tényleges beteget, aki részt vett egy szűrővizsgálaton. A WHO adatai szerint egy évtizeden belül bolygónk lakosságának 10%-a cukorbeteg lesz. A diabétesz egyik gyakori szövődménye a retinopátia, melynek következtében a beteg részben vagy teljesen elveszíti a látását. Jelen dolgozatban a gépi tanulás módszereit alkalmazom a retinopátia okozta elváltozások felismerésére digitális szemfenékkamerával készített felvételek alapján. A kidolgozott módszer négy lépésben valósul meg. Első fázisban watershed transzformáció segítségével szuperpixeleket alakítunk ki. Ezt követően egy vagy több szuperpixelből álló összefüggő foltokat keresünk, amelyekről a környezetükhöz viszonyított átlagos színük alapján feltételezhető, hogy egy elváltozást tükröznek. Harmadik lépésben ezeknek a foltoknak kiszámítjuk több tucat morfológiai és textúrajellemzőjét, melyek alapján végül osztályozzuk egy együttes tanulási eljárással három diagnosztikai csoportba. A kidolgozott eljárás igéretes pontosságú eredményeket ad az Indian Diabetic Retinopathy Image Dataset adatain tesztelve.",
    "keywords": [],
    "generated_keywords": [
      "Ezért",
      "Indian Diabetic Retinopathy Image Dataset",
      "Jelen",
      "WHO",
      "felvételek előszűrését"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2019,
    "title": "Személyes adatok halászata és bővítése",
    "students": [
      {
        "name": "Tordai Aletta",
        "major": "Sapientia EMTE, Informatika szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Egyed-Zsigmond Előd",
        "university": "INSA Lyon, egyetemi docens"
      }
    ],
    "content": "A 21. század a technológia iramos fejlődésének mellékhatásaként hozta az adatok feldolgozásának, illetve begyűjtésének protokolljában jogsértés címszó alatt szereplő személyes adatok védelmének figyelmen kívül hagyását. Napjainkban az online világban használt valuta a személyes adat. A fogyasztói társadalomra lett bízva az, amit a fejlesztők sokáig elhanyagolható részletkérdésnek tartottak, az adatot begyűjtőben való bizalom, mivel legtöbb esetben átlátható volt a nyújtott szolgáltatásért kért információ. Ez a kutatás a WIFI-menedzsment kereteinek feltérképezésén alapszik, a probe requesteken és responsokon amikkel az IEEE 802.11-es vezeték nélküli WIFI-protokollban kommunikáló eszközök publikusan sugározzák a küldő egyedi MAC címét. Elektronikus eszközök fő funkcionalitásai a hálózati kapcsolattól függnek. Mivel a gyártók egyre több ilyen eszközzel állnak elő, ezért a felelősség is egyre inkább nő, ami a hálózaton átmenő adatcsomagok személyes biztonságát illeti jogi vonatkoztatásokban is. Ezt középpontba helyezve gyűjtöttük be és értelmeztük a kereteket. Elsődlegesen csoportos viselkedésminták felismerését tanulmányoztuk Raspberryk segítségével, és egy idővonal alapú JavaFx animációval modelleztük az egyetemen megforduló mobiltelefonokat. Másodsorban az eszközök profilozására terveztünk, készítettünk és teszteltünk Java programmal módszert, hogy bizonyítsuk azok tulajdonságainak kapcsolatát személyekhez, illetve annak a felmérésére, hogy a jogi szabályozás utáni szigorított módszerek milyen minőségű adatok bányászatát engedik még meg.",
    "keywords": [],
    "generated_keywords": [
      "IEEE",
      "Java",
      "JavaFx",
      "MAC",
      "Raspberryk"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2019,
    "title": "WIFI-alapú rádiófrekvenciás beltéri helymeghatározás",
    "students": [
      {
        "name": "Szabó Zsolt",
        "major": "Sapientia EMTE, Számítástechnika szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Turos László-Zsolt",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Manapság egyre több lakásban, intézményben található vezeték nélküli útválasztó (router). Ezek internetet szolgáltatnak nekünk a hatósugarukon belül. Azonban ezek az eszközök egyéb információkat is sugároznak, amelyeket fel lehet használni beltéri lokalizációra. A projektem során megvizsgáltam, hogy mások milyen módszerekkel, milyen eredményeket értek el a WIFI-hálózaton alapuló lokalizáció terén. Kutatásaink során a háromszögelés módszerét használtuk fel, amely segítségével legalább három rögzített ponthoz képest határoztuk meg az eszköz helyét. A rögzített pontok az útválasztók, az eszköz pedig egy Androidos okostelefon. Az eredmények pontosságát befolyásolja, hogy hány eszközhöz képest számítottuk a távolságot, valamint az is, hogy milyen akadályok álltak az útválasztó és az okostelefon között. Célunk egy olyan Androidos alkalmazás fejlesztése, amely lehetőséget biztosít a tájékozódásra egy nagy intézményen belül, ahol nem rendelkezünk GPS lefedettséggel, viszont ismerjük a hálózati útválasztók pontos helyét.",
    "keywords": [],
    "generated_keywords": [
      "Androidos",
      "Kutatásaink",
      "WIFI-hálózaton",
      "lehet",
      "nélküli útválasztó"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2019,
    "title": "Mindennapi függőségeink – a kávé és az Instagram kapcsolata",
    "students": [
      {
        "name": "Csáki Csilla",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Vajda András",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatomban a huszonéves korosztály mindennapjainak két meghatározó, a napi rutinokat jelentősen befolyásoló kultúra- és közösségteremtő elemét, a kávét és az Instagramot, illetve ezek sajátos összekapcsolódását vizsgálom. A téma aktualitását az a mindennapi tapasztalat adja, hogy a fiatalok a kávézókban és otthon egyaránt a kávé elfogyasztása előtt erről képet készítenek, ami azonnal meg is osztanak az Instagramon, ahol több ezer hasonló kompozíció található. Ennek okára, az ehhez kapcsolódó rutinokra és a mögöttük felsejlő világképre a digitális etnográfia elméleti hátterére támaszkodva és a résztvevő megfigyelés módszerét alkalmazva világítok rá. Dolgozatomban egy eset/személy elemzésén keresztül arra keresem a választ, hogy mennyire a személyes identitás és az önkifejezés eszköze ez a fajta társadalmi praxis. Mi is látszik ezeken a képeken – amelyek a #coffee alatt láthatóak – valójában? Hogyan is jelenik meg (milyen reprezentációk termelődésével) az online térben a kávézás mint egyéni/közösségi rítus?",
    "keywords": [],
    "generated_keywords": [
      "Hogyan",
      "Instagramon",
      "Instagramot",
      "arra keresem",
      "kávé"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2019,
    "title": "Az erdélyi önkéntesség motivációi",
    "students": [
      {
        "name": "Incze-Borbándi Johanna-Mária",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gagyi József Pál",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "Dolgozatom az erdélyi önkéntesség témakörének vizsgálatát tűzte ki célul. Az önkéntesség témája egyre több fiatalt (14-25 éves korosztály) érint, mivel önkéntes tevékenységet vállalnak egy vagy több szervezetnél. Az eddigi kutatások rámutattak, hogy milyen hatása van az önkéntességnek, hogyan hatnak a társadalomra a vállalkozó szellemű egyének és az általuk szervezett események. Több kutatás is foglalkozott már azzal a kérdéskörrel, hogy miért, milyen indíttatásból vállalnak önkéntes munkát bizonyos személyek. Kérdéses viszont, hogy a belső indíttatás, az eltökéltség hogyan jelenik meg a közösségi média felületein, egyáltalán van-e kapcsolat egy önkéntes közösségi felületén lekommunikált személyisége és az a civil szervezet alapértékei között, amelyben az önkéntes is tevékenykedik? Ha van, ez az összefüggés miben, hogyan nyilvánul meg? A kérdést először tartalomelemzés módszerével kutattam, ezt kiegészítettem tizennégy aktív önkéntessel folytatott interjúval a részletesebb eredmények érdekében. Célom az erdélyi önkéntesség mint kommunikációs modell meghatározása, feltárni az összefüggéseket a motiváció, a közösségi média, a szervezet és önkéntese között. Kutatásommal szeretnék többlettudást adni a kommunikációtudományokhoz. Tervem, hogy a kutatásom eredményei segíteni fogják a civil szervezetek humánerőforrás vagy akár PR-es munkáját, hogy mivel, hogyan tud motiválni és megszólítani új vagy régi önkénteseket, valamint rálátást nyerni arra, hogy a fiatalok hogyan jelenítik meg az általuk képviselt szervezet értékeit, alapelveit közösségi felületeken.",
    "keywords": [],
    "generated_keywords": [
      "Célom",
      "Kutatásommal",
      "Kérdéses",
      "Tervem",
      "hogyan"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2019,
    "title": "Nagyszülők a neten. Hogyan változtatta meg az idős emberek életét az internet?",
    "students": [
      {
        "name": "Molnár Edina",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Tőkés Gyöngyvér",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      },
      {
        "name": "Dr. Vajda András",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatom célja, hogy egy Marosvásárhelyen élő 72 éves férfi esetének bemutatásán keresztül elemezzem az idősek (65+) digitális eszköz- és internethasználatának sajátosságait. Azt vizsgálom, hogy hogyan hat egy idős személy mindennapjaira (napi rutinjaira, időbeosztására, a külvilággal történő kapcsolattartására, világképére stb.) az internet, illetve a digitális eszközök használata. Mire használja az internetet, milyen rendszerességgel teszi ezt, milyen digitális eszközöket használ, illetve milyen segítők állnak a rendelkezésére. Vizsgálatom feltáró és minőségi jellegű. Az adatgyűjtés strukturált és félig strukturált beszélgetések és résztvevő megfigyelés technikájának alkalmazása révén zajlott. A kutatás első fázisában egy előre elkészített kérdőív alapján strukturált beszélgetést folytattam, majd az interjúban rögzített adatokat szabad beszélgetésekkel, valamint helyszíni megfigyeléseimmel egészítettem ki.",
    "keywords": [],
    "generated_keywords": [
      "Marosvásárhelyen",
      "Mire",
      "az idősek",
      "az internet",
      "rögzített adatokat"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2019,
    "title": "Nyári egyetem a Sapientián",
    "students": [
      {
        "name": "Csepán Dorottya",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gagyi József",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "Bevezetés: szakdolgozatom témája a Sapientia Marosvásárhelyi Karának egyik legnagyobb rendezvénye, a Nyári Egyetem, melyet tavaly szerveztek meg legelőször. Célkitűzés: vizsgálom a Nyári Egyetem arculatát, kommunikációját és sajtóvisszhangját. Ezen kívül bemutatom az egész rendezvényt. Módszertan: jelen tanulmányomban a Nyári Egyetemet tanulmányoztam, melyben arra voltam kíváncsi, hogy hogyan állt össze az arculat, az esemény kommunikációja. A rendezvényről megjelent sajtóanyagokat vizsgáltam tartalomelemzéssel. A másik kutatási módszerem a strukturált interjúkészítés volt, ahol előre megírt kérdésekből dolgoztam, ahol a kérdések sorrendje előre rögzítve van. A kellő dokumentumok összegyűjtésében a rendezvény főszervezője segített, akivel nagyon sokat leveleztem. Eredmények: kiderült, hogy a rendezvény nem volt időben reklámozva, ezért kevesebb emberhez jutott el, a célcsoport nem volt teljes mértékben behatárolva, így a rendezvényen részt vettek líceumba járó diákok is. Egy nagy újítást hozott be az egyetem életébe és az erdélyi fiatalokéba is, hisz így megtudhatták azt is, hogy az egyetem mint intézmény nem csak a padban tud oktatni minket. Ez az alkalom teret biztosított a résztvevőknek, hogy külhoni látogatókkal ismerkedjenek. A főszervezők elmondták, hogy kétévente lesz megszervezve a Nyári Egyetem. Következtetés: egy időintervallumot és célcsoportot kell leszögezni, a népszerűsítés így eredményes lesz.",
    "keywords": [],
    "generated_keywords": [
      "Célkitűzés",
      "Egyetemet",
      "Ezen",
      "Módszertan",
      "Nyári"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2019,
    "title": "Online jelenlét a Marosvásárhelyi Nemzeti Színház Tompa Miklós Társulata esetében.",
    "students": [
      {
        "name": "Fülöp Karina- Beáta",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Vajda András",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatom témája a marosvásárhelyi Nemzeti Színház Tompa Miklós Társulatának online jelenléte. Kutatásomat a társulat online fénykép- és szöveghasználatára terjesztettem ki. Ezen belül pedig azt vizsgáltam, hogy mennyire használják ki a közösségi média által kínált lehetőségeket, milyen felületeken vannak jelen online, hogyan kezelik ezeket a felületeket, és hogyan mérik és ellenőrzik a felületek látogatottságát. A kutatás során az irányított interjú és a tartalomelemzés módszerét használtam, hogy minél részletesebben tudjam átvizsgálni a Társulat online jelenlétét. A dolgozatom ezen kívül kiterjed az online kommunikáció, a vizuális kommunikáció, a kultúra és a színház főbb elméleti és gyakorlati területeire. A mai, digitális eszközökkel és online környezetekben egyre intenzívebben élő fogyasztói társadalom elvárja, hogy az információátadás, az információáramlás egyszerre legyen intenzív és expresszív. A hangot, szöveget és képi elemeket egyaránt és egyszerre tartalmazó üzenetek legyenek a kulturális intézmények mindennapi kommunikációjában is jelen. Dolgozatom mindamellett, hogy elvégzi a marosvásárhelyi színtársulat online jelenlétének és tevékenységének leírását és elemzését, választ ad a közösségi média felületein történő online és vizuális kommunikáció (fényképhasználat) változó funkcióira.",
    "keywords": [],
    "generated_keywords": [
      "Dolgozatom",
      "Ezen",
      "Miklós Társulatának",
      "Nemzeti Színház Tompa",
      "Társulat"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2019,
    "title": "A Rhédey-kastély szerepe az erdőszentgyörgyi kulturális örökségek megőrzésében.",
    "students": [
      {
        "name": "Ádám Tanti Bernadett",
        "major": "Sapientia, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Vajda András",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatomban azt vizsgálom, hogy milyen szerepe van a Rhédeyek emlékezetének és a Rhédey- kastélynak az erdőszentgyörgyi lokális identitás és kulturális életszervezésében. A kastély jelenleg múzeumként funkcionál, illetve benne működik az országos turisztikai információs központ irodája is. Kutatásom során arra kerestem a választ, hogy a helyi elit, a kastély mint emlékhely kialakítása révén, hogy próbálja fenntartani, megkonstruálni és továbbadni a Rhédeyek örökségét az erdőszentgyörgyi lakosok, illetve az ide látogatók számára;a kastélyt mint örökséget a település miként használja fel az örökségturizmus fellendítése érdekében, illetve mi a szerepe a kastélymúzeumnak a múlt megtartásában, illetve a helyi hagyományok őrzésében. Kutatásom során a strukturált interjú módszerét és a résztvevő megfigyelést alkalmaztam.",
    "keywords": [],
    "generated_keywords": [
      "Kutatásom",
      "Rhédey- kastélynak",
      "Rhédeyek",
      "az örökségturizmus fellendítése"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2019,
    "title": "A vargyasi népi bútorfestés múltja és jelene",
    "students": [
      {
        "name": "Katona Kinga",
        "major": "Sapentia EMTE, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Vajda András",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Dolgozatomban a vargyasi népi bútorfestés történetét (múltját és jelenét), a közösség identitásának megképzésében és fenntartásában játszott szerepét vizsgálom a Sütő család példáján keresztül, ahol az asztalosság és bútorfestő mesterség fél évezrede „apáról fiúra szálló” „élő hagyomány” a családban. Jelenleg a 16. nemzedék viszi tovább az elődöktől rámaradt családi mesterséget. Kutatásom során arra kerestem a választ, hogyan lett egy egyszerű falusi mesterségből olyan reprezentatív hagyomány, melyet a 20. század második felétől kezdődően intézményes keretek között (opcionális tantárgyként) oktatni kezdtek; majd később olyan örökség, amelyet ma vargyasi identitás legfontosabb szimbólumaként azonosítanak nem csak a faluban, hanem szerte a világon. Illetve ezzel összefüggésben: hogyan vált a Sütő család ennek az örökségnek az egyik legismertebb és legreprezentatívabb hordozójává, hogyan fonódott össze az idegenek/turisták szemében a család neve a vargyasi bútorfestéssel, és képzett felhajtóerőt a helyi örökséggazdaság és örökségturizmus számára. Illetve ebben az örökségesítő folyamatban milyen – tágan értelmezhető – kommunikációs technikákat és stratégiákat alkalmazott a Sütő család? Összegezve, a dolgozat a vargyasi bútorfestés örökségesítésének folyamatát és a Sütő családnak ebben a folyamatban játszott szerepét, valamint a kettőnek a falu életére gyakorolt hatását mutatja be.",
    "keywords": [],
    "generated_keywords": [
      "Jelenleg",
      "Sütő",
      "fél",
      "hanem",
      "hogyan fonódott"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2019,
    "title": "Folyékony online identitások",
    "students": [
      {
        "name": "Barbócz Zsolt",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Vajda András",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Az interneten található közösségi oldalak elterjedésének a velejárója volt az online identitás kialakulása. A kezdeti időszakban a World Wide Webet anonimitás jellemezte, a felhasználók beceneveket használtak. A Facebook, illetve a Google+ elterjedésével azonban elvárás lett az, hogy az egyének felvállalják valós kilétüket. Az online identitás az interneten megjelenített saját személyiséget, az „én” kivetülését és leképződését jelenti a digitális térben. A kutatás főbb kérdései, hogy az online megjelenített személyiség mennyire független a valós személyiségtől, milyen viszony van a kettő között, és az egyén mennyire megfontoltan, milyen szándékkal közöl magáról tartalmat az online terekben. Az, hogy mennyire spontán, milyen mértékben előre megtervezett a közzététel, illetve milyen gyakorisággal történnek megosztások, további kérdéseket vetnek fel. Ehhez szorosan kapcsolódik az, hogy a közzétett tartalom és forma mit árul el az egyénről, milyen értékrendek, normák, világképek és önképek válnak láthatóvá a megosztás által. Az online identitások stabilitása, változása, formálódása szintén egy kevésbé vizsgált terület. Eddigi kutatások kimutatták azt, hogy a közösségi oldalakra ma már biztos forrásként tekintenek az emberek, ha valakiről információt akarnak megtudni. A kérdés vizsgálatára az esetelemzés módszerét használom, hogy megtudjuk, az egyetemista korú fiatalok hogyan tekintenek erre a kérdéskörre, illetve milyen stratégiákat alkalmaznak az online identitás kialakítására és befolyásolására.",
    "keywords": [],
    "generated_keywords": [
      "Ehhez",
      "Facebook",
      "Google+",
      "World Wide Webet",
      "előre megtervezett"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2019,
    "title": "A fogyasztás mint új tér és idő a generációk életében",
    "students": [
      {
        "name": "Lázár-Kiss Panna",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gagyi József Pál",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "Szakdolgozatom témája egy hátrányos helyzetű város, helyesebben mondva egy kisváros fiataljainak fogyasztási szokásai. Kutatásom fő helyszíne Barót. Azt vizsgáltam, hogy az alanyaim mennyi időt szánnak a különböző vásárlásokra, valamint hol vásárolnak a leggyakrabban. A kutatásomat a félig strukturált interjú módszerével készítettem, ahol a kérdéseket és a kérdések sorrendjét előre kidolgoztam, de a találkozások alkalmával még tevődtek fel plusz kérdések. A kutatásomban nyolc olyan alanyt kérdeztem, akik közeli ismerőseim. Amellett, hogy vizsgáltam a fogyasztásaikat, megnéztem, hogy mennyire van jelen ez a Facebook-, illetve Instagram-profiljukon. A kutatásom során kiderült, hogy az alanyaim inkább az Instagramon teszik közzé a vásárláskor készített képeket, mint a Facebookon, valamint az alanyaim többsége egy teljes napot rááldoz a vásárlásra, és ezt leginkább Brassóban teszik, nem Baróton.",
    "keywords": [],
    "generated_keywords": [
      "Amellett",
      "Barót",
      "Baróton",
      "Brassóban",
      "Facebookon"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2019,
    "title": "Mitől válik okossá az otthon?",
    "students": [
      {
        "name": "Deák Tímea",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Vajda András",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Az utóbbi években rohamosan fejlődött a technológia, melynek következtében a minket körülvevő eszközök közül egyre több válik okossá. Ahogy egyre diverzifikálódik a piaci kínálat, és egyre szélesebb körben terjed el az okos eszközök használata, úgy növekszik ezek hatása az emberek mindennapjaira. Az okos eszközök elkezdték egyre komplexebb és kiterjedtebb módon befolyásolni mindennapi rutinjainkat, átalakítani tárgyi környezetünket. Dolgozatomban egy konkrét eset elemzésén keresztül, arra keresem a választ, hogy milyen külső és belső tényezők hatására, milyen elképzelések mentén történik meg az otthonok okossá alakítása; ez milyen befolyásoló tényezőként hat az egyén hétköznapjaira és életvitelére; mennyiben más ezeknek az otthonoknak a használata, illetve milyen mértékű az okos eszközök kihasználása. Ebből adódóan dolgozatomnak célja az okos otthon definiálása mellett a bennük való élés (életmód) rutinjának feltárása, és az ehhez kapcsolódó világkép értelmezése. A vizsgálat viszont nem tér ki a különböző technológiák ismertetésére. A kutatás a digitális etnográfiai kutatások hagyományába illeszkedik, ennek megfelelően az adatgyűjtést a résztvevő megfigyelés technikáját alkalmazva végeztem.",
    "keywords": [],
    "generated_keywords": [
      "arra keresem",
      "egyre több válik",
      "meg az",
      "választ"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2019,
    "title": "Szervezetek online kommunikációjának elemzési lehetőségei. A Nobila Casa példája",
    "students": [
      {
        "name": "Lukács Erzsébet",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Ármeán Otília",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Online kommunikációt naponta használunk, és 2019-ben azzal is tisztában vagyunk, hogy a vállalkozások is kihasználják az online PR előnyeit célcsoportjaik megszólítására. De milyen a jó online kommunikáció? Milyennek kell lennie egy jó weboldalnak? Mit tartalmazzon egy szervezeti blog? Kevert módszertanú kutatásomban a Nobila Casa lakberendezési üzletlánc online kommunikációját vizsgálom az említett szervezet weboldalán és szervezeti blogján, és a feltett kérdésekre keresem a válaszokat. A tartalomelemzéssel mennyiségi kutatást fogok végezni, a diskurzuselemzéssel pedig minőségit. A weboldalon minden információt figyelembe fogok venni, a szervezeti blogon a 2019. január 1-től a dolgozat leadási határidejéig megjelenő adatokat fogom elemezni.",
    "keywords": [],
    "generated_keywords": [
      "Kevert",
      "Milyennek",
      "Nobila Casa",
      "PR",
      "említett szervezet weboldalán"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2019,
    "title": "A magyar Youtuberek hatása a gyergyószentmiklósi lányok vásárlási szokásaira",
    "students": [
      {
        "name": "Bánffi Barbara Szilvia",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Gagyi József",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "Dolgozatomban azt vizsgálom, hogy a fiatalabb lányok milyen módon ismerkednek meg a divattal, szépségápolással, valamint mi befolyásolja őket e témakörön belül a vásárlási döntéseikben. Ennél mélyebbre ásva, jelen kutatásban a magyarországi, valamint egy romániai Youtuber vlog, beauty, és lifestyle szponzorált tartalmú videóit, valamint annak hatásait fogom vizsgálni a gyergyószentmiklósi lányok vásárlási döntéseire. Dolgozatomban kiderül, sokszor példaképeink, és szívesen költünk többet egy adott termékre az influencerek ajánlására. Az, hogy kiben bízunk, kinek a szavára vásárolunk, fontos kérdés lehet, valamint a marketing területén is érdemes megfigyelni, milyen változások és csalik kerülnek a fiatalokkal szembe. Hogy ráharapunk-e, dolgozatomban egyértelmű választ kapok: igen! A kérdés vizsgálatához két módszert is használok, interjúkat készítettem véletlenszerűen kiválasztott 18- 22 év közötti gyergyószentmiklósi lányokkal, és az általuk felsoroltakból az 5 legnépszerűbb, videóit magyar nyelven feltöltő beauty vloggert választottam ki, akiknek videóit és a videók alatti hozzászólásokat fogom tartalomellenzéssel elemezni. Továbbá az interjúkat felhasználtam a tanulmányomban. Az általam megkérdezettek rámutatnak arra, hogy a gyergyószentmiklósi lányok ismerik a Youtube influencereit, követik őket rendszeresen, és vásároltak már meg Youtuber által ajánlott termékeket. Ezek alapján nem volt meglepetés az sem, hogy komoly érzelmi szálak fűzik őket a Youtuberekhez.",
    "keywords": [],
    "generated_keywords": [
      "Youtube",
      "Youtuber",
      "Youtuberekhez",
      "módon ismerkednek",
      "választ kapok"
    ]
  },
  {
    "major": "Egészségtudományi",
    "year": 2019,
    "title": "Szülői egészségműveltség magyar és roma édesanyák körében Erdélyben",
    "students": [
      {
        "name": "Kun Emőke-Kinga",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Sántha Ágnes",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: Kutatásom témája a kisgyermeket nevelő magyar és roma édesanyák egészségműveltsége. A vizsgálat az édesanyák tájékozottságára keres választ különféle betegségek és oltások terén. Módszerek: Vizsgálati eszközöm a Semmelweis Egyetem II. Gyermekklinika 2017-es „Szülői egészségértés” kérdőíve. Mostanáig a magyar édesanyákra vonatkozó adatok kerültek feldolgozásra. Eredmények: Válaszadóink a legmegfelelőbb ismeretekkel az antibiotikumok indokolt használatának eseteiről rendelkeznek. Ezt követi a fertőző betegségek és a hasmenéses gyermekbetegségek ismerete, melyeket az antibiotikumról szóló ismeretek követnek. Az anyák a legkevesebbet a nem kötelező védőoltásokról és a HPV megelőzéséről tudnak. Jelentős a különbség a magas és az alacsony iskolai végzettségű anyák tudása között, valamint meghatározó az édesanyák életkora és a társadalmi-gazdasági helyzete. Következtetés: Eredményeim szerint a kisgyermekes szülők nagy részének elfogadható az egészségműveltsége. Az alacsony iskolai végzettségű édesanyák tudása fejlesztésre szorul, a védőoltások kérdésében hiányos az anyák tudása.",
    "keywords": [],
    "generated_keywords": [
      "Az",
      "Eredményeim",
      "HPV",
      "Módszerek",
      "Semmelweis Egyetem II"
    ]
  },
  {
    "major": "Egészségtudományi",
    "year": 2019,
    "title": "Munkahelyhez köthető rizikófaktorok Európában",
    "students": [
      {
        "name": "Hegyi Brigitta",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Sántha Ágnes",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: Napjainkban még Európában is problémát okoz a megfelelő munkakörülmények megteremtése. Mára már nem csak a fizikai munka által okozott negatív hatásokra kell odafigyelnünk, hiszen a krónikus betegségek egyik legfőbb oka, illetve kiváltója a stressz. Kutatási cél: A kutatás célja rámutatni azokra a káros tényezőkre, amelyek veszélyt jelentenek a dolgozók egészségére. Elemzést végzek a munkahelyi egészségi kockázatokkal és/vagy megbetegedésekkel élő dolgozók társadalmi-demográfiai jellemzőiről. Kutatási módszerek: Az EWCS nemzetközi nagymintás vizsgálat 2015-ös hullámának adatain statisztikai másodelemzést végzek. A munkakörülményekre és egészségi állapotra vonatkozó adatokból gyakorisági megoszlásokat számolok, a hipotéziseket kereszttábla-elemzéssel vizsgálom. Eredmények: Az európai dolgozók 40%-a számolt be arról, hogy fizikai szempontból kockázatnak van kitéve munkahelyén. A legtöbben a nehéz testhelyzetre vagy tartásra panaszkodtak, továbbá a nehéz teher cipelése is megnehezíti munkájukat. A dolgozók 27%-a érezte úgy, hogy a mentális jólléte veszélynek van kitéve munkája során. A fizikai munkát végző dolgozókat főleg az izomrendszeri megbetegedések érintik, míg a magasabb végzettségű, szellemi munkát végzőket a stressz. Továbbá a kor előrehaladtával a betegségek kockázatának kialakulása nő. A férfiak nemcsak a munkahelyi eredetű betegségeknek vannak nagyobb mértékben kitéve, mint a nők, hanem nagyobb arányban számolnak be őket érő munkahelyi stresszhatásokról is.",
    "keywords": [],
    "generated_keywords": [
      "EWCS",
      "Európában",
      "hanem nagyobb",
      "kell odafigyelnünk",
      "kitéve munkája során"
    ]
  },
  {
    "major": "Egészségtudományi",
    "year": 2019,
    "title": "A testkép és a táplálkozási attitűdök vizsgálata az erdélyi 18–30 éves nők körében",
    "students": [
      {
        "name": "Coman Andrea",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Krizbai Tímea",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: Sokan küszködnek a világon különféle evészavarokkal, valamint korunk egyik legelterjedtebb betegségévé vált. Egyre több nő érzi úgy, hogy nem megfelelő a kinézete és foglalkoznak a testsúly kérdésével. Az evészavarok kialakulását sok tényező befolyásolhatja, ezért érdemes odafigyelni rájuk. Az ételeknek jóval több szerepük van, mint az alapvető emberi szükségletek kielégítése. A kóros evési szokások nagyban befolyásolják az evészavarok kialakulását. Kutatási cél: A vizsgálat célja felmérni, hogy milyenek az erdélyi 18–30 éves nők evési szokásai, és hogyan vélekednek a testképükről. Módszerek: A vizsgálati populációt az Erdélyben élő 18–30 éves nők képezik. A vizsgálat online kérdőív segítségével történik, amely a demográfiai kérdések mellett standardizált kérdőíveket is tartalmaz: az Evési Attitűdök Tesztjét, a Testi Attitűdök tesztjét és az Evészavar kérdőív testtel való elégedetlenség alskáláját. Eredmények: (1) Feltételezhető, hogy azoknál a nőknél, akik túlzott figyelmet fordítanak a táplálkozásra, inkább kialakul a kóros evési attitűd, mint akik nem. (2) Feltételezhető, hogy azok a nők, akiknek nincs gyerekük, inkább törekednek az ideális testképre, mint akiknek van gyerekük.",
    "keywords": [],
    "generated_keywords": [
      "(2) Feltételezhető",
      "Egyre",
      "Erdélyben élő 18–30",
      "Evési Attitűdök Tesztjét",
      "Evészavar"
    ]
  },
  {
    "major": "Egészségtudományi",
    "year": 2019,
    "title": "Az online egészségkommunikáció hatása az offline egészségkommunikációra és az orvos-beteg kapcsolatra",
    "students": [
      {
        "name": "Ferencz Júlia",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Krizbai Tímea",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezető: Andreassen H. K. és mtsai (2005) Európa 7 országában végzett vizsgálatából kiindulva kiderül, hogy az emberek az internet segítségével tudnak meg információkat egészségi problémájukkal kapcsolatosan. Egy erdélyi lakosságot érintő vizsgálatot szerettünk volna végezni arra vonatkozóan, hogy milyen gyakorisággal használják az internetet e-információs forrásként. Kutatási cél: A vizsgálatunk célja, hogy megtudjuk, milyen mértékben használják az internetet öndiagnosztikai célokra, akár orvoshoz fordulás helyett. Kutatási módszerek: Erre a célra összeállított kérdőív a nemzetközi szakirodalomra volt alapozva. A kutatás egy papíralapú és egy online kérdőív formájába történt, amelyet a Hargita megyei kórházakban és rendelőkben, valamint a Facebook közösségi oldalon töltöttek ki. Kutatási eredmények: Minél magasabb valakinek az iskolai végzettsége, annál megbízhatóbbnak tartja az interneten olvasottakat, ugyanakkor minél tanultabb, annál jobban tudja ezeket az információkat szűrni. Következtetések: Azok a személyek, akik internetet használnak, nagymértékben keresnek rá interneten az adott egészségügyi problémáikra, még mielőtt orvoshoz fordulnának, leginkább informálódás céljából.",
    "keywords": [],
    "generated_keywords": [
      "Andreassen H. K.",
      "Európa 7",
      "Facebook",
      "Hargita",
      "Kutatási"
    ]
  },
  {
    "major": "Egészségtudományi",
    "year": 2019,
    "title": "Szűrővizsgálatokhoz való viszonyulás a gyergyószentmiklósi középkorúak körében",
    "students": [
      {
        "name": "Péter Krisztián",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Lukács Márton Réka",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: Az egészségtelen életmód, mint a dohányzás, alkohol, drogok, túlzott gyógyszerfogyasztás, mozgásszegény életmód, nem megfelelő táplálkozás, sok megbetegedésnek lehet a kiváltó oka. Bizonyos betegségek időben felismerve gyógyíthatóak, azonban fontos, hogy az egészségtudatos életmódnak a szűrővizsgálatokra való járás is része legyen. A vizsgálat célja: felmérni a gyergyószentmiklósi középkorú lakosság szűrővizsgálatokhoz való hozzáállását. A vizsgálatban résztvevő korosztály 40–55 éves férfiak és nők. A vizsgálati eszköz a kérdőív hagyományos papíralapú és online formában. A kérdőív összetétele egy egyéni kérdéssorozatokból összeállított, 16 kérdést tartalmazó vizsgálati eszköz, ami a demográfiai kérdések mellett a szűrővizsgálatokon való részvétel gyakoriságát, okát, motivációját vizsgálja. Eredmények: A nők egészségtudatosabbak, mint a férfi társaik, hiszen a nők (64,90%) fontosabbnak tartják a szűrővizsgálatokat, mint a férfiak (56,50%). A magasabb iskolai végzettséggel rendelkezők (81,50%) fontosabbnak tartják a szűrővizsgálatokon való részvételt, szemben az alacsonyabb iskolai végzettségű társaikkal (14,30%). Összefoglalás: A nők egészségtudatosabbak, mint férfi társaik, hiszen gyakrabban vesznek részt szűrővizsgálaton, és fontosabbnak tartják ezeket. Az alacsony iskolai végzettséggel rendelkezők kevésbé járnak szűrővizsgálatokra, és nem is tartják olyan fontosnak, mint a magasabban iskolázott társaik.",
    "keywords": [],
    "generated_keywords": [
      "Bizonyos",
      "nők",
      "részt szűrővizsgálaton",
      "tartják olyan fontosnak"
    ]
  },
  {
    "major": "Egészségtudományi",
    "year": 2019,
    "title": "Munkanélküliség, munkahelyi kockázatok és egészségi állapot a Maros megyei magyar népességben",
    "students": [
      {
        "name": "Takács Boglárka",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Molnár-Sántha Ágnes",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: Kutatásom témája a munkanélküliség, a munkahelyi kockázatok és az egészségi állapot a Maros megyei magyar népesség körében. Módszerek és eszközök: Mintámat a Maros megye felnőtt munkaképes korú lakosságának nemre, életkorra és településtípusra reprezentatív mintája képezi. Vizsgálati eszközöm a Hungarostudy 2016-ban Erdélyben felvett kérdőíve. Az adatok statisztikai másodelemzésével célom felderíteni a munkanélküliek és a munkaerő-piaci rizikócsoportokba tartozó személyek fizikai egészségi állapotát, összehasonlítani azt a biztonságos körülmények között dolgozókéval. Eredmények: A munkanélküliek egészségi állapotukat közepesnek minősítik. Körükben a leggyakrabban előforduló betegségtünetek az alvással kapcsolatos problémák, fáradtság, energiahiány, derék- és hátfájás. A dohányzási és alkoholfogyasztási szokásaik nem különböznek jelentősen a dolgozó népességétől, ugyanakkor szinte soha nem végeznek testmozgást. A dolgozó népességben az egészségi kockázatok egyike a váltott műszakban végzett munka. Aki váltott műszakban dolgozik, azon belül éjszaka is, annak gyakrabban jelentkeznek testi fájdalmai, mint annak, aki csak nappali váltott műszakban dolgozik. A legjellemzőbb fizikai fájdalom a derék- és hátfájás, a kar-, láb- vagy ízületi fájdalmak. Következtetés: Az eredmények azt mutatják, hogy a munkanélküliek egészségi állapota rosszabb a dolgozó népességénél. A dolgozó népességen belül leginkább a váltott műszakban, éjszaka is dolgozóknál jelentkeznek súlyosabb fizikai egészségi problémák.",
    "keywords": [],
    "generated_keywords": [
      "Az",
      "Hungarostudy",
      "Maros",
      "Mintámat a Maros",
      "Módszerek"
    ]
  },
  {
    "major": "Egészségtudományi",
    "year": 2019,
    "title": "A migrációs hajlandóság és a pályaelhagyási szándék meghatározói az erdélyi egészségügyi ápolók körében",
    "students": [
      {
        "name": "Szász Beáta",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Sántha Ágnes",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: Napjainkban sokszor hallhatunk a migrációról. Különösen súlyos az egészségügyi személyzet (orvosok, szakápolók) külföldi munkavállalása, amely az ország egészségügyi rendszerére rossz hatással van, hiszen létszámhiányt ennek következtében a dolgozók túlterheltségét okozza. Módszerek: Kutatásom célcsoportja az itthon maradott, erdélyi egészségügyi ápolók. Vizsgálatom központi kérdése, hogy ezen személyek mennyire elégedettek munkájukkal, mennyire érzik megbecsülve azt, mekkora körükben a pályaelhagyási, illetve migrációs hajlandóság, és amennyiben vannak ilyen terveik, mivel indokolják azokat. A döntéseik, itthon maradásuk, esetleges migrációs szándékaik okára szeretnék fényt deríteni. Elemzésem alapját a Sapientia EMTE Életminőség Kutatóközpontjának vizsgálata jelenti, melynek keretében standardizált kérdőívet vettünk fel erdélyi magyar és román ápolók körében. Eredmények: Eredményeim arra világítanak rá, hogy a kiégés jeleit mutató ápolók körében nagyobb a pályaelhagyás gondolata. Továbbá, aki eddigi életpályáján már gondolt a pályaelhagyásra, illetve a kivándorlásra, annak alacsonyabb a jóllét-szintje és több a depressziós tünete, mint a munkájával elégedett társának. A pályaelhagyás, illetve kivándorlás gondolata a munkahely szakterületével és a munkaköri régiséggel is összefügg. Következtetések: Az egészségügyet érintő létszámhiány és a dolgozói elégedetlenség olyan jelenségek, amelyek a foglalkoztatáspolitika változtatásával mérsékelhetők. Kutatási eredményeim fontos lépést jelentenek az ápolók helyzetének valós, aktuális felmérésében.",
    "keywords": [],
    "generated_keywords": [
      "Eredményeim",
      "Következtetések",
      "Módszerek",
      "Sapientia EMTE Életminőség Kutatóközpontjának",
      "aktuális"
    ]
  },
  {
    "major": "Egészségtudományi",
    "year": 2019,
    "title": "Véleményvezérek a digitális bennszülöttek egészségmagatartásában",
    "students": [
      {
        "name": "Bordán Dorina Anita",
        "major": "Semmelweis Egyetem, Dietetikus, 2. év"
      },
      {
        "name": "Benke Fruzsina Erika",
        "major": "Semmelweis Egyetem, Dietetikus, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Feith Helga Judit",
        "university": "Semmelweis Egyetem, Egészségtudományi Kar, főiskolai tanár"
      }
    ],
    "content": "Bevezetés: Napjainkban a rohamosan fejlődő digitális eszközök használata szinte nélkülözhetetlen. Ezen korszakot az információgazdagság és a felgyorsuló információszerzés jellemzi, melynek következtében megjelenik az információk ellenőriz(het)etlensége. Kutatásunk egyik célkitűzése volt, hogy felmérjük a 10–15 éves gyermekek egészséggel kapcsolatos referenciacsoportjait. Módszer: Kérdőíves kutatásunkat 2018 tavaszán két budapesti általános iskolában végeztük, magas és alacsony társadalmi státuszú gyermekek körében. A kvantitatív és longitudinális vizsgálatunkban felső tagozatos gyermekek (n=216) vettek részt. Külön kérdésekként vizsgáltuk a lelki egészséghez, dietetikai témákhoz, mozgáshoz és higiénéhez kapcsolódó információforrásokat. Eredmények: Eredményeinkből megállapítható, hogy a legfontosabb referenciacsoportként a szülők jelennek meg a 10–15 évesek körében (a mozgás témát leszámítva) minden vizsgált dimenzióban. Ugyanakkor, míg a családi problémák jelentkezésekor a szülők mellett a barátok, az iskolai problémáknál a tanárok, az egyéb dietetikai és testi higiénével kapcsolatos kérdésekben az orvos jelenik meg fontosabb véleményformálóként. A mozgással kapcsolatos kérdésekben az edzőnek kiemelkedően fontos szerep jut a diákok visszajelzései alapján. Nemek szerinti vizsgálatban a lányoknak fontosabbnak bizonyul a barát véleménye mind családi (p<0,001), mind iskolai problémák (p=0,022) esetében. Következtetés: Adatainkból arra következtethetünk, hogy a 10–15 éves korcsoport egészséggel kapcsolatos információszerzésére az internet közvetlenül nincsen akkora hatással. Amennyiben a fiatalok egészségmagatartását szeretnénk fejleszteni, fontos, hogy nem csak a célpopulációra kell koncentrálni, hanem ezen korosztály véleményformálóira is.",
    "keywords": [],
    "generated_keywords": [
      "Ezen",
      "Kérdőíves",
      "Külön",
      "Módszer",
      "Napjainkban"
    ]
  },
  {
    "major": "Egészségtudományi",
    "year": 2019,
    "title": "internethasználat A legdrágább kincs az egészség",
    "students": [
      {
        "name": "Veres Árpád",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Krizbai Tímea",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Az egészség minden ember legféltettebb kincse - ezt nemcsak a fogyasztó, hanem a gyógyszer készítője és az általa megbízott marketingesek is jól tudják. Emiatt rengeteg, sőt talán az összes kommunikációs csatornát felhasználva próbálják eladni termékeiket a gyógyszergyártók javára, akár abban az esetben is, ha a betegeknek nincs szüksége az általuk előállított és a reklámok által csábítóvá tett termékre. Kutatásom fő célja, hogy lerántsam a leplet a gyógyszeripari marketingre jellemző szokásokról, és kiderítsem, mennyire befolyásolják és manipulálják ezek a hétköznapi gyógyszervásárlót. Hogy inkább a szemnek ígéretes, drágább egészségápoló terméket/gyógyszert vásároljuk-e meg, mintsem azonos alapanyagból készült, azonos hatással rendelkező gyógyszerek közül kiválasszuk azt, amely számunkra elegendő, megfelelő és költséghatékony. Ahhoz, hogy kutatásom elérje célját, kérdőíves módszert használtam fel elsősorban, amelyet a lehető legpontosabb eredmények elérése érdekében saját megfigyelésekkel és gyógyszert vásárlóktól kért interjúkkal egészítettem ki. A kérdőív három, azaz online, kitölthető .pdf és nyomtatott formában volt elérhető, hogy minden korosztály számára kényelmes legyen, így sikerült a kitöltők körét 15 évestől 81 éves személyekig kiterjeszteni. Az így nyert eredményeim segítenek tiszta képet alkotni a 21. századi gyógyszervásárló szokásairól a marketing befolyása alatt.",
    "keywords": [],
    "generated_keywords": [
      "Ahhoz",
      "fogyasztó",
      "gyógyszeripari marketingre",
      "gyógyszert",
      "hanem"
    ]
  },
  {
    "major": "Egészségtudományi",
    "year": 2019,
    "title": "marketingkommunikáció. Kortárs egészségfejlesztés hatékonysága kisiskolások körében",
    "students": [
      {
        "name": "Benke Fruzsina Erika",
        "major": "Semmelweis Egyetem, Ápolás és betegellátás, dietetikus, 3. év"
      },
      {
        "name": "Bordán Dorina Anita",
        "major": "Semmelweis Egyetem, Ápolás és betegellátás, dietetikus, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Feith Helga Judit",
        "university": "Semmelweis Egyetem, Egészségtudományi Kar, főiskolai tanár"
      }
    ],
    "content": "Bevezetés: Számos betegség összefüggésbe hozható a már kisgyermekkorban kialakuló egészségtelen életmóddal, például a kedvezőtlen folyadékfogyasztási szokásokkal. Ezért fontos a minél fiatalabb életkorban megkezdett hatékony egészségfejlesztés. Módszer: Pilot kutatásunk a TANTUdSZ kutatócsoport keretein belül zajlott. Vizsgálatunkat longitudinális (bemeneti és kimeneti) kérdőíves felmérésekkel készítettük 2017 és 2018 tavaszán, 3 budapesti általános iskola (magas és alacsony társadalmi státuszú) kisiskolásai körében (n=206). A kérdőívek adatainak elemzését az SPSS 25 statisztikai elemző programmal végeztük (p<0,005). Eredmények: A kedvezőbb szocioökonómiai státusz egyértelműen pozitív összefüggést mutatott a folyadékfogyasztás mennyiségi ismereteivel (p<0,001). Ez a statisztikailag is kimutatható különbség azonban közvetlenül az intervenció után (p=0,351), majd 3,5 hónap elteltével (p=0,426) kiegyenlítődött a két eltérő státuszú csoport között. A folyadékfogyasztással és egészséggel összefüggő egészségmagatartás és attitűdök esetében is pozitív irányú változás állt be az intervenció hatására. Következtetések: Megállapítható, hogy a kedvezőbb társadalmi státuszú gyerekeknél a bemeneti tudásértékek kedvezőbbek voltak. Ugyanakkor a hátrányos helyzetű gyermekek esetében nagyobb hatásfokkal működnek a programok. Az életkor mellett fontos lenne a szocioökonómiai státuszt is figyelembe venni mint lehetséges bemeneti változót az egészségfejlesztési programok tervezésekor. Anyagi támogatás: A kutatás az MTA, illetve az EMMI ÚNKP-18-1-1 kódszámú programjának támogatásával készült.",
    "keywords": [],
    "generated_keywords": [
      "Anyagi",
      "EMMI ÚNKP-18-1-1",
      "Ezért",
      "Következtetések",
      "Megállapítható"
    ]
  },
  {
    "major": "Egészségtudományi",
    "year": 2019,
    "title": "Serdülő korú lányok ismeretei a HPV-ről",
    "students": [
      {
        "name": "Miklós Stefánia",
        "major": "Sapientia EMTE, MOGYE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Sántha Ágnes",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Bevezetés: A szexuális úton terjedő betegségek (nemi betegségek) a leggyakoribb fertőző betegségek. Több mint 20 féle megbetegedés terjedhet nemi érintkezés útján, ilyen például az egyik legelterjedtebbnek számító HPV-vel való megfertőződés. A HPV (humán papillomavírus) perzisztáló fertőzése a méhnyakrák legfőbb okozója. Kutatási cél: Kutatásom célja megvizsgálni a középiskolás lányok hozzáállását és tudását a nőgyógyászati prevencióról. Azt vizsgálom, mennyire elterjedt körükben a nőgyógyászati kivizsgálás, milyen ismeretekkel rendelkeznek a nemi úton terjedő betegségekről, és mennyire gyakori a HPV elleni védőoltás beadatása vagy ennek szándéka. Kutatási módszerek: A vizsgálatot saját készítésű, önkitöltős kérdőív segítségével végeztem. Az adatfelvétel során személyi jogokat nem sértve biztosítottam a teljes névtelenséget. Eredmények: A kutatási eredményeket tekintve megállapítható, hogy nagyon kevesen voltak nőgyógyászati vizsgálaton. A lányok ismeretei a nemi úton terjedő betegségekkel kapcsolatosan hiányosak. Akiknek aktív szexuális életük van, azok figyelnek a biztonságos nemi aktusra, és védekeznek a nemi úton terjedő betegségek ellen, viszont nem rendelkeznek több tudással a HPV-fertőzés veszélyeiről, mint akiknek nem kezdődött el a nemi életük. Következtetés: Az Európai Unió országai közül Romániában a legmagasabb a HPV-ből eredő halálozás. Eredményeim azt mutatják, hogy a serdülőkorú lányok ismeretei a témában korlátozottak. A nőgyógyászati ismereteket célzott egészségnevelő programokkal szükséges fejleszteni.",
    "keywords": [],
    "generated_keywords": [
      "Az Európai Unió",
      "Bevezetés: A szexuális úton terjedő betegségek",
      "Eredményeim",
      "HPV",
      "Kutatásom"
    ]
  },
  {
    "major": "Egészségtudományi",
    "year": 2019,
    "title": "Nyíregyháza város női lakosságának és várandósainak összehasonlító egészségmagatartás vizsgálata, különös tekintettel a táplálkozásra",
    "students": [
      {
        "name": "Danilás Ilona",
        "major": "Debreceni Egyetem, Egészségügyi Kar, Szülésznő szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Jávorné Dr. Erdei Renáta",
        "university": "főiskolai docens"
      }
    ],
    "content": "Magyarországon, az utóbbi években tapasztalható egészségjavulás elmarad Európa többi államától, így a nők egészségfejlesztése kiemelt jelentőségű feladat. Kiemelt figyelmet kell fordítani a női populáción belül a várandósok csoportjára. Kutatásom célja feltárni és összehasonlítani a nyíregyházi női lakosság és a nyíregyházi várandósok vélt egészségi állapotát, annak befolyásoló tényezőit és egészségmagatartását, különös tekintettel táplálkozási szokásaikra. Módszerek: Kérdőíves, kvantitatív adatfelvétel, melynek célcsoportja egyfelől a nyíregyházi várandósok, illetve a Nyíregyháza Háztartáspanel kutatásban vizsgált női lakosság. A minta nagysága: várandósok 111 fő, nyíregyházi nők 208 fő. Az adatelemzés Microsoft Office Excel 2016 illetve IBM SPSS (V22) programcsomagokkal történt. Eredmények: A mintában a várandósok többsége a 25-30 éves korcsoportból került ki, (42%), a legnagyobb arányban egyetemi végzettségűek (23%). A várandósok közül legtöbben jónak (51%) vagy átlagosnak (41%) ítélték saját egészségüket, hasonlóan Nyíregyháza női lakosságához. Nem fedezhető fel kapcsolat az iskolai végzettség és a zöldség/gyümölcs fogyasztás között (p=0,179), a várandósok édességfogyasztásának gyakorisága is független az iskolai végzettségtől (p=0,476). Következtetések: Az eredmények függvényében elmondható, hogy az egészséges táplálkozásra vonatkozó tanácsok bővítésével, a várandósok részletesebb tájékoztatást és fokozottabb figyelmet igényelnek a szakemberektől.",
    "keywords": [],
    "generated_keywords": [
      "Az",
      "Európa",
      "IBM SPSS",
      "Kiemelt",
      "Kérdőíves"
    ]
  },
  {
    "major": "Egészségtudományi",
    "year": 2019,
    "title": "Önkéntesek a jövő alkimistái",
    "students": [
      {
        "name": "Fekete Éva",
        "major": "Debreceni Egyetem, Egészségügyi Kar, Szociális Munka és Szociális Gazdaság mes- terszak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Huszti Éva",
        "university": "főiskolai docens"
      }
    ],
    "content": "A 21. században az alulról jövő kezdeményezések egy új generációja, a forprofit szektor módszereit és a nonprofit szektor céljait ötvöző társadalmi innovációk sora bukkant fel világszerte, így Magyarországon is. Kutatásomban azt vizsgálom, hogy az egyes társadalmi innovációk ötletgazdái milyen hatások összességével váltak a társadalom alkimistáivá, milyen benyomások ismerhetők fel közös jegyekként életútjukban. A kutatás kitért arra is, hogy mit gondolnak a közösségi szolgálat elvégzésével érintett csoportok a társadalmi alkimistákról, véleményük szerint alkalmas-e a közösségi szolgálat arra, hogy megalapozza a fiatalok későbbi társadalmi felelősségvállalását és aktivitását. Kutatásom felderítő jellegű alapkutatás, logikáját tekintve induktív. Módszerként az interjút és fókuszcsoportos interjút választottam a vizsgált csoportokban. A kutatás egyes aspektusait kérdőíves kutatással támasztottam alá. Munkám során hét társadalmi innovációs projekt ötletgazdájával készítettem mélyinterjút, majd az interjúkban megfogalmazódott közös jegyek mentén fókuszcsoportos beszélgetéseket folytattam nyíregyházi középiskolás csoportokkal a 15-17 éves korosztályban. A kutatás eredményei azt mutatják, hogy a fiatalkori önkéntesség, mint közösségi aktivitás, a korai pozitív tapasztalatok és az önkéntesség élményszerűsége, a felkészítést végzők támogató figyelme, valamint a felkészítésre szánt idő jelentősen befolyásolja a fiatalok későbbi, felnőttkori társadalmi aktivitását. A középiskolás csoportok bár nagyra tartják azokat, akik a közösségért tesznek, a kötelező szolgálatot nem érezik motivációnak arra, hogy csatlakozzanak kezdeményezésekhez.",
    "keywords": [],
    "generated_keywords": []
  },
  {
    "major": "Neveléstudományi",
    "year": 2019,
    "title": "Kontextusfüggő algoritmus vizualizáció",
    "students": [
      {
        "name": "Gál Krisztián-Szilveszter",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 1. év"
      },
      {
        "name": "Dénes Csaba Antal",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Kátai Zoltán",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "A mai digitális világban egyre nagyobb hangsúlyt kap a számítógépes gondolkodás. Az utóbbi évek kutatásai intenzíven vizsgálták, hogy miként lehetne fejleszteni e készséget azáltal, hogy a társadalom minden tagját bevezetjük a számítógépes programozás világába. Ezt a megközelítést az is indokolja, hogy a számítógépes gondolkodás az algoritmikus gondolkodás fogalmából nőtt ki. Másfelől igazi kihívást jelent az oktatási rendszer minden szintjén, mindenkinek programozást tanítani. Ez ugyanis azt feltételezi, hogy már elemi szinten is, hogy középiskolában nem csak reál, hanem humán orientáltaknak is, illetve, hogy egyetemi szinten minden szakon oktatjuk. Egyik sikeres megközelítés az úgynevezett kontextus- alapú programozás-oktatás. Ez alatt azt értjük, hogy egy olyan kontextusban mutatjuk be a programozás alapelemeit, fogalmait és elveit, amely közel áll a célközönséghez. A mérnök hallgatók esetében kiemelten fontos a programozásoktatás. A szakma egyre inkább épít rá. Ennek egyik velejárója, hogy az alapfogalmaknál mélyebben kell behatolni a számítógépes algoritmusok világába. A Sapientián, például, Programozás-2 tantárgyból algoritmustervezési stratégiák is terítékre kerülnek. A dolgozatunkban azt vizsgáljuk, hogy miként lehetne alkalmazni a kontextusalapú megközelítést a dinamikus programozás tanításánál. Két algoritmusvizualizáló eszközt fejlesztettünk ki: egy hardver-közelibbet és egy szoftveralapút. Azt vizsgáltuk, hogy melyik gerjeszt erősebb motivációt informatikus, valamint mérnök hallgatóknál.",
    "keywords": [],
    "generated_keywords": [
      "Ennek",
      "Két",
      "Másfelől",
      "Programozás-2",
      "Sapientián"
    ]
  },
  {
    "major": "Neveléstudományi",
    "year": 2019,
    "title": "Anyanyelvi és idegen nyelvi olvasási szokások és szövegértési képességek közötti összefüggések vizsgálata általános iskolások körében",
    "students": [
      {
        "name": "Kövecsi Katalin",
        "major": "Sapientia EMTE, Tanárképző modul II. szint, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Pletl Rita",
        "university": "Sapientia EMTE, egyetemi professzor"
      }
    ],
    "content": "Az oktatás a kezdetekről napjainkig leginkább az olvasás útján megszerzett ismeretek elsajátítására épült. Manapság azonban a diákok nem csupán könyvekből olvashatnak, olvasási szokásaik, hála a digitális tartalmaknak, mind anyanyelven, mind pedig idegen nyelven jelentősen átalakultak, a változó források pedig egyaránt kihatással vannak a kapott információk értelmezésére és feldolgozására. Felmerül azonban a kérdés, hogy egyrészt tisztában vannak-e az olvasás és idegennyelv-tanulás fontosságával, másrészt képesek-e tökéletesen megérteni az olvasottakat? Kutatásunk, melyben általános iskolások olvasási szokásait és szövegértési képességeit mértük fel, arra a kérdésre keresi a választ, hogy létezik-e kapcsolat az anyanyelvi és idegen nyelvi olvasási szokások és szövegértési képességek fejlettségének színvonala között. Célja, hogy bemutassa és feltárja a köztük lévő viszonyt, valamint képet adjon az általános iskolások anyanyelvi és idegen nyelvi szövegértési képességeinek színvonaláról. Az idegennyelv-tanítás módszertana a szövegértést az idegen nyelv elsajátításának egyik alappilléreként tartja számon, tanításának számos módszere ismert. Az idegen nyelvű szövegértés területén kevés összehasonlító kutatás látott napvilágot, kutatásunkkal ezt a területet is gazdagítani szeretnénk, valamint nyomatékosítani nemcsak az anyanyelvű, hanem az idegen nyelvű szövegértés tanításának fontosságát és jelentőségét.",
    "keywords": [],
    "generated_keywords": [
      "Célja",
      "Felmerül",
      "Manapság",
      "az anyanyelvű",
      "gazdagítani szeretnénk"
    ]
  },
  {
    "major": "Neveléstudományi",
    "year": 2019,
    "title": "Több érzékszerv bevonásával történő programozás oktatása",
    "students": [
      {
        "name": "Szász Renáta",
        "major": "Sapientia EMTE, Informatika, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Kátai Zoltán",
        "university": "Sapientia EMTE, egyetemi docens"
      }
    ],
    "content": "Napjaink digitális világában egyre nagyobb hangsúlyt kap a számítógépes gondolkodás. Az új curriculum értelmében, Romániában a 2017-18-as tanévtől kezdődően már az V. osztályos diákok is kódolni tanulnak. Igazi kihívást jelent, hogy miként tanítsunk különböző korosztályú, érdeklődési körű stb. diákokat számítógépet programozni. Dolgozatomban arra az ősi bölcsességre építek, amit a modern tudomány is igazolt, hogy minél több érzékszervre alapozunk, annál hatékonyabb a tanulás. Hangsúlyosan a látás, hallás, és tapintás (kinesztetikus érzékelés) összehangolt bevonására fókuszáltam elemi algoritmusok tanulásában. Dolgozatom fő célja, hogy az általam fejlesztett szoftvereszköz segítségével megkönnyítsem az informatika algoritmikai alapjainak tanítását, tanulását. Didaktikai szempontból nem elég, ha a tanuló látja a kódot, ahhoz hogy könnyebben megértse, hogyan működik, és mi történik a háttérben, hangeffektusok segítik a tanulásban. Az alkalmazásom egyfajta mankót nyújt a diákoknak, ami által izgalmasabbá válhat számukra a számítógépek programozása. Betekintést nyerhetnek az algoritmika ritmikus világába, láthatják és hallhatják a kódok „szívverését”. Lehetőséget nyújt arra is, hogy a felhasználó az algoritmus ciklus-szerkezete ritmusának „bedobolása” révén generálhasson kódot. Ez egy további ráadást jelent a több érzékszerv bevonásával történő programozás tanulás irányába.",
    "keywords": [],
    "generated_keywords": [
      "Didaktikai",
      "Dolgozatom",
      "Igazi",
      "Romániában",
      "V. osztályos"
    ]
  },
  {
    "major": "Neveléstudományi",
    "year": 2019,
    "title": "algo-RITMIKA: új dimenziók",
    "students": [
      {
        "name": "Osztián Pálma - Rozália",
        "major": "Sapientia EMTE, Informatika szak, 3. év"
      },
      {
        "name": "Nagy Eszter Jáhel",
        "major": "Sapientia EMTE, Informatika szak, 3. év"
      },
      {
        "name": "Cosma Cristian",
        "major": "Sapientia EMTE, Számítástechnika szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Kátai Zoltán",
        "university": "Sapientia EMTE, egyetemi docens"
      },
      {
        "name": "Osztián Erika",
        "university": "Sapientia EMTE, Vezetőtanár, egyetemi tanársegéd"
      },
      {
        "name": "Dr. Jánosi-Rancz Katalin-Tünde",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      },
      {
        "name": "Tekse Csaba",
        "university": "Lateral cég"
      }
    ],
    "content": "Jeannette Wing 2006-os nagy befolyású dolgozatát követően egyre többen zárkóznak fel ahhoz a megállapításhoz, hogy a számítógépes gondolkodás mint negyedik alapvető készség nélkülözhetetlen a XXI. század embere számára. A számítógépes gondolkodás fogalma az algoritmikus gondolkodásból nőtt ki. Mindennapi tevékenységeink jelentős része algoritmusokra épül, melyek között gyakran megtalálhatóak a rendezési, illetve keresési algoritmusok is. Gyakran feltevődik azonban az a kérdés is, hogyan lehet ezeket hatékonyan tanítani. Richard Tunning Pedagogy and Human Movement kutatása is boncolgatja azt a tényt, hogy az oktatás emberi mozgásokkal való fűszerezése az egyik legkifejezőbb módszernek bizonyul. Előzetes kutatások során bebizonyosodott az, hogy a művészet és tudomány ötvözésével kéz a kézben igen jó eredményeket lehet elérni a tanulók teljesítményét tekintve. Ezért döntöttünk úgy, hogy kutatásunkban tovább folytatjuk a tánc és informatika együttesét, kiterjesztve ezt új dimenziókra. A megértésig vezető út öt állomáson vezet végig (videó, animáció, levezénylés, kódépítés és a kód életre keltése). Célunk, hogy az általunk fejlesztett oktatási környezet olyan előadásokat és tanfolyamokat biztosítson, melyek segítik a tanulásban és tanításban való előrehaladást, mindezt érdekes, figyelemfelkeltő, és interaktív módszerekkel fűszerezve. A kifejlesztett online tanulási környezet egyik sajátossága, hogy beállítható az interaktivitás szintje. Azt kutattuk, hogy milyen mértékű interaktivitás optimális az algoritmus megértése szempontjából.",
    "keywords": [],
    "generated_keywords": [
      "Ezért",
      "Gyakran",
      "Human Movement",
      "Jeannette Wing",
      "Richard Tunning Pedagogy"
    ]
  },
  {
    "major": "Neveléstudományi",
    "year": 2019,
    "title": "Agresszió az iskolában - vizsgálat a mezőbándi általános iskolás tanulók körében",
    "students": [
      {
        "name": "Forrai Blanka-Beáta",
        "major": "Sapientia EMTE, Tanárképző 2-es szint, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Szentes Erzsébet",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Iskolai tanácsadóként az a tapasztalatom, hogy az agresszió minden korosztálynál jelen van, csupán a megnyilvánulási formái különböznek. Az agresszió jelen van a hétköznapjainkban, az iskolában, a mindennapos pedagógiai gyakorlatban. Az agresszív gondolatok és késztetések hatást gyakorolnak az egészségre és a társas kapcsolatokra. Úgy vélem, hogy azok a személyek, akik valamilyen agressziónak voltak az áldozatai, lelkileg sérülnek, és szükségük van segítségre. Vallom, hogy ha az agressziót jól tudjuk kezelni, és a megfelelő stratégiát alkalmazzuk, akkor sikerül csökkentenünk annak előfordulását. A kutatás helyszíne a mezőbándi iskola volt. A kutatásomban VI. és VIII. osztályos tanulók vettek részt, összesen 66-on. A kutatásom célja az volt, hogy felmérjem agresszivitás jelenlétét az iskolában, hogy a későbbiekben prevenciós és készségfejlesztő programokkal megelőzni és csökkenteni tudjam azt az intézmény vezetőinek és a tanár kollegáimnak a segítségével. A kutatásomhoz egy 15 kérdésből álló kérdőívet alkalmaztam, amely nyílt és zárt kérdéseket tartalmazott. A kutatásom elérte a célját, ugyanis megbizonyosodtam arról, hogy igenis létezik agresszió az iskolában, inkább a fiúk körében, ugyanis a megkérdezettek többsége azt vallotta, hogy volt már áldozata valamilyen iskolai bántásnak. Ez nem azt jelenti, hogy csak a fiúk viselkednek agresszíven, és hogy csak nekik van szükségük segítségre.",
    "keywords": [],
    "generated_keywords": [
      "akkor sikerül csökkentenünk",
      "jelenlétét az"
    ]
  },
  {
    "major": "Neveléstudományi",
    "year": 2019,
    "title": "problémamegoldó stratégiák Fedezd fel a benned rejlő tehetséget! Vizsgálat a Bolyai Farkas Elméleti Líceum 11. osztályos tanulói körében",
    "students": [
      {
        "name": "Mátéfi-Takács Tamara",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Szentes Erzsébet",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Minden tanuló a szíve mélyén arra vágyik, hogy olyan pályát választhasson, amiben tehetséges, és amit szeret. Mindenki csodálja a tehetséges embereket, de gondolt-e arra, hogy mindannyiunkban rejlik tehetség? Ez tudományosan bizonyítható dr. Caroline Leaf agykutató könyve alapján, melynek címe: Tehetség vagy! Agyunk ugyanis domináns és kevésbé domináns intelligenciapillérekből épül fel. Minden embernek vannak erősségei, csak azt felszínre kell hozni és tovább kell fejleszteni. Egy kérdőíves vizsgálat során a Bolyai Farkas Elméleti Líceum öt osztályában felmértük a tanulók tehetségprofilját, adatokat gyűjtöttünk arról, hogy a vizsgált tanulóknak milyen tapasztalataik és meglátásaik vannak a saját tehetségükkel kapcsolatosan, és rákérdeztünk a továbbtanulási terveikre. Jelen dolgozatban röviden tárgyaljuk a téma elméleti alapjait, bemutatjuk a Leaf (2014) által ismertetett hét tehetségpillért, valamint a vizsgálat eredményeit. Rávilágítunk arra, hogy a vizsgált tanulók körében milyen összefüggések írhatók le a jelenlegi szak, a jellemző tehetségprofil és a továbbtanulás szempontjából választott szakirány között.",
    "keywords": [],
    "generated_keywords": [
      "Bolyai Farkas Elméleti Líceum",
      "Caroline Leaf",
      "Jelen",
      "Leaf",
      "Minden"
    ]
  },
  {
    "major": "Neveléstudományi",
    "year": 2019,
    "title": "Egészségnevelés az óvodában és általános iskolában",
    "students": [
      {
        "name": "Bodor Krisztina- Mária",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Horváth Zsófia",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Az egészségnevelés a személyiségre irányuló nevelőtevékenység, amely az emberek tudatos és felelősségteljes egészségmagatartásának kialakítását célozza meg. Napjainkban nagyon fontos, hogy ez a nevelőtevékenység minél hamarabb elkezdődjön annak érdekében, hogy észrevétlenül készséggé alakuljon az egészséges életmód iránti érdeklődés. Dolgozatomban az egészségnevelés feladata és célja mellett arra szeretnék rávilágítani, hogy fontos ezt már óvodában és kisiskolában elkezdeni, mivel ha ekkor beépül a gyerekek tudatába, később hatékonyabban tudják alkalmazni. A gyerekekben ekkor épül ki a prioritások hierarchikus rendszere, amely a majdani életmódot, életvitelt és életminőséget fogja jellemezni. Éppen ezért fontos, hogy az óvoda és az iskola miként járul hozzá az egészség alakításához. Nem mellékes az sem, hogy a tanulókban tudatosítani tudja a pedagógus, hogy mindennapi életük saját maguk által alakítható, megtervezhető, melyben felelősségük van. A pedagógusok a „miértek” megmagyarázása mellett leginkább példamutató életvitellel tudják motiválni a gyerekeket. Lényeges, hogy a gyerekek megértsék az egészség fogalmának fontosságát, és részesei legyenek olyan helyzeteknek, amelyek ezt alá is támasztják.",
    "keywords": [],
    "generated_keywords": [
      "Lényeges",
      "Napjainkban",
      "járul hozzá",
      "pedagógus",
      "tudja"
    ]
  },
  {
    "major": "Neveléstudományi",
    "year": 2019,
    "title": "A táncoktatás fejlesztő hatása a tanulási kompetenciára",
    "students": [
      {
        "name": "Kolozsi Edina",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Horváth Zsófia",
        "university": "Sapientia EMTE, egyetemi adjunktus"
      }
    ],
    "content": "Az általam kiválasztott témakör a tánc fejlesztő hatását tanulmányozza a diákok tanulási kompetenciájára. A dolgozatban nagyobb hangsúlyt fektettem a szakirodalmi áttekintésre, hiszen nemrég kezdett el foglalkoztatni ez a témakör. Jelenleg táncoktatóként úgy véltem felfedezni, hogy a táncoktatás nem csak a fizikai tartásra, hanem lélektanilag is fejlesztő hatást gyakorol. Kutatási motivációm jövőbeni oktatási terveimhez szorosan kapcsolódik, e kutatás célja tehát, hogy feltárjam miként hat a tánc egy egyén tanulási kompetenciájára. A kutatásban az esettanulmány módszerét alkalmaztam. E kutatás hozzájárul egy kreatív keresztény tánccsoport kifejlesztéséhez, ezért röviden ez is bemutatásra kerül a dolgozat során.",
    "keywords": [],
    "generated_keywords": [
      "Jelenleg",
      "Kutatási",
      "ezért",
      "hanem lélektanilag"
    ]
  }
]