[  
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2023,
    "title": "Language learning in the 21st century: the effect of social media on the development of language skills",
    "students": [
      {
        "name": "Biró Brigitta-Beáta",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fazakas Noémi",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "In this study, the main focus is on how social media affects and shapes our language acquisition, especially in the case of the English language for Hungarian students. While social media can be a valuable tool for developing linguistic competence, I argue that basic skills can be acquired within traditional language learning. My goal was to observe this said impact on students, noting possible advantages and disadvantages. My study has both a quantitative and qualitative part. The quantitative part consists of an online questionnaire that was filled by the students of Sapientia Hungarian University of Transylvania, where they had the opportunity to express their experiences with social media and traditional language learning, as well as with online apps and tools, which aid the development of new language skills. The qualitative part includes a group of three students, who used the Duolingo language learning app for a month. During this process, the students observed and assessed not only their development, but also their motivation and commitment towards language learning on a daily basis.",
    "keywords": [
      "social media",
      "language learning",
      "informal language",
      "online communities and platforms",
      "language learning tools"
    ],
    "generated_keywords": [
      "digitális nyelvtanulás",
      "motivációs tényezők",
      "tanulói önreflexió"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2023,
    "title": "Societal Multilingualism in Szeklerland in a Linguistic Ethnographic Approach",
    "students": [
      {
        "name": "Csomor Ágota",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fazakas Noémi",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "The aim of the present paper is to investigate the success of communication events when English is used as a mediating language by a non-local interlocutor in Székelykeresztúr. The small town is located in Szeklerland and it is home to the Youth Association from Transylvania, which has now been organizing a volunteering programme for foreign volunteers for 10 years. The data is collected through semi-structured qualitative interviews conducted with representative members of the local population who have been in contact with volunteers from abroad. The topics discussed include: attitudes towards Romanian, towards foreign languages, societal multilingualism, communication strategies in multilingual settings, etc. The results show a strong correlation between the success of communication and the age of the local resident involved in communication in a foreign language.",
    "keywords": [
      "societal multilingualism",
      "linguistic attitudes",
      "linguistic accommodation",
      "communication strategies",
      "Transylvania"
    ],
    "generated_keywords": [
      "multikulturális kommunikáció",
      "önkéntesprogramok hatása",
      "nyelvhasználati stratégiák"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2023,
    "title": "Formula One Terminology",
    "students": [
      {
        "name": "Fabry Koppány",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Kovács Gabriella",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "Formula One has a vast collection of terms, ranging from the more basic ones shared with the terminology of road cars, to highly specialized ones like DRS, ERS, and turbo-hybrid engines. This study explores these terms, their evolution over the sport’s history, and how they compare to everyday vehicle terminology. A survey was also conducted to assess how new fans adapt to this specialized language and which age groups are most interested in it.",
    "keywords": [
      "terminology",
      "Formula One",
      "technical language",
      "specialized languages"
    ],
    "generated_keywords": [
      "autósport szókincs",
      "technikai kifejezések",
      "szakszókincs elemzés"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2023,
    "title": "A fordítási munka folyamatának elemzése saját fordítás elkészítése révén",
    "students": [
      {
        "name": "György Simon Dalma",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Sárosi-Márdirosz Krisztina",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "The paper presents the theoretical and practical process of translation based on Emily Brontë’s novel ‘Wuthering Heights’. It includes translation challenges, the concept of dynamic equivalence, and translator responsibility. The practical part analyzes the translator’s own work and compares it to a previous translation by István Sőtér using parallel text analysis.",
    "keywords": [
      "fordítási műveletek",
      "fordítási nehézségek",
      "ekvivalencia",
      "saját fordítás",
      "párhuzamos szövegelemzés"
    ],
    "generated_keywords": [
      "fordítói döntéshozatal",
      "irodalmi szövegek elemzése",
      "fordítói felelősség"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2023,
    "title": "Retranslating literary works",
    "students": [
      {
        "name": "Imre Beáta",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fazakas Noémi",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "The study discusses the retranslation of literary works due to the evolving nature of language. It highlights the work of Hungarian translators Ádám Nádasdy and Imre Barna, exploring their distinct approaches to Shakespeare and ‘The Catcher in the Rye’. The analysis reflects on the modernization of classic texts to resonate with contemporary audiences.",
    "keywords": [
      "retranslation",
      "literary translators",
      "outdated works",
      "translation criticism"
    ],
    "generated_keywords": [
      "újrafordítás célja",
      "fordítási stílusváltás",
      "klasszikus művek modernizálása"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2023,
    "title": "\"Who is Bruno?\" Difficulties of translating songs in Encanto",
    "students": [
      {
        "name": "Nagy Attila",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Imre Attila",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "The purpose of this paper is to provide a deeper understanding into the many difficult aspects of song lyrics translation, exemplified with the 2021 Disney movie Encanto. In the introductory part, I discuss the role of music as an international language and the general aspects of audio-visual translation (AVT), mentioning the particular difficulties of music translation. In the practical part, I compare the original English version of four songs from the movie with their Hungarian versions. The comparison is based on technical aspects, such as character count and number of syllables, but also on the different translation strategies used in the Hungarian version. Many metaphors and wordplays are found in these songs, which makes it an intriguing task even for a skilled translator. The aim of my study is to highlight the difficulties of this emerging field of AVT, and to present the process and challenges a translator faces during song lyrics translation.",
    "keywords": [
      "audio-visual translation",
      "movie",
      "lyrics",
      "Disney",
      "challenges"
    ],
    "generated_keywords": [
      "dalfordítási nehézségek",
      "audiovizuális fordítás",
      "Encanto szövegelemzés"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2023,
    "title": "Possibilities to render acronyms and initialisms spotted in House M.D.",
    "students": [
      {
        "name": "Orbán Beáta",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Imre Attila",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "This study examines the use of abbreviations, acronyms, and initialisms in the American medical drama series House M.D. by David Shore. The use of abbreviations in the medical field is common, which is why this TV series seems a logical choice. In the theoretical part, I provide background on abbreviations and translation challenges. The practical part analyzes over 400 terms, discussing their classification and translation into Hungarian subtitles. The conclusion addresses possible strategies for subtitle translation of acronyms and initialisms.",
    "keywords": [
      "acronym",
      "initialism",
      "TV-series",
      "subtitle",
      "database"
    ],
    "generated_keywords": [
      "rövidítések fordítása",
      "orvosi szakszókincs",
      "feliratozási stratégiák"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2023,
    "title": "The linguistic landscape of Baraolt",
    "students": [
      {
        "name": "Orbán Péter Zsigmond",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Biró Enikő",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "This study investigates the linguistic landscape of Baraolt, a small town in Transylvania. It focuses on signs in public spaces, especially in a bilingual or multilingual setting. Findings suggest Hungarian is dominant in signage, even in governmental contexts, despite regulations requiring Romanian. The research employs a mixed-method approach, analyzing top-down and bottom-up signs, to understand language preference and visibility in public signage.",
    "keywords": [
      "linguistic landscape",
      "multilingualism",
      "Transylvania",
      "language use in public spaces"
    ],
    "generated_keywords": [
      "közterületi feliratok",
      "nyelvpolitika",
      "nyelvi láthatóság"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2023,
    "title": "Narratives of masculinity and femininity among Szekler youth. A linguistic ethnographic study",
    "students": [
      {
        "name": "Simó Anita",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fazakas Noémi",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "This qualitative linguistic ethnographic research investigates verbal aggression and gender roles among Szekler youth. Two focus groups were formed (four males, four females) from a similar cultural background. Discussions explored gender, power, verbal abuse, and cultural influences. The findings highlight differences and overlaps in gendered communication, contributing to the understanding of masculinity, femininity, and language-based violence in a Szekler context.",
    "keywords": [
      "linguistic aggression",
      "verbal abuse",
      "narrative",
      "Székely culture",
      "femininity and masculinity"
    ],
    "generated_keywords": [
      "nyelvi erőszak",
      "nemi szerepek",
      "fókuszcsoportos kutatás"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2023,
    "title": "The linguistic landscape of Odorheiu Secuiesc",
    "students": [
      {
        "name": "Szabó Bence",
        "major": "Sapientia EMTE, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Biró Enikő",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "This paper explores the linguistic landscape of Odorheiu Secuiesc by analyzing public signs, especially in the economic sector. The study uses both quantitative and qualitative methods to document language use in public spaces. Results show multilingualism with significant Hungarian presence, alongside Romanian and English. The research reflects on language policy and identity in a multilingual urban environment.",
    "keywords": [
      "linguistic landscape",
      "bilingualism",
      "multilingualism",
      "minority language",
      "signs in economic space",
      "Odorheiu Secuiesc"
    ],
    "generated_keywords": [
      "nyelvi tájkép",
      "gazdasági szektor nyelvhasználata",
      "multikulturális városi tér"
    ]
  },
  {
  "major": "Alkalmazott nyelvtudományok",
  "year": 2023,
  "title": "Fantasizing about possible translations of scientific terms. The case of The Paradox Hotel",
  "students": [
    {
      "name": "Székely Kriszta-Rebeka",
      "major": "Sapientia EMTE, Fordító és tolmács szak, 2. év"
    }
  ],
  "teachers": [
    {
      "name": "dr. Imre Attila",
      "university": "Sapientia EMTE"
    }
  ],
  "content": "This paper deals with the linguistic challenges and solutions that may occur during the translation of a newly released science fiction novel named The Paradox Hotel by Rob Hart. The first part of this paper will contain a brief introduction into the field of translation and the difficulties that may occur during the translation of literature. As I am interested in the field of science fiction, I provide a few relevant definitions and draft a possible distribution of science fiction into specific sub-genres. In the practical part of the research, I investigate the linguistic difficulties a literary translator might have to face while translating this specific novel by having created a term base with over 100 science fiction and criminology terms with their possible Hungarian translations. A particular attention is paid to the specific terms that only exist in the novel of Rob Hart, discussing its possible Hungarian renditions, as the novel has not been translated into Hungarian yet. The main objective of this paper is to highlight the challenges of literary translators and how much creativity and research is required to coin a single, seemingly simple term within the genre of science fiction.",
  "keywords": [
    "literary translation",
    "science fiction terms",
    "term base",
    "English",
    "Hungarian"
  ],
  "generated_keywords": [
    "sci-fi szókincs",
    "fordítói kreativitás",
    "műfajspecifikus terminológia"
  ]
},
  {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "A közösségi média hatása a Shein fast fashion termékek vásárlóinak fogyasztói magatartására",
    "students": [
      {
        "name": "Achim Timea-Beáta",
        "major": "Sapientia, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Vajda András",
        "university": "Sapientia Erdélyi Magyar Tudományegyetem"
      }
    ],
    "content": "A divatnak mindig is nagyon fontos szerepe volt a társadalomban, hiszen ezáltal kommunikálunk magunkról, személyiségünkről, társadalmi és gazdasági helyezkedésünkről, értékrendünkről. A divatban kifejezésre jut, hogy miként viszonyulunk önmagunkhoz, a nemünkhöz, a korunkhoz és a testünkhöz. Napjainkban a divattal és a testtechnikákkal kapcsolatos elgondolások és elvárások egyre inkább a média által közvetített kommunikációban válnak láthatóvá és fogyaszthatóvá. Dolgozatom témája a divatkommunikáció, azt vizsgálom, hogy a fiatalok miként kommunikálnak a divatról és ezt milyen online felületeken keresztül tesszik meg. Kutatásom során két divattal kapcsolatos honlap és egy Facebook vásárlói csoport elemzésén keresztül szeretném szemléltetni azt, hogy a fiatalok, miként kommunikálnak egymással a ruhákról, valamint kiegészítőkről. Egyrészt egy fast fashion weboldalt fogok összehasonlítani egy slow fashion oldallal, ahol megnézem, hogy a gyors és a lassú divat termékeit bemutató oldalak miben különböznek, illetve hasonlítanak egymásra, másrészt egy a Shine Fashion nevű kínai online árúház termékeire szakosodott Facebook oldal kommunikációját elemzem. A honlap és közösségi-média elemzésen kívül interjút készítek olyan személyekkel, akik rendeltek már az oldalakról és elmondják személyes tapasztalataikat és véleményüket.",
    "keywords": [
      "fast fashion",
      "divat",
      "divatkommunikáció",
      "fogyasztás",
      "slow fashion"
    ],
    "generated_keywords": [
      "fiatalok médiahasználata",
      "online vásárlás",
      "fogyasztói attitűd"
    ]
  },
  {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "A néptánc digitális térbe való áthelyeződése a járványidőszak alatt",
    "students": [
      {
        "name": "Kacsó Andrea",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Vajda András",
        "university": "Sapientia Erdélyi Magyar Tudományegyetem"
      }
    ],
    "content": "A Covid-19 világjárvány alapjaiban forgatta fel az emberek mindennapjait, a társadalmi interakciókat, a kultúrát és a kommunikációt egyaránt. Erre a sok tekintetben átalakult léthelyzetre használja a szakirodalom a járványlét fogalmát, mely a járványnak a társadalomra gyakorolt hatásainak sokrétűségére utal: a pszichológiai hatások, gazdasági, egészségügyi hatások mellet pszichológiai, kulturális és a kommunikációra gyakorolt hatásokat említhetjük. Ez a léthelyzet a társadalom egészére nagy hatást gyakorolt, így például a néptánccsoportokra és a néptánc iránt érdeklődő közösségekre is, akiknek aktivitásait szintén a digitális térbe irányította át, odalokalizálta a járvány visszaszorítása miatt hozott egészségügyi intézkedések sora. Sok más kulturális egyesülethez hasonlóan a néptáncosoknak is jelentős kihívásokkal kellett szembenézniük a Covid-19 világjárvány miatt. A fizikai térben megrendezett előadások és próbák közegészségügyi intézkedések miatt elmaradtak vagy korlátozódtak, így a legtöbb néptáncosnak nem volt lehetősége a személyes részvétellel tartott próbákon és előadásokon részt venni. Mivel a karantén időszakában kialakított és a digitális térben végzett tevékenységek ma is jól dokumentálhatóak és könnyen visszakereshetőek, úgy gondolom, hogy érdemes megvizsgálni a gyakorlatok sokféleségét, azt, hogy milyen alternatívák álltak a néptánc kedvelői és a néphagyományok ápolásával foglalkozó szakemberek és amatőrök számára ebben az említett időszakban.",
    "keywords": [
      "folklór",
      "folklorizmus",
      "karantén",
      "közösségi média",
      "népi kultúra",
      "néptánc"
    ],
    "generated_keywords": [
      "digitális folklór",
      "járványhatás a kultúrára",
      "online közösségek"
    ]
  },
  {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "Reprezentációk, tudásszerkezetek a Mesterséges Intelligenciáról",
    "students": [
      {
        "name": "Kedei Tímea-Dianna",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fülöp Otília",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "A technológia gyors fejlődésének köszönhetően az emberek nagy része nem csak hallott már a mesterséges intelligenciáról (MI), hanem próbálta is, valamilyen formában használta vagy tesztelte. Napról napra, a szemünk láttára válik életünk megkerülhetetlen részévé, mindenhova beszivárog. Éppen ezért fontos, milyen viszonyt alakítunk ki a technológiai fejlődés ezen új aspektusával kapcsolatban, milyen létezőnek tekintjük, hogyan gondolkodunk róla. A szépirodalmi és tudományos írásművek a gondolkodás olyan terepei, amik őrzik és felmutatják a tapogatózás, a kísérletezés változásait, és hozzá is járulnak új viszonyformák, megközelítések, képzetek kialakulásához. Dolgozatomban tartalomelemzéssel ezeket a hiedelmeket, képzeteket kutatom, azt, hogy hogyan beszélnek, írnak a mesterséges intelligenciáról a szépirodalmi és a tudományos művek szerzői.",
    "keywords": [
      "mesterséges intelligencia",
      "antropomorfizmus",
      "Eliza-effektus",
      "irodalom",
      "reprezentáció",
      "tudásszerkezet"
    ],
    "generated_keywords": [
      "MI irodalmi képe",
      "technológiai diskurzus",
      "társadalmi percepciók"
    ]
  },
    {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "A saját identitás kifejezése átvett idézetekkel a közösségi médiában",
    "students": [
      {
        "name": "Mátyus Anita-Gabriella",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fülöp Otília",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "A dolgozatom fő témája a Facebook közösségi oldal felhasználóinak idézetválasztása. Meglátásom szerint az idézetek magunkról és a világról kialakított képünk kommunikációjának eszközei. Egy nagyobb kép kialakításának a kedvéért két szegmensen fut végig a vizsgálat. Az egyik ilyen vonal a népi kultúra kedvelőinek bejegyzéseit vizsgálja, míg a másik a keresztény identitásukat felvállaló vonalon halad. A kutatás során a tartalomelemzés módszertanát használom. Kutatásom során több támpont szerint igyekszem átnézni ezeket a bejegyzéseket és hangsúlyt fektetni arra is, hogy az idézetek milyen eredetűek és mit üzennek, illetve hogyan szabják a konkrét helyzethez az egyes személyek. Az eredményekből várhatóan kiderül, hogy fel lehet-e állítani egy tipológiát a Facebook-os idézethasználatra, és az is, hogy van-e összhang a Facebook-on kialakított kép és a bejegyzéseik szövege között.",
    "keywords": [
      "Facebook",
      "idézetek",
      "megosztás",
      "identitás",
      "nyilvánosság"
    ],
    "generated_keywords": [
      "idézethasználat",
      "online identitás",
      "tartalomelemzés"
    ]
  },
  {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "Üzleti célú tevékenység a közösségi médiában",
    "students": [
      {
        "name": "Szántó Sarolta",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Vajda András",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "A covid-19 világjárvány alatt megugrott azok száma, akik az online térben bonyolították le a vásárlásaik jelentős részét. Mivel az emberek nem mehettek üzletekbe vásárolni, így mindent online rendeltek és vásároltak meg. Az online vásárlás előnyei között elsősorban a kényelmi szempontok említhetőek: nem kell elmennie az üzletbe, nem kell elviselnie a tömeget, a kiválasztott termékeket nem kell hazaszállítania, mert házhoz szállítják és az egész vásárlási folyamat sokkal praktikusabb. Ugyanakkor a vásárlót nem költekezik mértéken felül. Ha az online vásárlást a pénzkeresés oldaláról, a munkavégző felől vizsgáljuk, akkor meg az mondható el, hogy az online munkát végző, az otthona kényelméből végezheti az üzleti tevékenységet, akkor amikor ideje adódik rá, illetve ezt teheti egy főállás mellett vagy egyetemistaként is. Dolgozatomban az online üzleti tevékenységen belül az internetes MLM pénzkeresésnek a Facebook közösségi oldalon működő formáját vizsgálom. A Facebookon többféle csoportot találhatunk, melyek különbféle terméket reklámoznak és árusítanak. Akik ezt a fajta online munkát végzik, azoknak törekednie kell arra, hogy az eladásra kínált termékekről olyan képeket készíthessenek/szerkesszenek, melyek elnyerik a vásárlók tetszését, felfigyelnek a termékre. Emellett egy termék akkor lesz igazán felkapott, ha saját tapasztalatainkat is megosztjuk róla, mert az emberek elsősorban azokat a termékeket vásárolják meg, amelyekről mások már elmondták a véleményüket, amelyek mások számára már beváltak. A dolgozatban egy esetelemzést készítek el, melyben személyes tapasztalataimat is felhasználom.",
    "keywords": [
      "online üzleti tevékenység",
      "hálózati marketing",
      "közösségi média",
      "üzleti kommunikáció"
    ],
    "generated_keywords": [
      "MLM a Facebookon",
      "digitális vállalkozás",
      "fogyasztói bizalom"
    ]
  },
  {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "Önreprezentáció és valóságkérdés a BeReal közösségi média felületén",
    "students": [
      {
        "name": "Tankó Tamás",
        "major": "Sapientia EMTE, Kommunikáció és Közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Vajda András",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "Dolgozatom témáját a BeReal nevű közösségi oldal, valamint az alkalmazás használatával kapcsolatos gyakorlatok elemzése képezi. Elsősorban azt vizsgálom, hogy mi az az élménytöbblet, amelyet ez az alkalmazás nyújt, amit a korábbi közösségi oldalak nem, és ez miként hat a felhasználók mindennapi rutinjaira, identitására, önmegjelenítésére és valóságfelfogására. Kutatásomhoz elsősorban az interjúkészítést módszerét használtam, de ezen kívül résztvevői megfigyelést és önmegfigyelést is alkalmaztam. A kutatásom interjú alanyai azon 19–23 éves felhasználók voltak, akik aktívan, napi rendszerességgel posztolnak a BeReal fiókjukra. A kutatásom során 10 interjút készítettem el. Az esettanulmány fókuszában elsősorban a felhasználói módozatok, a valóság reprezentációja és a valóság képének szimulálása áll, valamint az a kérdés, hogy miért is vált hirtelen ilyen népszerűvé ez az alkalmazás, és hogyan változtatja/változtathatja meg a társadalom közösségi médiáról alkotott képét.",
    "keywords": [
      "BeReal",
      "közösségi média",
      "önreprezentáció",
      "valóságábrázolás"
    ],
    "generated_keywords": [
      "digitális önkép",
      "interjús kutatás",
      "valóságszimuláció"
    ]
  },
    {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "Online és offline vallásgyakorlás egymásmellettiségének változatai",
    "students": [
      {
        "name": "Zsombori Nóra",
        "major": "Sapientia Erdélyi Magyar Tudományegyetem, Kommunikáció és közkapcsolatok, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fülöp Otília",
        "university": "Sapientia Erdélyi Magyar Tudományegyetem"
      }
    ],
    "content": "A dolgozatom témája az emberek alkalmazkodása a társadalmi és technológiai változásokhoz az online, illetve az offline vallásgyakorlásban. A dolgozat vállalkozik ezen kétfajta mód előnyeinek és hátrányainak meghatározására. Cél megtalálni azt az arany középutat, amelyen mindamellett, hogy kihasználjuk az online világ előnyeit, megtarthatjuk a közösség értékét, élve az offline tér helyettesíthetetlen lehetőségeivel.\nKutatási hipotézisek:\n- az online vallásgyakorlás új kapukat nyit a tér és idő legyőzésével, függetlenné teszi (vallási hovatartozás szempontjából) az embereket\n- a digitális összekapcsolódás azon felhasználók esetében lesz erős, akik vallási identitás szerint „vallásosak az egyház tanítása szerint” és egy lokális offline közösséghez is tartoznak, azon felhasználók, akik magukat úgy jellemzik, hogy „vallásos vagyok a magam módján”, használnak ugyan digitális felületeket, de csak kis mértékben a hagyományos egyházak digitális felületeit\n- az online vallásgyakorlás megváltoztatja a fontossági sorrendeket, eltünteti a tárgyias jelleget, csorbíthatja a közösségi értékeket, de ugyanakkor kiegészít a vallásgyakorlást új lehetőségekkel\nKutatásomhoz a kérdőíves módszert választottam. A parajdi református egyházközösség 50 tagján végzek felmérést márciusban. A mintavétel véletlenszerű lesz.",
    "keywords": [
      "vallás",
      "online vallásgyakorlás",
      "offline vallásgyakorlás",
      "közösség"
    ],
    "generated_keywords": [
      "digitális hitgyakorlás",
      "vallási identitás",
      "társadalmi adaptáció"
    ]
  },
  {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "Az orosz-ukrán háború reprezentációja a magyarországi médiában",
    "students": [
      {
        "name": "Tőkés József Roland",
        "major": "Sapientia Erdélyi Magyar Tudományegyetem, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Vajda András",
        "university": "Sapientia Erdélyi Magyar Tudományegyetem"
      }
    ],
    "content": "Dolgozatomban a 2022. február 24-én kirobbant orosz-ukrán konfliktus magyarországi médiareprezentációjának elemzését végzem el, két tévécsatorna, az ATV és a Hír Tv háborúval kapcsolatos tartalmainak vizsgálatára támaszkodva. Magyarország esetében a háború kitörését megelőző időszak médiatartalmainak alakulását meghatározták a közelgő parlamenti választások, a politikai pártok üzenetei, ezért a háborúval kapcsolatos híradások is gyakrabban kaptak politikai színezetet, a háborús hírek gyakran váltak a választási kampány részévé, a háborúval kapcsolatos híradásokat a különböző pártok igyekeztek a maguk számára, politikai célokra kisajátítani.\nA dolgozatomban azt vizsgálom meg, hogy hogyan mutatják be a különböző pártideológiákat kiszolgáló tévécsatornák a háborút. Éppen ezért a magyarországi médiakínálatból egy a jobboldalhoz közeli televíziós csatornát (Hír tv), valamint egy a baloldalhoz közeli csatornát, (ATV) választottam ki. Az elemzés során a tartalomelemzés módszerét alkalmaztam, amely segítségével megfigyeltem a médiaorgánumok attitűdjét, illetve azt, hogy milyen szempontból mutatják be a háborúval kapcsolatos híreket.",
    "keywords": [
      "háborús reprezentáció",
      "ATV",
      "Hír Tv",
      "média",
      "politikai diskurzus"
    ],
    "generated_keywords": [
      "tartalomelemzés",
      "pártos média",
      "médiareprezentáció"
    ]
  },
  {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "Társadalomkritika a Szégyentelenek című sorozatban",
    "students": [
      {
        "name": "Marosi Réka",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Vajda András",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "A Szégyentelenek című, 11 évados drámasorozat a Gallagher család mindennapjait mutatja be, akik Chicago déli részén élnek szerény körülmények között, szinte egyik napról a másikra. A családnak nemcsak az anyagi nehézségekkel és mentális problémákkal kell megküzdenie, hanem számos társadalmi konvencióval is szembe kell nézniük: az apa alkoholista, az anya és az egyik gyermek bipoláris zavarban szenved, a család lakhatási körülményei és megélhetése bizonytalan, ezért a családtagok szinte bármilyen alantas munkát kénytelenek elvállalni, azért, hogy némi pénzhez jussanak. Ugyanakkor a város déli részét uraló maffia bandáktól, a bűnözéstől és a drogoktól is távol kell tartaniuk magukat, ami gyakran lehetetlen küldetésnek minősül.\nTanulmányomban azt vizsgálom meg a sorozat elemzésén keresztül, hogy a társadalomkritika milyen formában jelenik meg a populáris kultúrában. Elemzésem a sorozatban megjelenő társadalmi problémák bemutatására koncentrál. Azt vizsgálom meg, hogy a filmben miként jelennek meg a kortárs amerikai társadalomra jellemző problémák, mint az alkoholizmus, a szegénység, a rasszizmus, a homofóbia, a bűnözés stb. Kutatásom során a tartalomelemzés módszerével élek, az első két évadot részletesebben, míg a többi kilenc évadot csak általánosan érintem. A sorozat bemutatása során azt követem nyomon, hogy miképpen érhető tetten a társadalomkritika a szereplők, a helyszínek, a cselekmény és a nyelvezet szintjén. Kutatásom abból az alapfeltevésből indul ki, hogy a Szégyentelenek humorba csomagolt társadalomkritika egy példája.",
    "keywords": [
      "Szégyentelenek",
      "alkoholizmus",
      "bipolaritás",
      "rasszizmus",
      "társadalomkritika",
      "maffia",
      "Shameless"
    ],
    "generated_keywords": [
      "populáris kultúra",
      "szociális problémák",
      "sorozatelemzés"
    ]
  },
  {
  "major": "Kommunikációtudomány",
  "year": 2023,
  "title": "A közösségi média hatása az otthon végzett testmozgásra",
  "students": [
    {
      "name": "Barabási Mária-Magdolna",
      "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok , 2. év"
    }
  ],
  "teachers": [
    {
      "name": "dr. Vajda András",
      "university": "Sapientia EMTE"
    }
  ],
  "content": "Az online térben egyre nagyobb teret nyernek a különböző az otthoni sportolást, a különböző online edzésformákat népszerűsítő tartalmak. Számos személyi edző kezdte el az online térben is hirdetni, népszerűsíteni edzői tevékenységét. Az online torna, azaz egy-egy személyi edzőnek a közösségi médiában közzétett videóanyaga alapján végzett otthoni testmozgás a Covid-19 járvány időszaka alatt nagy népszerűségre tett szert.\nA tanulmányomban az online torna egy típusát, a közösségi médiában megosztott videók segítségével otthonról végzett jógagyakorlatokat vizsgálom. Azt elemzem, hogy a közösségi média miként támogatja az otthoni testmozgás végzését, milyen formában valósul meg az edző és a gyakorlatokat végző személyek interakciója, milyen kommunikációs csatornákat használnak, illetve miként szerveződnek az online torna köré online közösségek és ezek milyen témákról és miként kommunikálnak. Dolgozatomban az online tornát sajátos mozgáskultúraként és szabadidős tevékenységként értelmezem.",
  "keywords": [
    "online torna",
    "közösségi média",
    "edző-sportoló kommunikáció",
    "testkultúra",
    "online coaching"
  ],
  "generated_keywords": [
    "digitális edzés",
    "otthoni fitnesz",
    "mozgáskultúra"
  ]
},
  {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "A Dieselgate hatása a Volkswagen kommunikációjára",
    "students": [
      {
        "name": "Mészáros Zsolt-Lajos",
        "major": "Sapientia EMTE , Kommunikáció és Közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Kovács Barna",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "Jelen kutatásban a 2015-ben történt Volkswagen Dieselgate-et vagy más néven dízelbotrányt mutatom be, és magát a Volkswagent, mint szervezetet. A kutatásomban azokat a tényezőket elemzem és határozom meg, amelyek a botrányhoz vezettek, és amelyek segítségével sikerült leküzdeni. A kutatás első fejezetében meghatározom a kommunikációt, a szervezeti kommunikációt, a vállalati krízishelyzeteket és a közösségi média fontosságát egy vállalat életében. A következő részben a Volkswagen kommunikációjának néhány meghatározó üzenetét elemzem a 1937-től napjainkig, mivel így kaphatunk egy képet arról, hogy miként fejlődött, illetve milyen irányba változott a történelem során és a botrány hatására. A kommunikációs rész után összegzem és elemzem 8 kutatás eredményeit a témában illetve az eredményeik alapján SWOT táblázat segítségével bemutatom a kapott eredményeket. A botrány egyik fontos tényezője maga a technológia, amelyet a csalás során alkalmaztak. A kutatásban a technikai tényezők is be vannak mutatva, illetve a Volkswagen dízelkultúrája, az egészségre káros hatások, és az új technológiák. Az utolsó részben egy interjú és egy tanulmányi kirándulás segítségével, nyertem egy konkrétabb rálátást az elméletre. Nagy Ede a marosvásárhelyi Volkswagen márkakereskedés eladási igazgatója a botránnyal kapcsolatos tapasztalatait osztotta meg. Egy tanulmányi kirándulás során ellátogattam Wolfsburgba, ahol a VW termékeit és történetét tekinthettem meg. Eredményként, azt láthatjuk, hogy milyen kommunikációs eszközökkel mutatták be az újításokat, amelyekkel megfékezték a botrány következményeit.",
    "keywords": [],
    "generated_keywords": [
      "vállalati kríziskommunikáció",
      "márkakommunikáció",
      "botránykezelés"
    ]
  },
  {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "A digitális diktatúra disztópiájának előformái George Orwell 1984 című művében",
    "students": [
      {
        "name": "Ravasz Viktória",
        "major": "Sapientia EMTE, Kommunikáció és Közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Kovács Barna",
        "university": "Sapientia EMTE Marosvásárhely"
      }
    ],
    "content": "Dolgozatomban a kommunikációs eszközök, a kommunikációs tartalmak és a hatalom működési módját vizsgálom George Orwell 1984 című művében. Elemzésemben kitérek a diktatórikus rendszerben létrejövő beszéd és gondolkodás közti kapcsolatra, a propagandára, valamint a diktatórikus rendszerben létrejövő állandó megfigyelések és lehallgatások hatására az egyénre és a társadalomra. Célom feltárni, hogy egy diktatórikus rendszerben a kommunikációs technológiák hogyan és milyen formában gyakorolnak hatást az emberek érzelmi és gondolati világára. Erre alapozva alkottam meg a kutatási kérdésemet, mely a következő: Mi a diktatórikus rendszerben használt kommunikációs formák és tartalmak szerepe George Orwell 1984 című regényében? Elemzésemet a szoros olvasat (close reading) módszerével végeztem. A szoros olvasat egy szöveg többszöri vizsgálata által létrehozott alapos értelmezést és elemzést foglal magába. Azért tartottam megfelelőnek ezt a módszert az alkotás elemzéséhez, mert ezáltal a szöveg mélyebb rétegéit is vizsgálat alá vethetem, mivel ez a regény rengeteg szimbólumot, másodlagos jelentést foglal magába.",
    "keywords": [
      "1984",
      "diktatúra",
      "disztópia",
      "propaganda",
      "nyelv",
      "gondolkodás"
    ],
    "generated_keywords": [
      "szoros olvasat",
      "kommunikációs hatalom",
      "totalitárius rendszer"
    ]
  },
  {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "Online játékos közösségek viselkedéselemzése krízishelyzetekben",
    "students": [
      {
        "name": "Scridon Teodor",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Tőkés Gyöngyvér",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "Jelen kutatás célja az online videójátékos közösségek kommunikációjának megfigyelése a krízishelyzetekben. Elemzésre kerül 2 online játékosközösség kommunikációs platformjainak a tartalma (fórumok és közösségi média), mind a játékosok, és mind a játék menedzsmentje részéről, amelyek által így információkat kaphatunk a fejlesztői cég válságkezelési stratégiáiról, illetve hogy a játékosok miként viszonyulnak bizonyos krízis szituációkhoz. A 2 vizsgált játékközösség az Among Us, amelyet az InnerSloth fejleszt, illetve az Elvenar, amelyet az InnoGames. Az elméleti rész többek között a játék és játszás fogalmát, a közösségek kríziskommunikációjának jelenségét és a lehetséges megküzdési stratégiákat tárgyalja az online térben. A két fókusztéma, amely a kutatás empirikus részében elemzésre kerül az a Covid-19 pandémia és az orosz-ukrán háború által keltett beszélgetések és alkalmazott kríziskezelési stratégiák; emiatt is a fórum és közösségi médián fellelhető bejegyzések vizsgált időszaka 2019. decembere és 2022. decemberére korlátozódik.",
    "keywords": [],
    "generated_keywords": [
      "játékosközösség",
      "kríziskommunikáció",
      "tartalomelemzés"
    ]
  },
    {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "Az írás szerepe egy vallásos ember életében",
    "students": [
      {
        "name": "Szántó Adrienn Renáta",
        "major": "Sapientia Erdélyi Magyar Tudományegyetem, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Vajda András",
        "university": "Sapientia Erdélyi Magyar Tudományegyetem"
      }
    ],
    "content": "Az írásnak fontos szerepe van a társadalom életében, a közigazgatásban és a magánigazgatásban egyaránt. Az írásnak tehát nemcsak az oktatás, a művelődés és a szórakozás/szórakoztatás területén van kiemelt szerepe, hanem a populáris kultúrában, a mindennapok megszervezésében és a kommunikáció fenntartásában is. Az írás révén az egyén nemcsak a térbeli, de az időbeli távolságokat is képes legyőzni, üzenni tud az utókor számára. Ugyanakkor segíti az egyént érzelmeinek és gondolatainak megfogalmazásában, segíti a transzcendenssel való kapcsolattartást, hatékonyabbá téve ezáltal a társadalomépítő kommunikációt és a szakrális kommunikációt egyaránt. Dolgozatomban azt vizsgálom, hogy mi az írás szerepe egy falusi ember, egy amatőr költő életében, milyen funkcióval épül be az írás az életébe és a kommunikációba. A vizsgálat során egyrészt elemzem azokat a helyzeteket és alkalmakat, melyekben az írásra sor kerül, illetve az egyénnek az íráshoz kapcsolódó szokásait, másrészt magukat a költeményeit. A versek esetében vizsgálni fogom a versek témáját, nyelvi és tartalmi sajátosságait, illetve azt, hogy milyen szerepet töltenek be a versek az egyén életében. Mivel a legtöbb vers témája a hit, külön kitérek arra is, hogy miként vesznek részt a versek a hit megélésében és az Istennel való érintkezésben. Dolgozatomban a tartalomelemzést és a morfológiai elemzést használom.",
    "keywords": [
      "amatőr költő",
      "amatőr költészet",
      "versek",
      "verses beszéd",
      "szakrális kommunikáció",
      "Istenes versek"
    ],
    "generated_keywords": [
      "hit és írás",
      "vallási költészet",
      "falusi kommunikáció"
    ]
  },
  {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "A rajongóaktivizmus működése botrány idején",
    "students": [
      {
        "name": "Antal Annamária",
        "major": "Sapientia EMTE, Kommunikáció és Közkapcsolatok , 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Kovács Barna",
        "university": "Sapientia EMTE Marosvásárhely"
      }
    ],
    "content": "Johnny Depp és Amber Heard konfliktusának egyik fő mozzanatát a rajongók aktivizmusa határozta meg. A közösségi felületeken, nagy mértékben a Twitter felületén, egy rajongó háború jött létre, amely olyan társadalmi problémákat hozott magával, mint a gyűlöletbeszéd, a nemek közötti egyenlőség, a családon belüli erőszak és a szólásszabadság kérdése. Ugyanakkor a felvetülő problémák vizsgálata közben a rajongó csoportok hangulati felépítettsége is külön figyelmet érdemel. Kutatásom a rajongók hangulati és érzelmi állapotának elemzésére törekszik, amit a per első és utolsó napján kialakult diskurzus alapján ragadok meg. Arra keresek választ, hogy a hangulati állapot milyen hatást gyakorol a csoport tagjaira, ugyanakkor más külső résztvevőkre.",
    "keywords": [
      "rajongóaktivizmus",
      "celebbotrány",
      "hangulati állapot",
      "társadalmi problémák"
    ],
    "generated_keywords": [
      "online diskurzus",
      "érzelemkutatás",
      "digitális közösségek"
    ]
  },
  {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "Briliáns termékelhelyezések félpercenként",
    "students": [
      {
        "name": "Barabás Hajnalka",
        "major": "Sapientia Erdélyi Magyar Tudományegyetem, Kommunikáció és közkapcsolatok, 1. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Imre Attila",
        "university": "Sapientia Erdélyi Magyar Tudományegyetem"
      }
    ],
    "content": "Jelen tanulmány egy népszerű amerikai televíziósorozat (Briliáns Elmék – Suits) termékelhelyezéseivel foglalkozik. Rövid bevezetőnkben a reklámok és termékelhelyezések meghatározásaival foglalkozunk, bevezetve a filmekben megjelenő termékelhelyezéseket is. Kutatásunk gyakorlati része a filmsorozat első évadában megjelenő termékelhelyezések ismétlődését mutatja be, összevetve a megjelenő márkák népszerűségével és eladási arányaikkal a sorozat megjelenő évében (2011). A példák gyűjtése során egy Excel-adatbázist hoztunk létre a megjelenő termékelhelyezésekkel, melyeket több szempontból is csoportosítottunk. Az adatbázisban ugyanakkor megjelennek vizuális, auditív és audiovizuális reklámok egyaránt. Mint kiderül, a sorozat többségében amerikai csúcsmárkákat szerepeltet. Dolgozatunk megpróbál összefüggést találni az elhelyezett termékek és a potenciális nézők anyagi háttere között, mert a sorozat – témáját tekintve – jól kereső sztárügyvédek mindennapjait ecseteli, akik csúcsmárkás termékeket használnak.",
    "keywords": [],
    "generated_keywords": [
      "termékelhelyezés",
      "televíziós reklám",
      "vizuális marketing"
    ]
  },
    {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "Nőszerep és nőábrázolás a Szolgálólány meséje regényben és adaptációiban",
    "students": [
      {
        "name": "Harasztovics Rebecca",
        "major": "Sapientia Erdélyi Magyar Tudományegyetem, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Vajda András",
        "university": "Sapientia Erdélyi Magyar Tudományegyetem Marosvásárhelyi Kar"
      }
    ],
    "content": "A Szolgálólány meséje egy disztópikus világot mutat be, melyben egy totalitárius állam a termékeny nőket rabságba taszítja, megfosztva őket emberi méltóságuktól és a testük feletti szabad döntés jogától. A női elnyomásnak ez a szélsőséges formában történő ábrázolása arra tesz kísérletet, hogy felhívja a társadalom figyelmét a nőket ért atrocitásokra. A történet tehát egy utópiába csomagolt erős társadalomkritikaként olvasható. Margaret Atwood 1985-ben adta ki a Szolgálólány meséje című feminista disztópikus regényét, amelyből 1990-ben film is készült. Azonban az áttörő sikert Atwoodnak a 2017-ben, Bruce Miller által készített, azonos című sorozat hozta el. A történet sikeréhez tehát a cselekmény és a téma mellett szükség volt egy olyan kulturális kontextusra is, melyben a társadalom szélesebb rétegei váltak érzékenyebbé a nemi egyenlőség, a társadalmi nemek és a feminizmus kérdései iránt. Dolgozatomban a regény, az 1990-ben készült film és a 2017-ben megjelent sorozat összehasonlító elemzését végzem el. Azt vizsgálom, hogy a populáris kultúra különböző regisztereiben miként jelenik meg a nők társadalmi helyzetének problémája, milyen különbségek és hasonlóságok érhetők tetten, és ezek mennyiben adódnak a történetet feldolgozó műfajok sajátosságaiból. Kutatásomban a tartalomelemzés módszerére támaszkodom.",
    "keywords": [
      "női elnyomás",
      "feminizmus",
      "disztópia",
      "szolgálólány",
      "Margaret Atwood",
      "regény",
      "sorozat",
      "film",
      "társadalomkritika"
    ],
    "generated_keywords": [
      "feminista elemzés",
      "adaptációkritika",
      "populáris kultúra"
    ]
  },
  {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "A romániai magyar kommunikációs szakemberek közösségi médiaismerete és használata szakmai környezetben",
    "students": [
      {
        "name": "Hegyi Gellért",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Tőkés Gyöngyvér Erika",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "A digitális kompetenciákat a 21. század alapkompetenciájának tartják. A 21. század leggyakrabban hangsúlyozott készségei között az információkezelést, a kritikus gondolkodást, a kreativitást, a problémamegoldást, az együttműködést és a kommunikációt említik (van Laar et al., 2017). Ha a kommunikációs szakmára gondolunk, az említett készségekkel a kommunikációs szakembernek rendelkeznie kell ahhoz, hogy a munkáját a legnagyobb hatékonysággal végezni tudja. A kommunikációs szakember feladata, hogy a szervezetekben belső és/vagy külső kommunikációt folytasson, illetve befolyásolja a szervezeti imázst, válságkommunikációt, médiakapcsolatokat, sajtótájékoztatókat, rendezvényeket, továbbá kommunikációs stratégiát készítsen, médiafigyelést és elemzést végezzen. A digitális korban szintén fontos kompetencia a közösségi hálózat(ok) segítségével történő kommunikáció. A közösségi hálózatok fontos szerepet töltenek be egy vállalat életében, marketingstratégiájuk szerves részét képezik. Romániában kevés szó esik arról, hogy ezen felületek kezelését végző kommunikációs szakemberek rendelkeznek-e a megfelelő készségekkel. A jelen kutatás célja, hogy képet kapjunk a romániai magyar kommunikációs szakemberek közösségi hálózati készségeiről. A kutatás elvégzéséhez van Deursen et al. 2019-ben kidolgozott standardizált kérdőívét alkalmazzuk 50 romániai magyar kommunikációs szakemberből álló mintán.",
    "keywords": [
      "21. századi készségek",
      "digitális kompetencia",
      "közösségi hálózati készség",
      "kommunikációs szakemberek",
      "romániai magyar"
    ],
    "generated_keywords": [
      "digitális médiahasználat",
      "szakmai kommunikáció",
      "kompetenciamérés"
    ]
  },
  {
    "major": "Kommunikációtudomány",
    "year": 2023,
    "title": "A harmonikus rezgések az arculati elemek szolgálatában",
    "students": [
      {
        "name": "Kacsó Tamás",
        "major": "Sapientia EMTE, Mechatronika, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Farkas Csaba",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "Manapság jelentős probléma a vállalkozások arculati elemeinek monotonitása és egyhangúsága, mivel a logótervezők majdnem ugyanazokat a sémákat, trendeket és szabványokat követik. Új ötletekre van szükség, melyek feldobják a logók vizuális élményét úgy, hogy emlékezetessé tegyék azokat. A grafikában meghatározott monoton sablonokból és szabályokból úgy tudunk kitörni, ha valami újat viszünk a tervezési folyamatba. Valamit, ami kívül áll, de összeköthető vele. A tudástranszfer lényegesen hozzá tud járulni az ilyen ötletek kialakulásához. A világ fejlődik és egyre több lehetőség van a logók korszerűsítésére. Például a mozgókép egy olyan lehetőség, amit a mai digitális világ nagymértékben támogat, és lehetőséget ad annak vizuális játékának kihasználására. Ennek kivitelezésére kiváló lehetőséget teremtenek a harmonikus rezgések által generált matematikai görbék, melyeknek ugyanúgy állókép-formájuk, mint mozgóképes forgatásuk egyaránt jelentenek megoldást az arculati elemek feldobására. A dolgozat során bemutatom, hogyan lehet létrehozni ezeket a görbéket, majd különböző példák során az újítási folyamatokra, technikákra és ötletekre is fény derül.",
    "keywords": [
      "harmonikus rezgések",
      "matematikai görbék",
      "arculati elemek",
      "animáció",
      "korszerűsítés",
      "tudástranszfer"
    ],
    "generated_keywords": [
      "logótervezés",
      "vizuális dinamika",
      "grafikai innováció"
    ]
  },
  {
  "major": "Kommunikációtudomány",
  "year": 2023,
  "title": "A gazdagok reprezentációja a filmekben",
  "students": [
    {
      "name": "Éltes Erik-Krisztián",
      "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok, 2. év"
    }
  ],
  "teachers": [
    {
      "name": "dr. Vajda András",
      "university": "Sapientia EMTE"
    }
  ],
  "content": "Dolgozatom célja megvizsgálni négy 2022-ben bemutatott filmszatíra esetében azt, hogy milyen képet fest a populáris kultúra a jövedelem szempontjából a társadalmi hierarchia csúcsán élő emberekről. A tehetősebb társadalmi réteg viselkedésének médiareprezentációja az elmúlt évtizedben egyre több alkalommal jelenik meg a populáris kultúrában a média közvetítésén keresztül, és a 2022-es év egy mérföldkőnek számított, ugyanis hatalmas népszerűségnek örvendtek a társadalomkritikus, szatíra műfajában készült filmművészeti alkotások, amelyekben a fiktív történetek főszereplői többnyire a társadalmat könnyen befolyásoló, magas anyagi jövedelemmel rendelkező férfiak és nők közül kerültek ki. A tanulmányomban elemezni fogom korunk szupergazdag elitjének viselkedését, amely a pénz iránti viszonyulásukról, az anyagi szempontból a társadalmi ranglétra alsóbb szintjein munkát végző személyek iránt kimutatott viselkedésükről, és a nők és férfiak közötti kapcsolatról szól. A dolgozatban a következő négy népszerű film összehasonlító elemzését fogom elvégezni: Ruben Östlund: A szomorúság háromszöge; Mark Mylod: A menü; Rian Johnson: Tőrbe ejtve – Az üveghagyma; Damien Chazelle: Babylon. Ezenkívül a témával kapcsolatosan még egy sorozatot is: Mike White: A fehér lótusz.",
  "keywords": [
    "polarizált társadalom",
    "gazdagok",
    "kapitalizmus",
    "társadalmi hierarchia",
    "társadalomkritika",
    "populáris kultúra",
    "filmszatíra"
  ],
  "generated_keywords": [
    "gazdagságábrázolás",
    "filmszatíra",
    "társadalmi rétegződés"
  ]
},
  {
    "major": "Egészségtudomány",
    "year": 2023,
    "title": "A serdülőkorúak egészségi állapotának elemzése: a HBSC-kutatás eredményei",
    "students": [
      {
        "name": "Bárdos Tímea",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Sántha Ágnes",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "A serdülőkorú gyermekeknél kialakult egészségmagatartás felnőttkorban folytatódik, ami olyan tényezőket érinthet, mint például a mentális egészség, egyes krónikus betegségek kialakulása, az alkoholfogyasztás, a dohányzás, az étrend, illetve a fizikai aktivitás szintje. A HBSC longitudinális kutatás világszintű információkat szolgáltat a 11, 13 és 15 éves serdülők egészségéről, jóllétéről, társadalmi környezetéről és egészségmagatartásáról. Kutatásom célja felmérni a serdülőkorú (11–15 éves) gyermekek egészségét és annak időbeli alakulását a társadalmi környezetükben, ahol élnek: az iskolában, a családban és a barátaik körében. A kutatás adatfelvételi része (HBSC) lezajlott online és/vagy papíralapú kérdőívek segítségével, egy standardizált kérdőív segítségével. Az adatok társadalmi kontextusra (család, kortárs, iskola, online kommunikáció), egészségügyi eredményekre (mentális egészség, túlsúly, elhízás), egészségmagatartásra (étkezési szokások, fizikai aktivitás) és a fiatalok egészségére és jólétére vonatkozó kockázati viselkedésre (dohányzás, alkoholfogyasztás, kannabiszfogyasztás, szexualitás) összpontosítanak.",
    "keywords": [
      "egészségmagatartás",
      "szociális jóllét",
      "társas támogatás",
      "serdülők",
      "longitudinális elemzés"
    ],
    "generated_keywords": [
      "serdülők egészsége",
      "HBSC-kutatás",
      "életmódbeli kockázatok"
    ]
  },
  {
    "major": "Egészségtudomány",
    "year": 2023,
    "title": "Középiskolások ismeretei és attitűdjei a HPV-fertőzéssel és a méhnyakrákkal kapcsolatban",
    "students": [
      {
        "name": "Bereczki Andrea",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Sántha Ágnes",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "A méhnyakrák a daganatos betegségek egyike, melynek elhalálozását tekintve Románia az Európai Unió listavezetője. Napjainkban egyre kevesebb esetet figyelhetünk meg, mivel gyakoribbak a szűrések, fejlettebb a technológia és az orvosi tudás. A méhnyakrákot okozó HPV-vírus az esetek többségében szexuális úton terjed. Kutatásom célja, hogy felmérjem az Erdélyben élő magyar anyanyelvű középiskolás lányok és fiúk (14–19 évesek) ismereteit a HPV-vírussal és a méhnyakrákkal kapcsolatban. Vizsgálom a társadalmi háttérváltozók hatását is. Egy saját készítésű, standardizált, zárt kérdésekből álló kérdőívet használtam, melynek a kitöltése önkéntes és névtelen. Az adatfelvétel még folyamatban van, körülbelül 200 választ várok. Az adatokat SPSS program segítségével dolgozom fel.",
    "keywords": [
      "HPV-fertőzés",
      "méhnyakrák",
      "serdülők",
      "objektív egészségértés"
    ],
    "generated_keywords": [
      "megelőzés",
      "iskolai szűrés",
      "egészségtudatosság"
    ]
  },
  {
    "major": "Egészségtudomány",
    "year": 2023,
    "title": "HPV-fertőzéssel kapcsolatos ismeretek a méhnyakrákszűrésre jelentkezett nők körében Románia központi régiójában",
    "students": [
      {
        "name": "Hella Anita",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Sántha Ágnes",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "A méhnyakrák világszerte a nőket érintő egyik leggyakoribb rosszindulatú daganatos betegség. Rendszeres szűréssel és védőoltással megelőzhető lenne, viszont ezt a lehetőséget gyakran nem használják ki a szűrés kínálatában és keresletében tapasztalható egyenlőtlenségek miatt. A kutatásban 676 ingyenes méhnyakrákszűrésre érkezett nőtől gyűjtöttem adatokat Románia központi régiójának három megyéjében. Kíváncsi voltam arra, hogy kinek a javaslatára jöttek el a szűrésre, milyen betegségismeretük van, és hogy ez milyen mértékben befolyásolja a szűrés elfogadását. Felmértem objektív és szubjektív egészségértésüket is. A kutatás célja, hogy az eredmények segítsék a prevenciós stratégiák fejlesztését.",
    "keywords": [
      "méhnyakrák",
      "HPV-fertőzés",
      "HPV-specifikus egészségértés",
      "prevenció",
      "szubjektív egészségértés"
    ],
    "generated_keywords": [
      "női prevenció",
      "egyenlőtlenség az ellátásban",
      "szűrési hajlandóság"
    ]
  },
    {
    "major": "Egészségtudomány",
    "year": 2023,
    "title": "Intenzív osztályon dolgozók egészségmagatartása, inszomnia és kiégési szintje",
    "students": [
      {
        "name": "Rancz Tamás",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Kovács Réka Rozália",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "Kutatásom elsődleges célja az volt, hogy feltérképezzem az intenzív osztályon dolgozó orvosok és asszisztensek egészségmagatartását, inszomnia szintjét és kiégési hajlamát, összefüggésben az életkorral, nemmel, a havi túlóra mennyiségével, valamint a felsorolt szempontok alapján összehasonlítsam a kórház többi osztályán dolgozó egészségügyi személyzettel. A folyamatos egészségügyi ellátás biztosítása érdekében sok orvosnak és asszisztensnek éjszakai is dolgoznia kell, emiatt a biológiai ritmusuk felbomlik, valamint a fokozott terhelés, stressz negatív változást okozhat a vizsgált változókban. A kérdőív a demográfiai kérdéseken kívül (nem, életkor, családi állapot, munkaterület, hány éve dolgozik) az alvászavar mérésére az Athén Inszomnia Skálát (8 kérdés), a kiégés mérésére a Mini-Oldenburg Kiégés Kérdőívet (10 kérdés) tartalmazza, az egészségmagatartást általam összeállított kérdésekkel mérem. A kérdőív kitöltése, az eredmények feldolgozása folyamatban van.",
    "keywords": [
      "orvosok",
      "asszisztensek",
      "inszomnia",
      "kiégés",
      "intenzív osztály"
    ],
    "generated_keywords": [
      "egészségügyi dolgozók",
      "alvászavar",
      "munkahelyi stressz"
    ]
  },
  {
    "major": "Egészségtudomány",
    "year": 2023,
    "title": "Intézményi egészségvédelem a Sapientián",
    "students": [
      {
        "name": "Székely Johanna",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Sántha Ágnes",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "Az iskolákban és egyetemeken fokozott a fertőző betegségek terjedésének veszélye, sok helyről jönnek, és kisebb terekben vannak összezsúfolva. A krónikus betegségek ezen intézményekben fokozottan kialakulhatnak az ülő életmód és a hosszú napirend miatt, illetve a nem megfelelő táplálkozási lehetőségek/szokások miatt. Fontos, hogy az intézmények odafigyeljenek és óvintézkedéseket tegyenek az egészség megőrzésére. Kutatásom célja, hogy felmérjem, a Sapientia Erdélyi Magyar Tudomány Egyetem Marosvásárhelyi Kara milyen intézkedéseket tesz az egészség védelmében és milyen módon lehetne még fejleszteni a jelenlegi módszereken. Kíváncsi vagyok a hallgatók és dolgozók elvárásaira is az intézményi egészségvédelem terén. Egy saját készítésű kérdőívvel fogok kutatást végezni. A kérdőívem kitöltésében legalább 250-300 hallgatóra és 50-60 dolgozóra számítok.",
    "keywords": [
      "egészségvédelem",
      "egészségfejlesztés",
      "önminősített egészségi állapot",
      "egészségmagatartás",
      "intézményi egészségvédelem"
    ],
    "generated_keywords": [
      "egyetemi egészség",
      "fertőzések megelőzése",
      "hallgatói jóllét"
    ]
  },
  {
    "major": "Egészségtudomány",
    "year": 2023,
    "title": "A Szabolcs-Szatmár-Bereg megyében élő sajátos nevelési igényű 12-18 éves korú fiatalok életmódja",
    "students": [
      {
        "name": "Zagyva Ildikó",
        "major": "Debreceni Egyetem Egészségtudományi Kar, Védőnő szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Barabás Ágota drd.",
        "university": "Debreceni Egyetem"
      }
    ],
    "content": "Hazánk lakosságának egészségi állapota jelenleg nem éri el azt a szintet, mely az ország társadalmi-gazdasági fejlettségétől elvárható lenne. Magyarországon a nem fertőző, krónikus betegségek jelölhetők meg főként a halálokok között, melyek az életmóddal összefüggésbe hozhatók. A gyermekek körében is súlyosbodó probléma a helytelen életmód, minden ötödik 15 éves korú fiatal túlsúlyos. Jelen kutatás célja a Szabolcs-Szatmár-Bereg megyében élő, sajátos nevelési igényű serdülőkorú gyermekek egészségmagatartásának vizsgálata, az életmódjukat befolyásoló tényezők azonosítása. A vizsgálat során kérdezőbiztos segítségével történt kérdőíves adatfelvételt alkalmaztunk. 239 darab kérdőívet sikerült felvennünk. Eredményeink alapján megállapítható, hogy a helytelen táplálkozási szokások fennállnak, de a rizikómagatartások előfordulása kedvezőbb az országos átlaghoz képest. A túlsúly aggasztó mértéket ölt. Gyermekkorban fontos megalapozni az egészséges életmódra nevelést.",
    "keywords": [
      "egészségmagatartás",
      "sajátos nevelési igény",
      "fizikai aktivitás"
    ],
    "generated_keywords": [
      "hátrányos helyzet",
      "túlsúly serdülőknél",
      "életmód kutatás"
    ]
  },
  {
  "major": "Egészségtudomány",
  "year": 2023,
  "title": "Az Elf Bar életprevalenciája és a tájékozottság vizsgálata tizenévesek körében",
  "students": [
    {
      "name": "Tuba Nóra",
      "major": "Debreceni Egyetem Egészségtudományi Kar, Egészségtudományi Intézet, Védőnői Módszertani és Prevenciós Tanszék, védőnő szakirány, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Moravcsikné Dr. Kornyicki Ágota",
      "university": "Debreceni Egyetem Egészségtudományi Kar, Egészségtudományi Intézet, Védőnői Módszertani és Prevenciós Tanszék"
    }
  ],
  "content": "Magyarországon szigorú törvényi szabályozás kontrollálja a fiatalkorúak (18 éven aluliak) dohányzását. Melynek eredményeként a naponta dohányzó fiatalok aránya 2019-re 9,4%-ra csökkent, 2014-ben 16,4% volt. Emellett pedig a soha nem dohányzók aránya folyamatosan növekedett. Ezt a csökkenő tendenciát negatívan befolyásolta hazánkban az Elf Bar robbanásszerű térhódítása, mely becslések szerint a fiatalok körében vált igen népszerűvé. Kutatásom célja, hogy kérdőíves vizsgálat segítségével felmérjem, egy háromhatár menti megye, járási központú városában tanuló általános iskolás diákok Elf Barral kapcsolatos tudását és magatartási szokásait. A kérdőívet összesen 125 fő (51,2% fiú) töltötte ki, akik mind a Fehérgyarmati Járás egy városi általános iskola 5., 6. és 7. osztályos diákjai. A diákok 76%-a (95 fő) hallott korábban már az Elf Barról, közülük 64 fő (61%) az elmúlt, 2022-es évben hallott először. A megkérdezettek 24%-a (30 fő) még nem hallott erről a típusú dohányzást imitáló eszközről. A kutatásban résztvevők fele számolt be arról, hogy a közvetlen környezetében van dohányzó családtag (édesanya, édesapa, testvér). Az Elf Barról információval rendelkező diákok 28%-a (26 fő) használta már Elf Bart. A diákok megítélése az e-cigaretta és a hagyományos cigaretta egészségre károsító hatása vizsgálatakor megállapítást nyert, hogy az Elf Bart már valaha használó diákok 60%-a úgy gondolta, hogy a hagyományos cigaretta a károsabb, míg az Elf Bart soha nem használók 75%-a jelölte, hogy mindkét dohányzási rizikómagatartás káros. A negatív Elf Bar életprevalenciával élő diákok (69 fő) közül 84%-uk (58 fő) úgy gondolja, hogy ártalmas a termék az egészségére és ezért nem használja, további 57%-uk (39 fő) jelölte, hogy a termék a használatból eredően függőséget okoz, így mivel addiktív termékről van szó, mellőzi a használatát.",
  "keywords": [
    "Elf Bar",
    "dohányzás",
    "serdülőkor",
    "egészségfejlesztés"
  ],
  "generated_keywords": [
    "e-cigaretta",
    "fiatalkori rizikómagatartás",
    "függőség megelőzése"
  ]
},
  {
    "major": "Gépészmérnöki és mechatronika",
    "year": 2023,
    "title": "Fatüzelésű dézsafürdő vezérelt fűtési megoldással",
    "students": [
      {
        "name": "Czimbalmos Áron",
        "major": "Sapientia EMTE Marosvásárhely, Mechatronika, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Pásztor Judit",
        "university": "Sapientia Erdélyi Magyar Tudományegyetem, Marosvásárhely"
      }
    ],
    "content": "Napjainkban egyre elterjedtebbek lettek a dézsafürdők. Az áruk egyelőre igen magas, emiatt nem mindenki engedheti meg magának. Így gondoltam, hogy jó lenne egy olyan alternatív megoldást létrehozni, amely képes akár jobban teljesíteni, mint egy átlagos felépítésű dézsafürdő, többnyire otthon megtalálható, avagy kedvező áron beszerezhető anyagokból/alkotóelemekből áll össze, és viszonylag egyszerű az összeszerelése akár egy átlagembernek is. A cél egy olyan dézsafürdő megvalósítása, amely gazdaságos, illetve egyszerű felépítésű. Ezen dolgozat során bemutatásra kerülnek a dézsafürdők típusai, fűtési lehetőségei, alternatív megoldások. A kutatás során barátokkal megterveztek és elkészítettek egy változatot. A dolgozatban kiszámításra kerül a hőveszteség, kiválasztásra kerülnek a konstrukciós elemek, vizsgálják a víz hőmérséklet-változását melegítés és szabályozás hiányában.",
    "keywords": [
      "dézsafürdő",
      "melegítés",
      "hőcserélés",
      "hőveszteség",
      "hőszabályozás"
    ],
    "generated_keywords": [
      "vezérlés",
      "gazdaságos fűtés",
      "otthoni kivitelezés"
    ]
  },
  {
    "major": "Gépészmérnöki és mechatronika",
    "year": 2023,
    "title": "Termesztőház árnyékolását vizsgáló és csepegtető öntözését bemutató stand tervezése, kivitelezése",
    "students": [
      {
        "name": "Császár Tamás",
        "major": "Sapientia EMTE, Mechatronika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Pásztor Judit",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "A növények szabadtéri termesztését jelentős mértékben befolyásolják a betegségek, időjárási körülmények, emiatt napjainkban jelentős mértékben elterjedt a termesztőházak használata. A dolgozat célja egy fóliával burkolt termesztőház stand elkészítése árnyékolóval, amely lehetővé teszi különböző típusú árnyékolók hatásának tanulmányozását. A kísérlet során hőmérséklet szenzorral mérik a termesztőtér hőmérséklet-változását. A második cél egy automata csepegtető öntözőrendszer megvalósítása, amely fényérzékelés alapján működik mágnesszelep segítségével. A kivitelezést saját kertészetükben tervezik alkalmazni.",
    "keywords": [
      "termesztőház",
      "árnyékolás",
      "hőmérséklet",
      "csepegtető öntözés",
      "fényérzékelés"
    ],
    "generated_keywords": [
      "mezőgazdasági automatizálás",
      "klímaszabályozás",
      "szenzoros vezérlés"
    ]
  },
  {
    "major": "Gépészmérnöki és mechatronika",
    "year": 2023,
    "title": "Gáztörvények igazolására alkalmas berendezés tervezése",
    "students": [
      {
        "name": "Demeter-Nagy Rebeka-Mária",
        "major": "Sapientia EMTE, Mechatronika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Pásztor Judit",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "A dolgozat célja egy olyan mérőberendezés megvalósítása, amely lehetővé teszi az ideális gáz állapotának tanulmányozását. A berendezés segítségével megvizsgálhatók az izoterm, izochor és izobár gáztörvények. A mérések zárt és szigetelt térben történnek, a levegő hőmérsékletét wolframszálas izzóval változtatják. A mérésekhez szükséges a nyomás, hőmérséklet és térfogat érzékelése, ezekhez különböző szenzorokat alkalmaznak. A térfogatot egy ismert hengerben mozgó dugattyúval módosítják. Az egész berendezést arduino fejlesztőplatform vezérli.",
    "keywords": [
      "gáztörvények",
      "zárt rendszer",
      "nyomás",
      "hőmérséklet",
      "térfogat"
    ],
    "generated_keywords": [
      "termodinamika",
      "oktatási eszköz",
      "kísérleti mérés"
    ]
  },
    {
    "major": "Gépészmérnöki és mechatronika",
    "year": 2023,
    "title": "3D nyomtatási paraméterek hatásának vizsgálata a nyomtatott próbatest szakadási tulajdonságára",
    "students": [
      {
        "name": "Kántor Miklós-Ferencz",
        "major": "Sapienta Erdélyi Magyar Tudományegyetem, Gépészmérnöki, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Gergely Attila Levente",
        "university": "Sapientia Erdélyi Magyar Tudományegyetem"
      },
      {
        "name": "drd. Farmos Rudolf-László",
        "university": "Sapientia Erdélyi Magyar Tudományegyetem"
      }
    ],
    "content": "A 3D nyomtatás az additív technológiák egyik legelterjedtebb módozata, ugyanakkor napjaink legfejlődőbb gyártástechnológiája. Anyagfelhasználása kifejezetten széleskörű: habár napjainkban a polimer anyagok kerülnek előtérbe, fémek és különböző kerámiák is használhatóak alapanyagként. A kívánt végtermék előállításához megfelelő nyomtatási paraméterek szükségesek, melyeknek változása befolyásolja a végterméket. Kutatásom célja a hőmérséklet, rétegvastagság és a nyomtatási sebesség 3D nyomtatási paramétere hatásának vizsgálata a nyomtatott próbatest szakítási tulajdonságára. Az eredményeket összehasonlítom a fröccsöntési technológiával előállított próbatétek szakítóvizsgálatával.",
    "keywords": [
      "3D nyomtatás",
      "rétegvastagság",
      "sebesség",
      "hőmérséklet",
      "szakítószilárdság"
    ],
    "generated_keywords": [
      "additív gyártás",
      "műanyagtechnológia",
      "paraméterhatás"
    ]
  },
  {
    "major": "Gépészmérnöki és mechatronika",
    "year": 2023,
    "title": "Műanyag fogaskerekek koptatására és fárasztására alkalmas berendezés tervezése és kivitelezése",
    "students": [
      {
        "name": "Portik Szilveszter",
        "major": "Sapientia EMTE, Gépészmérnöki , 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Gergely Attila-Levente",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar"
      }
    ],
    "content": "A dolgozat célja egy műanyag fogaskerekek koptatására és fárasztására alkalmas berendezés tervezése és kivitelezése, amely segítségével mérni lehet a kopás mértékét a terhelés függvényében egy adott 3D nyomtatott fogaskerék esetében. A tervezet berendezés a Sapientia EMTE Gépészmérnöki Tanszékének kísérleti eszköztárát bővíti. A fő szempont a tervezés során a költséghatékony kivitelezés volt. A berendezés egyik tengelyét egy elektromos motor hajtja állandó szögsebességgel és nyomatékkal, a másik tengelyt mechanikai fékező mechanizmus terheli állandó nyomatékkal.",
    "keywords": [
      "műanyag",
      "fogaskerék",
      "kopás",
      "fárasztás",
      "tervezés"
    ],
    "generated_keywords": [
      "kísérleti berendezés",
      "mechanikai terhelés",
      "anyagvizsgálat"
    ]
  },
  {
    "major": "Gépészmérnöki és mechatronika",
    "year": 2023,
    "title": "Malomcsiszolásos módszer hatékonyságának vizsgálata öntött fémalkatrészek esetén",
    "students": [
      {
        "name": "Rappert Balázs",
        "major": "Sapientia EMTE, Gépészmérnöki, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Egyed-Faluvégi Erzsébet",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar"
      }
    ],
    "content": "A dolgozat célja a malmozási csiszolómódszer hatékonyságának vizsgálata öntött alkatrészek esetén. A kutatási projekt első fázisa a malom, a fém próbatestek és a homoköntéssel készült próbatestek öntéséhez szükséges gázfűtéses kohó kivitelezése. A mérési és adatfeldolgozási fázisban a próbatestek felületi érdességét vizsgálják malmozás előtt és után. A kutatás célja az optimális malmozási paraméterek meghatározása, mint az őrlőanyag szemcsemérete, malomdob fordulatszáma és az elérhető legkisebb felületi érdesség.",
    "keywords": [
      "felületi érdesség",
      "őrlőmalom",
      "öntött alkatrész",
      "csiszolás",
      "homoköntés"
    ],
    "generated_keywords": [
      "anyagmegmunkálás",
      "kísérleti vizsgálat",
      "hatékonysági elemzés"
    ]
  },
   {
    "major": "Gépészmérnöki és mechatronika",
    "year": 2023,
    "title": "Laboratóriumi fröccsöntő gép vezérlésének tervezése és kivitelezése",
    "students": [
      {
        "name": "Sipos Botond",
        "major": "Sapientia EMTE, Mechatronika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Gergely Attila-Levente",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki Tanszék"
      }
    ],
    "content": "A dolgozat célja egy laboratóriumi fröccsöntő gép vezérlésének a tervezése és kivitelezése, mely 2018-ban készült egy államvizsga keretében. A fröccsöntő gép pneumatikus rendszerét, és a fröccsöntési folyamatot szeretném automatizálni egy PLC rendszer segítségével. Ennek következtében az elhelyezett szenzorok segítségével, a fröccsöntési folyamatot vezérelni lehet a használt nyomás, az olvasztási idő és az utónyomási idő előzetes megadásával.",
    "keywords": [
      "vezérlés",
      "fröccsöntés",
      "automatizálás",
      "PLC"
    ],
    "generated_keywords": [
      "pneumatikus rendszer",
      "műanyaggyártás",
      "ipari vezérlés"
    ]
  },
  {
    "major": "Gépészmérnöki és mechatronika",
    "year": 2023,
    "title": "Hobbi CNC marógép megvalósítása és elemzése",
    "students": [
      {
        "name": "Szabó Tamás",
        "major": "Sapientia, Mechatronika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Forgó Zoltán",
        "university": "Sapientia, docens"
      }
    ],
    "content": "A dolgozat célja egy hobbi CNC marógép tervezése, valamint a kivitelezés utáni működési pontosság bemérése, illetve a merési eredmények kiértékelése. A CNC marógép elsődleges feladata a nyomtatott áramkör marási technológiával való előállítása. A dolgozat első felében a gép kigondolt szerkezetének tervezése követhető 3D modell alapján. Ezek után a mozgatócsavarok, illetve a mellékmozgást megvalósító léptető motorok megválasztásához szükséges számítások következnek, figyelembe véve a mozgások során fellépő terheléseket. A marógép működési pontosságának a meghatározása, a szerszám pozíció pontosságának és ismételhetőségének mérését takarja, illetve magába foglalja a berendezés referencia-pontjait meghatározó induktív érzékelők bemérését is.",
    "keywords": [
      "tervezés",
      "hobby CNC",
      "3D modell",
      "vezérlés"
    ],
    "generated_keywords": [
      "nyomtatott áramkör",
      "léptető motor",
      "pozíciómérés"
    ]
  },
  {
    "major": "Gépészmérnöki és mechatronika",
    "year": 2023,
    "title": "Bolyai Farkas által tervezett kályha tanulmányozása",
    "students": [
      {
        "name": "Szőcs Krisztina",
        "major": "Sapientia EMTE, Gépészmérnöki, 2. év"
      },
      {
        "name": "Csegedi Ferencz-József",
        "major": "Sapientia EMTE, Gépészmérnöki, 2. év"
      },
      {
        "name": "Márton Botond",
        "major": "Sapientia EMTE, Gépészmérnöki, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Pásztor Judit",
        "university": "Sapientia EMTE, adjunktus"
      }
    ],
    "content": "Bolyai Farkas neve a matematikusok körében nem idegen, azonban kevesen tudják azt, hogy életművének a kályhák, kemencék tervezése és rakása is szerves része. Célja egy olyan tűzhely kidolgozása volt, amely a lehető legtakarékosabb, tehát minél nagyobb teret képes melegen tartani viszonylag kis energiabefektetéssel. Általa terjedtek el Erdélyben, főleg Marosvásárhely környékén, a Bolyai-kemencék és kályhák, amelyeknek egyik példánya a marosvásárhelyi Teleki Tékában ma is megtalálható. Dolgozatunk célja a Bolyai Farkas által tervezett és épített kályhák működésének tanulmányozása a Teleki Tékában található mintadarab alapján.",
    "keywords": [
      "kemence",
      "kályha",
      "hőenergia",
      "takarékosság",
      "Bolyai Farkas"
    ],
    "generated_keywords": [
      "hőtechnika",
      "történeti technika",
      "energiatudatosság"
    ]
  },
  {
  "major": "Gépészmérnöki és mechatronika",
  "year": 2023,
  "title": "Hengeres fogaskerekek sajátos fogprofil-módosításainak vizsgálata",
  "students": [
    {
      "name": "Váradi Csaba Béla",
      "major": "Sapientia EMTE, Gépészmérnöki, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "dr. Máté Márton",
      "university": "Sapientia EMTE Marosvásárhelyi Kar"
    }
  ],
  "content": "A fogaskerekek teherbírása, mozgástörvény-megtartása és csendes működése, egyre nagyobb sebességeken azok a kérelmek, amelyeknek dinamikusan fejlődő műszaki világunkban meg kell feleljenek. A fogprofil, illetve a fogfelület helyes megválasztása az előbbi elvárásoknak való megfelelés legfontosabb tényezője. A módosítási elképzelés a felgyorsuló világ elvárása miatt jött létre. Mivel a modulokat, ezáltal a terhelhetőséget lehet növelni a modul növelésével, de ezáltal a hajtás mérete és tömege is nő. Alapvető követelmény, hogy a kapcsolódás során az áttétel állandó kell legyen. Ennek a követelménynek igen sok profilgörbe megfelelne, hiszen mint tudjuk, bármely sima profilhoz szerkeszthető megfelelő ellenprofil. A műszaki gyakorlatban azonban nagyon leszűkül azoknak a profilgörbéknek a köre, amelyeket valóban alkalmazni is lehet fogaskerekek kialakításához. Egyesek szerint ez a kutatási ág már kiaknázott. Szerintem fontos ezen profilok kutatása és különböző profilmódsítások felírása, mivel kaphatunk egy kedvezőbb, nagyobb foglábmerevséget biztosító profilt, amely akár felül is írhatja az evolvens profil eddigi térhódítását. A kutatásomban elméletben tanulmányozom a következő három általam javasolt módosított fogprofilt: szinoid, polinomiális és tangenoid. A meglévő fogprofilok, amelyek a kölcsönös burkolás feltételét kielégítő, egyetlen léccel burkolható új fogprofilok egyenleteinek felírása volt az egyik cél. Az első profil a szinoid profil, amely egy szinuszfüggvény grafikus képéhez hasonlítható a legjobban. A szinoid profil előnye abban áll, hogy jelentősen vastagodik a fogláb, így növelve a fog teherbírását. A második profil a polinomiális profil, amely a szinoidhoz hasonló lécprofil-módosítást állít elő. Itt harmadfokú polinomok segítségével írtuk fel a generáló lécprofil parametrikus egyenleteit. A harmadik fogprofil a tangenoid, amely még egy új és kibontakozóban lévő ötlet számomra. Célom, hogy egy olyan fogprofilt találjak, amely megengedi a hajtás elemeinek egyetlen szerszámmal való gyártását és az evolvenshez képest növelt teherbírással rendelkezik. Gyakorlati megvalósításomként kinyomtatnám a fogaslécet és fogaskereket egy 3D nyomtató segítségével, hogy mérhetővé tegyem a felsorakoztatott profilok közötti különbséget.",
  "keywords": [
    "fogaskerék",
    "profil",
    "szinoid",
    "polinom",
    "rapid prototyping"
  ],
  "generated_keywords": [
    "profilmódosítás",
    "evolvens alternatíva",
    "3D nyomtatás gépelemekhez"
  ]
},
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2023,
    "title": "Áramkörök tesztelése és minősítése NI Elvis II/LabView rendszeren",
    "students": [
      {
        "name": "Balazs Tamás-Béla",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Papp Sándor",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "A TDK dolgozat témája egy automata tesztelő rendszer megépítése, amely egy jel generátor, erősítő, illetve bármilyen elektronikai áramkör tesztelésére alkalmas. A megoldására egy didaktikai berendezést használok, amely a National Instruments Elvis II didaktikai berendezése. Ezt a berendezést elsősorban didaktikai célokra tervezték, de prototípus tervezés esetén is helyt áll a tesztelés során. A hardver részét ez a berendezés oldja meg, mivel ez a LabView programozói környezettel összekötve ipari teszt-standokhoz hasonló berendezést tudunk építeni. A hardver-szoftver közti kommunikáció megoldása könnyen valósul meg, mivel ezek egy gyártótól kaphatóak. Az így megépített berendezést arra használhatjuk, hogy leteszteljük a rendszerünk elvárt kimenetét, és ennek a tesztelésnek az eredményét egy felhasználói felületen vizualizáljuk, ahol ha sikeresen átment vagy nem, egy üzenet segítségével visszajelzést tudunk adni arról, ha esetleg hiba történt a teszt közben.",
    "keywords": [
      "NI Elvis",
      "LabView",
      "áramkörtesztelés",
      "prototípus"
    ],
    "generated_keywords": [
      "automata tesztelés",
      "ipari mérés",
      "hardver-szoftver integráció"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2023,
    "title": "Digitális jelfeldolgozás NUCLEO lapokkal",
    "students": [
      {
        "name": "Horváth Levente",
        "major": "Sapientia EMTE, Számítástechnika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Fehér Áron",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "Az egyetemi államvizsga projektem és egyben TDK projektem digitális jelfeldolgozás témakörben van, egy NUCLEO-G491RE mikrovezérlő felhasználását és annak STM32CubeIDE segítségével történő programozását foglalja magába. A projekt különböző effektusok (EQ, torzítás, overdrive, késleltetés, konvolúciós téreffektus, noisegate stb.) megvalósításáról szól. A cél az effektusok tesztelése Python alatt és hardveres implementálása. A NUCLEO G491RE mikrokontroller egy STM32G4 mikrokontrollert tartalmazó fejlesztői lap, amely megfizethető és rugalmas módot biztosít új ötletek prototípusainak elkészítéséhez és értékeléséhez.",
    "keywords": [
      "digitális jelfeldolgozás",
      "NUCLEO",
      "STM32",
      "audio effektusok"
    ],
    "generated_keywords": [
      "mikrokontroller",
      "DSP implementáció",
      "audio processzor"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2023,
    "title": "Acrobot szabályozása és gyakorlati megvalósítása",
    "students": [
      {
        "name": "Lukács Szabolcs",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Dávid László",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "A dolgozat témája egy nemlineáris, alulaktuált dinamikus rendszer, az úgynevezett „Acrobot” szabályozásának megvalósítása. A cél egy olyan kísérleti eszköz létrehozása, amelyen bemutatható egy CLF (Control Lyapunov Function) valamint DLQR (Discrete Linear Quadratic Regulator) alapú szabályozási stratégia. A rendszer célja, hogy az acrobotot az alsó stabil egyensúlyi pontjáról a felső instabil pozíciójába juttassa, és ott stabilizálja. A megvalósítás során neuronhálózatot alkalmaztak az előírt szög valós idejű kiszámításához, valamint szervómotort és enkódert a fizikai rendszer vezérléséhez és méréséhez. A vezérlést Arduino fejlesztőlapok végzik.",
    "keywords": [
      "Acrobot",
      "CLF",
      "DLQR",
      "szabályozás",
      "alulaktuált rendszer"
    ],
    "generated_keywords": [
      "nemlineáris dinamika",
      "kísérleti robotika",
      "valós idejű szabályozás"
    ]
  },
    {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2023,
    "title": "Bicopter modellezése, kivitelezése és irányítása",
    "students": [
      {
        "name": "Marton Tamás-Loránd",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Kutasi Dénes Nimród",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "Dolgozatom célja egy kétmotoros légi robot (bicopter) 2D-s és 3D-s matematikai modellezése és szimulációja, a szabályozási feladatok elméleti és gyakorlati vizsgálata, valamint a robot gyakorlati megvalósítása. A gyakorlati megvalósítás esetében meg kell oldani a már klasszikusnak mondható, az inerciális és mágneses szenzorok esetében fennálló zaj- és eltolás problémákat, erre a feladatra a Kálmán-szűrő a megoldás. Megvalósítottam egy saját valós rendszert (bicoptert), amelyet először síkban, aztán térben is tesztelek. Gyakorlati mérésekkel támasztom alá az elméleti eredményeket.",
    "keywords": [
      "bicopter",
      "Kálmán-szűrő",
      "modellezés",
      "szabályozás"
    ],
    "generated_keywords": [
      "repülő robot",
      "dinamikai modell",
      "érzékelőzaj szűrés"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2023,
    "title": "Feszítőerő szabályozása tekercselőgépnél",
    "students": [
      {
        "name": "Nagy Péter-Ferencz",
        "major": "Sapientia EMTE, Mechatronika, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Dávid László",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "A korszerű gyártástechnológiában a tekercselőgépek nélkülözhetetlen eszközöknek számítanak, különösen a villamos gépek (transzformátorok, villamos hajtások, motorok, esetleg generátorok), hálózati zavarszűrők, fojtótekercsek, áramkorlátozó előtétek gyártásánál. A tekercselési folyamat zavartalan működéséhez elengedhetetlen a huzalban fellépő feszítőerő állandó értéken tartása, így elkerülhető, hogy a menetek túl lazán, túl feszesen vagy egymást keresztezve kerüljenek a csévetestre. Ismert tény, hogy a pontos fordulatszámot inverterrel táplált állandó mágnesű szinkronmotor is biztosíthatja és így a feszítőerőt a motor paramétereiből is vissza lehet becsülni. Továbbá a feszítőerő beállítására elterjedt, korszerű megoldás lehet az elektromágneses fék alkalmazása. Dolgozatomban ezeket a módszereket hasonlítom össze és a feszítőerő becslésének a lehetőségét tanulmányozom.",
    "keywords": [
      "tekercselőgép",
      "feszítőerő",
      "szabályozás",
      "elektromágneses fék"
    ],
    "generated_keywords": [
      "szinkronmotor vezérlés",
      "ipari automatizálás",
      "feszítés becslése"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2023,
    "title": "Hőmérséklet szenzorhálózat hőtérkép készítéshez",
    "students": [
      {
        "name": "Peres Erik",
        "major": "Sapientia EMTE, Automatika és alkalmazott informatika, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Márton Lőrinc",
        "university": "Sapientia EMTE"
      },
      {
        "name": "dr. Fehér Áron",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "A projekt célja olyan hőmérsékletmérésre alkalmazható szenzorhálózat kifejlesztése, amelynek segítségével zárt belső terekben feltérképezhetjük a hőmérséklet eloszlást. A szenzorhálózat kifejlesztése a BLE (Bluetooth Low Energy) kommunikációs technológia köré épül. Ahogy a neve is sugallja, ezt a kommunikációs technológiát kis teljesítményű eszközökben lehet implementálni, olyan alkalmazásokhoz, amelyek nem igényelnek nagy adatfeldolgozást vagy adatátvitelt, és ugyanakkor energiatakarékosak is. A projekt első fázisában egy Nordic Semiconductor NRF52840 mikrovezérlő segítségével adatcsomagokat olvasok be különböző hőmérséklet szenzoroktól, majd ezeket tovább küldöm RS485 protokoll segítségével egy személyi számítógépnek.",
    "keywords": [
      "szenzorhálózat",
      "BLE",
      "hőtérkép",
      "NRF52840"
    ],
    "generated_keywords": [
      "hőmérséklet eloszlás",
      "energiahatékony kommunikáció",
      "RS485 adatküldés"
    ]
  },
  {
  "major": "Hardverfejlesztések és beágyazott rendszerek",
  "year": 2023,
  "title": "Kézfej erezet szkenner berendezés",
  "students": [
    {
      "name": "Vasi András",
      "major": "Sapientia, Számítástechnika, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "dr. Lefkovits László",
      "university": "Sapientia EMTE"
    }
  ],
  "content": "Az emberi kézfejen bonyolult érhálózat található. Az erezetet vénák alkotják. Ezen erezeti térkép minden ember esetében egyedinek tekinthető, tehát alkalmazhatóvá válik ezáltal az egyének azonosítására. A kézfej könnyen hozzáférhető, ezért különböző ipari és felhasználói területeken is alkalmazhatóvá válik a rajta található „véna térkép”, mint biometrikus azonosító. Az általunk készített berendezés lényegében egy speciális fényképezőgép szerepét hivatott betölteni. A szkenner infravörös fényképeket készít a kézfejekről. Az eszközünk egy zárt doboz, melynek egyik oldalán az egyén beteszi a kezét, ráfog egy kapcsolóra, ami elkészíti a fényképet. Az elkészült képeket és az hozzájuk tartozó személyek adatait lehetőségünk van adatbázisokban tárolni. A képeket külső fénytől többnyire izoláltan készítettük el. A képek elkészítéséhez kipróbáltunk több típusú infravörös LED-et és kamerát. A kézfejen található vénák különleges módon verik vissza az infravörös LED-ek fényét (elnyelik), ezért jól kivehető az elkészült képeken az erezet. Az elkészült képeken további kutatások végezhetőek. Az egyéni azonosítás történhet automatikus módszerekkel, de akár mesterséges intelligencia használatával is. A kutatás a rendelkezésünkre álló adatok, képek mennyiségétől függ elsősorban. A berendezés használható továbbá különböző orvosi célokra is, például élő képen történő vénák jobb behatárolására.",
  "keywords": [
    "vénák",
    "infravörös",
    "kamera",
    "adatbázis"
  ],
  "generated_keywords": [
    "biometrikus azonosítás",
    "érzékelés technológia",
    "infravörös képalkotás"
  ]
},
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2023,
    "title": "Nyitott ajtók az ember-gép interfész használatával: a jelszómentes biztonságos beléptetés új megközelítése",
    "students": [
      {
        "name": "Bakó László - Mihály",
        "major": "Sapientia EMTE, Informatika, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Iclănzan Dávid",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "A dolgozatban az ember-gép interfészek alkalmazásának lehetőségét vizsgáltuk, mint egy új megközelítést a jelszómentes biztonságos beléptetésre és felhasználói hitelesítésre. Az ajánlott megközelítésben az aktív kapcsolat, amely valamilyen biometrikus folyamatot monitorizál, egy biztonságosan működő \"dead man switch\" elvén alapuló, átruházhatatlan hitelesítési tokenként szolgál. Ha a kapcsolat megszűnik, a rendszer automatikusan visszavonja a jogosultságokat és kijelentkezteti a felhasználót. A hamisítás és megszemélyesítés elkerülése érdekében a rendszer egyszer használatos kulcsokkal védett kommunikációs protokollt használ a kliensek és az erőforrásokhoz való hozzáférést igazgató szerver között. A kutatás során a biztonság, kényelem és költséghatékonyság kritériumai mentén elemeztük a lehetséges megoldásokat, majd implementáltunk egy kényelmesen viselhető látókéreg aktivitását monitorizáló és egy olcsón kivitelezhető pulzusfigyelésen alapuló rendszert. Az elkészült rendszereket teszteltük megbízhatóságuk és biztonságuk felmérésére.",
    "keywords": [
      "ember-gép interfészek",
      "jelszómentes beléptetés",
      "felhasználói hitelesítés",
      "biometrikus folyamatok"
    ],
    "generated_keywords": [
      "biztonságos beléptetés",
      "biometrikus token",
      "aktív felügyelet"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2023,
    "title": "Összefonódó hálózatok",
    "students": [
      {
        "name": "Derzsi Dániel",
        "major": "Sapientia EMTE, Informatika, 3. év"
      },
      {
        "name": "Ambarus Róbert-Béla",
        "major": "Sapientia EMTE, Informatika, 2. év"
      },
      {
        "name": "Nagy Szabolcs",
        "major": "Sapientia EMTE, Informatika, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Jánosi Rancz Katalin Tünde",
        "university": "Sapientia EMTE"
      },
      {
        "name": "dr. Kása Zoltán",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "A dolgozat célja a matematikusok hálózatainak vizsgálata. Ehhez két adathalmazt használunk: az MGP adatbázist, amely tartalmazza a matematikából doktoráltak adatait, és a MathSciNet-et, amely tartalmazza a matematikai folyóiratokban megjelenő szakcikkek rövid ismertetését. Értelmezünk összefonódó hálózatokat (gráfokat), amelyek esetében a két vagy több hálózat ugyanazt a csúcshalmazt használja. Az így értelmezett hálózat új felhasználási lehetőségeket nyújt. Különböző vizualizációs eszközöket használunk ezek megjelenítésére.",
    "keywords": [
      "hálózatok",
      "gráfok",
      "vizualizáció",
      "MGP",
      "MathSciNet"
    ],
    "generated_keywords": [
      "összefonódó gráfok",
      "matematikai publikációk",
      "tudományos hálózatelemzés"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2023,
    "title": "Tőzsdei árfolyamok előrejelzése mesterséges intelligenciával árfolyamok és hírfolyamok alapján",
    "students": [
      {
        "name": "Jakab Etele",
        "major": "Sapientia EMTE, Informatika, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "dr. Horobeț Emil",
        "university": "Sapientia EMTE"
      },
      {
        "name": "dr. Dávid László",
        "university": "Sapientia EMTE"
      }
    ],
    "content": "A pénzügyi elemzések egyik legvizsgáltabb területe a részvénykereskedelem. A kutatás célja olyan módszer kidolgozása, amely nagy pontosságú előrejelzésekre képes a piaci változások tekintetében korábbi piaci adatok és hírfolyamok alapján. Kiinduló adathalmazok elemzésére külön-külön is hatékony módszereket fejlesztettünk, dokumentáltunk, teszteltünk, majd kombináltuk őket. Ezen felül egy olyan alkalmazás fejlesztése is cél volt, amely valós időben képes ábrázolni tőzsdei adatokat, már ismert és újonnan kidolgozott módszerekkel előrejelezni a piaci változásokat.",
    "keywords": [
      "tőzsde",
      "adatelemzés",
      "mesterséges intelligencia",
      "előrejelzés"
    ],
    "generated_keywords": [
      "pénzügyi predikció",
      "hírfolyam elemzés",
      "valós idejű adatszolgáltatás"
    ]
  },
  {
  "major": "Informatika és szoftverfejlesztés",
  "year": 2023,
  "title": "Önvezető jármű konvoj",
  "students": [
    {
      "name": "Szász Csaba",
      "major": "Sapientia Erdélyi Magyar Tudományegyetem, Automatizálás és alkalmazott informatika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "dr. Fehér Áron",
      "university": "Sapientia Erdélyi Magyar Tudományegyetem"
    },
    {
      "name": "dr. Márton Lőrinc",
      "university": "Sapientia Erdélyi Magyar Tudományegyetem"
    }
  ],
  "content": "A dolgozat célja egy szimulált önvezető konvoj megvalósítása és vizsgálata, amely lecsökkenti az emberi beavatkozás szükségességét, segít a balesetek elkerülésében, és javít a járművek üzemanyag fogyasztásán. Ez a jármű konvoj egy vezér járműből és egy vagy több követő járműből áll. Ennek a projektnek a megvalósítására a Webots szimulációs környezetet használtuk. A Webots-on belül készítettem két különböző robot típust: vezér és követő robot(ok), illetve egy teszt pályát, ami két folytonos fehér sávval szegélyzett út. Felépítésükben ez a két robot típus hasonló, két kerekes mobilis robotok, kamerával, GPS-el, iránytűvel és LIDAR-ral vannak felszerelve. A lényeges különbség a vezérlésükben rejlik. A dolgozatban tárgyalom a járművek sávtartását, a vezér jármű konstans sebesség szabályozását, illetve a követő járművek konstans idő és távolság tartását. A robot járművek vezérlését Python programozási környezetben valósítottam meg. A szimulációs mérések azt mutatják, hogy a jármű robotok képesek sáv tartásra és konvojban haladásra a javasolt irányítási módszer alkalmazásával.",
  "keywords": [
    "önvezető",
    "képfeldolgozás",
    "sávtartás",
    "szabályzás",
    "Python",
    "követés",
    "Webots"
  ],
  "generated_keywords": [
    "szimulált járműkonvoj",
    "robotirányítás",
    "automatikus sávtartás"
  ]
}
]