[
    {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2025,
    "title": "Deutsche Kontaktphänomene in den Fachsprachen des 19.",
    "students": [
      {
        "name": "Bartha Örs-Csaba",
        "major": "Sapientia EMTE, Fordító és tolmács szak, II"
      }
    ],
    "teachers": [
      {
        "name": "dr. Kommer Alois-Richard",
        "university": "EMTE, Marosvásárhelyi Kar, Alkalmazott Nyelvészeti Tanszék"
      }
    ],
    "content": "Meine Forschung konzentriert sich auf das Auftreten deutscher Wörter aus dem 19. Jahrhundert in der ungarischen Sprache. In diesem Jahrhundert blieben viele Ausdrücke im Sprachgebrauch der ungarischen Gemeinschaft in Siebenbürgen erhalten, die bis heute in der Alltagssprache vorkommen. Ich habe dieses Jahrhundert als Untersuchungszeitraum gewählt, weil Siebenbürgen damals noch unter ungarischer Herrschaft stand und die zahlreich vorhandenen Minderheiten (Rumänen und Sachsen) täglich miteinander in Kontakt waren, wodurch sich die Möglichkeit bot, dass Lehnwörter auftauchten und sich verbreiteten. Nicht nur auf dieses Jahrhundert bezogen – es genügt, an eingedeutschte Wörter wie Spajsz (Speisekammer), Colostok (Zollstock) oder Rükverc (Rückwärtsgang) zu denken, um zahlreiche Begriffe zu finden, die das Ungarische aus dem Deutschen übernommen hat. Um diese Wörter zu bestimmen, ist es notwendig, sie in Kategorien zu unterteilen, also zu analysieren, wie ihre Entstehung zustande kam – beispielsweise durch vollständige oder teilweise Übernahme. Die vollständige Übernahme bedeutet, dass das Wort in der Zielsprache die volle Bedeutung der Ursprungssprache behält, während es bei der teilweisen Übernahme nur in einem bestimmten Kontext Sinn ergibt oder ohne ergänzende Wörter keine vollständige Bedeutung erhält. Mein Forschungsschwerpunkt liegt auf den Fachbegriffen verschiedener Handwerksberufe. Ich untersuche, wo und in welcher Form damals Wörter auftraten, die in einer Fachsprache verwendet wurden (zum Beispiel im Schmiedehandwerk). Eine zentrale Rolle in meiner Untersuchung spielt die Datenbank des Erdélyi Magyar Szótörténeti Tár (Siebenbürgisches Ungarisches Wörterbuch zur Sprachgeschichte), in der sich zahlreiche Ausdrücke finden lassen, die offiziell in dieser Epoche auftauchten und darüber auch schriftliche Aufzeichnungen existieren. Neben dieser Datenbank recherchiere ich auch in zeitgenössischen Quellen, in denen solche Wörter erhalten geblieben sind. Ich möchte diese Ausdrücke erforschen, um zu ermitteln, wo, in welcher Form und in welchem Kontext sie verwendet wurden, sowie um die Art der Übernahme in Kategorien zu unterteilen.",
    "keywords": [],
    "generated_keywords": [
      "Deutschen"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2025,
    "title": "Translating Cultural Elements in the Székelyföldi Legendárium",
    "students": [
      {
        "name": "Lokodi Brigitta",
        "major": "Sapientia EMTE, Fordító és tolmács szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Nagy Imola Katalin",
        "university": "Marosvásárhelyi Kar, Alkalmazott Nyelvészeti Tanszék"
      }
    ],
    "content": "This paper explores the translation challenges of Székelyföldi Legendárium, focusing on proper names, titles, geographical names and realia in children’s literature (as far as this oeuvre can be considered literature written for children). By comparing the Hungarian, English, and Romanian versions, the study examines how cultural heritage is preserved or altered through translation. The theoretical background which we rely upon investigates issues of translation strategies, realia, children’s literature, the birth of Székelyföldi Legendárium, and speaking names. We discuss translation strategies for the rendering of proper names, geographical names, and titles, as well as the handling of realia in a multilingual context. The practical section provides a comparative analysis of selected legends and tales, highlighting linguistic and cultural adaptation issues. A dedicated subchapter examines speaking names, investigating how they are translated while maintaining or modifying their original meaning and cultural connotations. The research is organized through the selection of texts (in terms of difficulty and length), followed by the translation of legends and tales using machine translation (ChatGPT) and human translation (translation students). This is followed by an analysis based on a comparison of the translations using different criteria. The findings indicate that translating culturally rich texts requires a balance between domestication and foreignization. While some elements are successfully adapted, others face semantic loss, requiring creative solutions. Additionally, the research suggests that artificial intelligence is continuously improving, especially with human proofreading, and that in the near future, collaborations between humans and AI or machine translation tools will lead to high-quality translations. The study contributes to the broader discussion on translating folklore and cultural heritage for younger audiences. 26",
    "keywords": [],
    "generated_keywords": [
      "ChatGPT",
      "English",
      "Hungarian",
      "Romanian",
      "Székelyföldi Legendárium"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2025,
    "title": "Traductibilitate-intraductibilitate: traducerea proverbelor",
    "students": [
      {
        "name": "Molnár Apollónia",
        "major": "Sapientia EMTE, Fordító és tolmács szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Nagy Imola Katalin",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Nyelvészeti Tanszék"
      }
    ],
    "content": "Tema generală a acestei lucrări este traducerea proverbelor, care reprezintă condensarea în expresii scurte, concise a unor comportamente umane, sfaturi de viață, observații generale izvorâte din memoria culturală colectivă. În partea teoretică am prezentat o abordare lingvistică a proverbelor cu o aplecare deosebită asupra rolului lor în limbă, după care am făcut o scurtă introducere în problematica traducerii și specificul traducerii acestor unități lingvistice. Pentru cercetarea mea, am stabilit mai întâi câte proverbe voi aborda și în ce grup specific din cadrul subiectului: am ales două grupuri pe baza unui criteriu semantic, am selectat 50-50 de proverbe din fiecare categorie, în prima categorie cuprinzând proverbe legate de animale și în al doilea proverbe legate de gastronomie și alimente. În cadrul cercetării mele mai întâi am realizat o cercetare cantitativă pe o cohortă formată din tineri maghiari din Transilvania, cu vârste cuprinse între 18 și 35 de ani, cu scopul de a evalua cunoașterea și utilizarea proverbelor de către această categorie a populației. Pe baza datelor obținute, am continuat cercetarea folosind o metodă calitativă. Am translat corpusul obținut folosind traducerea automată (DeepL) și inteligența artificială (ChatGPT). Traducerile obținute le-am comparat cu proverbele echivalate adunate de István Vöő în Dicționarul de proverbe maghiar-român (1984). Ipoteza tezei mele, conform căreia nici traducerea automată (DeepL), nici inteligența artificială (ChatGPT) nu sunt capabile de echivalarea acestor forme lingvistice și că traducerile generate de aceste programe, în majoritatea cazurilor, nu corespund sensului sau stilului textelor în limba sursă, a fost parțial confirmată.",
    "keywords": [],
    "generated_keywords": [
      "ChatGPT",
      "DeepL",
      "Transilvania"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2025,
    "title": "The role of video games in language acquisition",
    "students": [
      {
        "name": "Kertész Zsuzsa",
        "major": "Sapientia EMTE, Fordító és tolmács szak, III."
      }
    ],
    "teachers": [
      {
        "name": "drd. Barabás Blanka",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Nyelvészeti Tanszék"
      }
    ],
    "content": "In formal education, foreign languages are taught through explanations of grammatical rules and the use of exercises. Video games, however, provide an immersive experience in which players must interact with the game world in a specific language (which is most often English). In this way, learning the language of the game resembles first-language acquisition, where children learn from the people and the environment around them. As gaming has become a popular pastime among younger generations, its linguistic effects can be widely felt, as people who play regularly often have an advantage in English skills over those who only studied the language in school. My project aims to investigate how playing video games influences foreign language acquisition. In my paper, I address this question in detail, first, by introducing the relationship between different video game genres and language areas, and analyse the differences between traditional teaching approaches and learning from a game environment. The research employs both quantitative and qualitative research methods, in the form of a questionnaire and focus group conversations; the latter follow up on the topics of the form and provide personal insight into the case.",
    "keywords": [],
    "generated_keywords": [
      "English"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2025,
    "title": "The terminological characteristics of the football jargon in different languages",
    "students": [
      {
        "name": "Kacsó Norbert",
        "major": "Sapientia EMTE, Fordító és tolmács szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Sárosi-Márdirosz Krisztina Mária",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Nyelvészeti"
      }
    ],
    "content": "Examining the different uses of language in football could be a quite interesting field of study considering the development of certain technical terms and expressions. This paper analyses mainly the commentators’ language use during broadcasts from a quantitative point of view focusing on the occurrence of emotional expressions, analytics, negative or positive comments. Further investigations are time-based measurement and voice-tone analysis. Another aspect of the research is the elaboration of the parallel terminological database containing terms in Hungarian and Romanian and the comparative analysis of the included terminological data. Moreover, the scrutiny of several tabloids and breaking news will help the research to see a clearer picture. To examine the above research items, specific matches were analysed. The technical words used in these clashes by the commentators were observed, lists of terms were gathered and a comparison was made with the help of the different terminological databases to supervise the differences between these language usages. The expression analysis gives help to track how many tactical insights, statistics or emotional expressions were uttered during the broadcasts. The highlights are studied, and numerical data can be collected through that to obtain more tangible results. The comparison of the two distinct sport culture gives further angles about the relations with football, the language use and impacts on emotions tell, enough about the attitudes. Several news in both languages were compared the same way and analogies could be observed between the two types of journalism. The general results of the research present an excellent image about the differences and similarities between the characteristics of football in Romanian and Hungarian language.",
    "keywords": [],
    "generated_keywords": [
      "Hungarian",
      "Romanian"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2025,
    "title": "English and Hungarian",
    "students": [
      {
        "name": "András Noémi",
        "major": "Sapientia EMTE, Fordító és tolmács szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Sárosi-Márdirosz Krisztina Mária",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Nyelvészeti"
      }
    ],
    "content": "The main topic of my paper is the use of exercise names during workouts, specifically among Transylvanian Hungarian gym-goers focusing on which language these exercises are named in, and the proportion of languages used. I chose this topic because, based on my experiences, it is common for some exercises to be referred to by their English names, even though Hungarian equivalent exists. At the same time, I have also encountered situations where I could only name certain exercises in English or only in Hungarian. Therefore, my hypothesis is that English terminology is more commonly used among gym-goers compared to Hungarian. In the theoretical section, I will summarize the existing research findings focusing on terminology, particularly in the field of sports terminology. I will also examine neologisms in both general language and sports-specific language, the prestige of the English language, and the phenomenon of language contact in the context of Language for Specific Purposes (LSP). For my research, I applied the semi-structured interview method and selected interviewees who regularly attend the gym. The interviews examine, firstly, whether the participants are more familiar with the English or Hungarian terminology of exercise names, what motives influence their preference. Secondly, the study explores how gym-goers communicate with each other during workouts, including the language they use when giving instructions, asking for help or discussing exercises.",
    "keywords": [],
    "generated_keywords": [
      "English",
      "Hungarian",
      "LSP",
      "Transylvanian Hungarian"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2025,
    "title": "How Linguistic Bias Transcends the Language Barrier in Film",
    "students": [
      {
        "name": "Balázs Zoltán",
        "major": "Sapientia EMTE, Fordító és tolmács szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Fazakas Noémi",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Nyelvészeti Tanszék E"
      }
    ],
    "content": "This paper aims to examine the Hungarian translations of 3 American films featuring African American characters and to explore how the translated versions retain the linguistic profiling of these characters, originally associated with African-American Vernacular English. After introducing the concept of linguistic stratification (Labov 1966), the paper examines the historical and contemporary bias against AAVE and its speakers. Since negative attitudes towards various social or linguistic groups are often related to the respective group’s portrayals in the media, the roles given to Black actors – and thus AAVE speakers – in historical Hollywood movies is also examined, concluding that their portrayals have been decisively negative. A connection was thus established between a certain type of character and their dialect, which was then provably carried across to animated movies. The question arises as to how this connection can be approximated in films translated to other languages. The paper investigates this question in the context of Hungarian dubbing. The paper analyzes 3 films that are part of the subgenre of Hood films, which often feature majority Black casts and heavy usage of AAVE. I compiled a corpus from the chosen movies, in which the examples are sorted according to the identified transfer operations. Special attention is given to lines featuring grammatical phenomena or vocabulary items associated with AAVE. Current results indicate that not only does linguistic profiling persist through the language barrier, but it can also be introduced or exacerbated during the translation process.",
    "keywords": [],
    "generated_keywords": [
      "AAVE",
      "African American",
      "African-American Vernacular English",
      "American",
      "Black"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2025,
    "title": "Toponyms of Korond",
    "students": [
      {
        "name": "Birtalan Mária-Alexandra",
        "major": "Sapientia EMTE, Fordító és tolmács szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Fazakas Noémi",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Nyelvészeti Tanszék"
      }
    ],
    "content": "My paper presents and summarizes the preliminary findings of my ongoing research project in the field of toponymy, conducted in the framework of the Hungarian National Toponymy Research Program (in Hungarian: Magyar Nemzeti Helynévtár Program, abbreviated as: MNHP). The goal of the program is to collect all place-names in every settlement in the Carpathian Basin with a historical Hungarian presence and also to create the comprehensive online and printed database of such place-names. Within this project, my research aims to collect and analyze the historical and contemporary toponyms of the village Korond (Corund) in Romania as well as to identify the changes in the present-day local place-name corpus using a diachronic approach. In my research, I make use of the previous studies discussing the toponyms of the village. Within the project, I apply two main methods: extracting data from available historical sources as well as conducting interviews with locals. The diachronic changes of the corpus are assessed, and by shifting the focus towards the input of the interview subjects, the research also offers an insight into the local interpretations of the factors that had contributed to such changes.",
    "keywords": [],
    "generated_keywords": [
      "Carpathian Basin",
      "Corund",
      "Hungarian",
      "Korond",
      "MNHP"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2025,
    "title": "Das Bild der Ungarn in den Werken von Eginald Schlattner",
    "students": [
      {
        "name": "Péter Anita",
        "major": "Sapientia EMTE, Fordító és tolmács szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Kommer Alois-Richard",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Nyelvészeti Tanszék"
      }
    ],
    "content": "Eginald Schlattners Werke sind geprägt von der multiethnischen Realität Siebenbürgens und reflektieren die sprachlichen, kulturellen und historischen Spannungen, die das Zusammenleben verschiedener Gruppen im 20. Jahrhundert bestimmten. Der Friedensvertrag von Trianon spielte dabei eine zentrale Rolle, da er Siebenbürgen nach dem Ersten Weltkrieg Rumänien zusprach und eine neue gesellschaftliche Ordnung schuf, in der Deutsche, Ungarn und Rumänen in enger Nachbarschaft lebten. Besonders in der Stadt Fogarasch, dem Handlungsort vieler seiner Romane, zeigt Schlattner ein Nebeneinander verschiedener Ethnien als scheinbar utopische, aber gleichzeitig komplexe Realität. Eine zentrale Frage, die sich in diesem Kontext stellt, ist die nach der Identität: Was bedeutet es, in einer deutschsprachigen Familie aufzuwachsen, während der öffentliche Raum von einer Mehrsprachigkeit geprägt ist? Welche Auswirkungen hat dies auf die Selbstwahrnehmung und die kulturelle Zugehörigkeit? Schlattners autobiografisch inspirierte Romane – Der geköpfte Hahn, Rote Handschuhe und Das Klavier im Nebel – setzen sich intensiv mit diesen Fragen auseinander und bieten eine vielschichtige Perspektive auf die sprachlichen und kulturellen Interaktionen zwischen den deutschen und ungarischen Gemeinschaften. Die Untersuchung dieser Werke wird nicht nur Schlattners persönliche Erfahrungen beleuchten, sondern auch die Rolle der ungarischen Kultur in seinem Leben und literarischen Schaffen herausarbeiten. Ein besonderer Fokus liegt auf der sprachlichen und kulturellen Identität der Figuren sowie auf den Herausforderungen, die sich aus dem interkulturellen Zusammenleben ergeben. Am Ende der Analyse sollen die zentralen Fragen zur Identitätsbildung beantwortet und die Bedeutung von Sprache und Kultur für die Darstellung der ungarisch-deutschen Beziehungen in Schlattners Werk herausgearbeitet werden.",
    "keywords": [],
    "generated_keywords": [
      "Deutsche"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2025,
    "title": "Translating Irony: A Comparative Study of Emily Brontë’s Wuthering Heights",
    "students": [
      {
        "name": "György Simon Dalma",
        "major": "Sapientia EMTE, Fordító és tolmács szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Sárosi-Márdirosz Krisztina",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Nyelvészeti Tanszék"
      }
    ],
    "content": "No matter the genre, the translation of irony and ironic elements has always cause difficulties for translators. This paper was written with the aim of examining the methods a translator employs when transferring this complex mode of expression from one language to another. The research corpus consists of Emily Brontë’s novel Wuthering Heights. I chose this work because I believe that translating a Victorian-era English literary work is inherently challenging for a translator, especially if they strive to faithfully convey its stylistic characteristics in the target language, including the translation of irony and ironic elements. In the theoretical part of the present paper, I contextualize Emily Brontë’s novel Wuthering Heights and I introduce some theoretical questions and principles related to translation, including a brief description of the translation operations described by Kinga Klaudy. These theoretical elements help us to understand which procedures and methods are used by the translator to transform the source text into the target text. Furthermore, my paper includes a classification of literary irony based on Pierre Skorov. In the practical part of my paper, I describe the research methodology and then in the chapter dealing with the analysis I present excerpts which contain ironical elements from the work in tables in source and target language. First, I will contextualise the excerpt in question, then I aim to determine which type of irony it corresponds to, and afterwards I turn to analyse it from a translation technique’s point of view. The scope of my paper is not deliberately to examine all the transfer operations but to examine ironical elements that may cause difficulties for the translator and to show how these were dealt with in this translation. To highlight this, during the parallel analysis of the source and target language excerpts I will also examine how some translation techniques are used by the translator.",
    "keywords": [],
    "generated_keywords": [
      "Emily Brontë",
      "English",
      "Kinga Klaudy",
      "Pierre Skorov",
      "Victorian-era"
    ]
  },
   {
    "major": "Egészségtudomány",
    "year": 2025,
    "title": "Az időskorú népesség életminősége Európában",
    "students": [
      {
        "name": "Varga Viola",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak,"
      }
    ],
    "teachers": [
      {
        "name": "dr. Sántha Ágnes-Rózsa",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "Bevezetés: Az időskorral együtt jár a visszavonulás, a legtöbb esetben az időseknek meggyengülnek kapcsolataik a külvilággal. Az idősek társadalmi helyzetét elsősorban a függőségi és a kivonulási elméletek tárgyalják. Életminőségüket több dimenzió befolyásolja, többek között az egészségérzet, az élettel való elégedettség és a pénzügyi helyzet. Célok, hipotézisek: Kutatásom feltáró és magyarázó jellegű, és a 65 év fölötti európai idősek életminőségét és egészségi állapotát, valamint azok befolyásoló tényezőit vizsgálja. Módszerek: Kutatásom során kvantitatív módszerként a European Social Survey nemzetközi kutatás 2023/24- es adatfelvételének a 65 év fölöttiek részmintáját elemeztem. Leíró és kétváltozós statisztikai módszerekkel világítom meg az idős népesség életminőségének néhány kiválasztott dimenzióját. Eredmények: Az európai idős népesség egyharmada valamilyen funkcionális korlátozottsággal küzd. A családi állapot nagyban befolyásolja az idősek élettel való elégedettségét. Azon idősek, akik törvényes házasságban vagy partnerrel élnek, elégedettebbek az életükkel, mint az egyedül élők vagy özvegyek. Ugyanakkor a statisztikai elemzésem során azt találtam, hogy a nemek között jelentős a különbség: a 65 éven felüli idős nők kevésbé elégedettek az életükkel, mint velük egykorú társaik. Ez egy nagyon izgalmas felfedezés, mivel a nők általában elégedettebbek az életükkel, mint a férfiak, és a 65 évnél fiatalabb mintában nem volt szignifikáns eltérés a két nem között ebben a kérdésben. Tehát joggal terelődik a figyelmünk az idős nők életminőségének dimenzióira és annak befolyásoló tényezőire, hogy rálátást nyerjünk ezen különbségek okaira és esetleges javító intézkedéseket tehessünk a jövőben. Összefoglalás/Következtetések: Kutatásom naprakész eredményekkel szolgál az európai idősek életminőségéről és egészségi állapotáról.",
    "keywords": [],
    "generated_keywords": [
      "European Social Survey",
      "nők"
    ]
  },
  {
    "major": "Egészségtudomány",
    "year": 2025,
    "title": "Kézhigiéniai ismeretek és szokások kisiskolások körében",
    "students": [
      {
        "name": "Lovász Rebeka",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, I"
      }
    ],
    "teachers": [
      {
        "name": "dr. Sántha Ágnes-Rózsa",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok"
      }
    ],
    "content": "A kézhigiénia fontossága a közelmúltban előtérbe került, és a Covid-pandémia enyhülésével legutóbb a Hepatitis A-fertőzések okán vált ismét aktuálissá. A gyermekek körében a higiéniai, elsősorban kézhigiéniai ismeretek átadása és begyakoroltatása nem könnyű feladat. Kutatásom célja hangsúlyozni a higiéniai szokások elsajátításának fontosságát az egészségére nézve, kiemelten a kézhigiénia elmulasztásának kockázatait. A szakirodalmi áttekintésben ismertetett kézhigiénia-kutatások ugyan a felnőtteken alapszanak, de kiemelték a korai korban történő elsajátítás lényeges szerepét. Dolgozatom célja a kisiskolás korú gyermekek kézhigiéniás ismereteinek és szokásainak mérése, majd azok fejlesztése és újbóli vizsgálata. Kutatásom szakirodalmi áttekintés, melyet egy kutatási tervvel egészítek ki. Kutatásokat elemezve egy empirikus vizsgálatot tervezek meg, melyet egyhetes egészségfejlesztő beavatkozás követ a kézmosási ismeretek és szokások fejlesztésére. A beavatkozás előtt alaphelyzetben mérem a kisiskolások tudását és kézmosásuk hatékonyságát a Semmelweis Hand-in-Scan készülékkel, majd a tevékenységek után ismét megmérem ezeket a jellemzőket. A mérést három hónap elteltével megismétlem, hogy feltárjam az ismeretek és szokások hosszú távú berögzülésének mértékét. Az egészségfejlesztő tevékenységtől a célcsoport kézmosási ismereteinek és szokásainak javulását várom. Kutatásom alapján további egészségfejlesztő tevékenységek tervezhetők hazánkban, amelyek reményeim szerint hozzájárulnak a fertőző betegségek számának csökkenéséhez.",
    "keywords": [],
    "generated_keywords": [
      "Covid-pandémia",
      "Hepatitis A-fertőzések",
      "Semmelweis Hand-in-Scan"
    ]
  },
  {
    "major": "Egészségtudomány",
    "year": 2025,
    "title": "Intézkedések a 2024-es Milton hurrikán előtt és után",
    "students": [
      {
        "name": "Kovács Ingrid",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, II."
      }
    ],
    "teachers": [
      {
        "name": "dr. Máthé Réka Zsuzsanna",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A 2024-es Milton hurrikán jelentős veszélyt jelentett a lakosság biztonságára és egészségére, súlyos pusztítást okozva az érintett térségekben. A katasztrófa előtt és után hozott intézkedések döntő szerepet játszottak a veszteségek minimalizálásában és a helyreállítási folyamatok hatékonyságának növelésében. A tanulmány célja, hogy elemezze a kormányzati és helyi szereplők válságkezelési stratégiáit, különös tekintettel a megelőzés, a vészhelyzeti reagálás, a helyreállítás hatékonyságára és a közegészségügyi veszélyekre. A kutatás központi kérdései arra irányulnak, hogy milyen hatással volt a hurrikán az egészségügyi ellátásra, a katasztrófavédelmi intézkedésekre és a helyi közösségek ellenállóképességére, valamint hogy a szövetségi, állami és helyi kormányzatok milyen változtatásokat kezdeményeztek a válságkezelés fejlesztésére. A kutatás hivatalos jelentéseket, szakirodalmi forrásokat használ fel annak érdekében, hogy átfogó képet nyújtson a hurrikán előrejelzésének pontosságáról, az evakuációs stratégiák hatékonyságáról, valamint a helyreállítási folyamatok szervezéséről. A tanulmány részletesen bemutatja a hurrikán előtti védelmi stratégiákat, ideértve az időjárási előrejelzések pontosságát, az evakuációs tervek kidolgozását, az infrastruktúra megerősítését és a lakosság tájékoztatását. A katasztrófa utáni intézkedések közé tartozott a mentési műveletek gyors megszervezése, a humanitárius segélyezés koordinálása, valamint az újjáépítési folyamatok megkezdése.",
    "keywords": [],
    "generated_keywords": [
      "Milton",
      "humanitárius segélyezés"
    ]
  },
  {
    "major": "Egészségtudomány",
    "year": 2025,
    "title": "Láthatatlan küzdelmek: a mentális egészség válsága Romániában",
    "students": [
      {
        "name": "Bakos Imola Adrienn",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, II."
      },
      {
        "name": "Révész Annamária",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, II."
      }
    ],
    "teachers": [
      {
        "name": "dr. Tóth-Batizán Emese Emőke",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "Bevezetés: A mentális egészség megőrzése napjaink egyik legfontosabb társadalmi és egészségügyi kihívása. Romániában különösen releváns ez a téma a fokozott stresszterhelés, a kiégés, a mentális betegségeket övező tabuk, valamint a fiatalok mentális állapotát befolyásoló tényezők, például a digitális világ hatásai és a COVID-19 utóhatásai miatt. Továbbá az országban az öngyilkossági arány és az alkoholfogyasztás is kiemelkedően magas, ami a mentális egészség támogatásának hiányát tükrözi. Ezek a problémák nemcsak az egyén jóllétét érintik, hanem hatással vannak az oktatásra, a munkaerőpiacra és a társadalom egészére is. Kutatási cél: A kutatásunk célja, hogy feltárjuk a mentális egészség prevalenciájának változását az elmúlt 10 évben. Ezzel párhuzamosan azt is vizsgáljuk, hogy a romániai román és magyar nyelvű sajtóban hogyan változott a mentális egészség tematizálása, valamint vannak-e különbségek a román és magyar nyelvű médiaorgánumokban e tekintetben. Emellett célunk megérteni, hogy az oktatási intézmények milyen módon támogathatnák hatékonyabban a hallgatók mentális egészségének megőrzését és fejlesztését. Kutatási módszer: Kutatásunk során a módszertani trianguláció elvének megvalósítására törekedtünk. Kvalitatív módszertani megközelítéseket és kvantitatív módszereket egyaránt használtunk. Irányított félstrukturált mélyinterjúkat készítettünk, elemeztük a romániai román és romániai magyar nyelvű médiaorgánumok mentális egészséggel kapcsolatos újságcikkeit, valamint az Országos Közegészségügyi Intézet (Institutul Național de Sănătate Publică) által rendelkezésünkre bocsátott, mentális egészséggel kapcsolatos adatokat. Az interjúk során a mentális egészséget érintő kihívásokra, megküzdési stratégiákra és a szükséges támogatási formákra fókuszáltunk. Az interjúk, valamint az újságcikkek elemzését az Atlas.ti szoftver segítségével végeztük, amely lehetővé teszi az adatok rendszerezését és a mélyebb összefüggések feltárását. Következtetések: Kutatásunk rávilágított arra, hogy a mentális egészség egyre nagyobb figyelmet kap Romániában, de továbbra is számos kihívás áll fenn. Az elmúlt évtizedben a mentális betegségek gyakorisága nőtt, különösen a fiatalok körében. A médiaelemzés szerint a mentális egészség tematizálása gyakoribbá vált, de a román és magyar nyelvű sajtó eltérő hangsúlyokat alkalmaz. Az oktatási intézmények szerepe kulcsfontosságú, de a jelenlegi támogatások nem mindig elegendőek. A hallgatók igénylik a könnyebb pszichológiai segítségnyújtást és a stresszkezelési stratégiák oktatását. Összességében a mentális egészség javítása átfogó megközelítést igényel, amelyben a média, az oktatás és a közegészségügyi szervezetek együttműködése alapvető.",
    "keywords": [],
    "generated_keywords": [
      "Atlas.ti",
      "COVID-19"
    ]
  },
  {
    "major": "Egészségtudomány",
    "year": 2025,
    "title": "Fogság és egészség. A fogvatartottak egészségkockázatai",
    "students": [
      {
        "name": "Hegyi Noémi",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, II."
      }
    ],
    "teachers": [
      {
        "name": "dr. Sántha Ágnes-Rózsa",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A büntetés-végrehajtási intézetekben világszerte komoly kérdéseket vet fel a fogvatartottak egészségi állapota, annak ellátása és fenntartása, mivel számos tényező, például a túlzsúfoltság, higiéniai körülmények és gyakori betegségek befolyásolják a megfelelő működést. A különböző európai uniós és romániai börtönstatisztikák világítanak rá arra, hogy a fogvatartottak milyen egészségkockázatokkal szembesülnek. Jelen dolgozat a börtönegészségügy egészét taglalja az Európai Unió és Románia kontextusában. Kitér a statisztikai jelentésekre és a jogi háttérre, amiben meghatározza az elítéltek jogait. Emellett részletesen érinti a különböző betegségeket és az önártalmakat, valamint a droghasználattal kapcsolatos kérdéseket, amelyek előfordulnak a büntetés-végrehajtási intézményekben. Nem utolsó sorban pedig foglalkozik a női fogvatartottakkal, figyelembe véve a nemspecifikus, sajátos problémákat is. A dolgozatom feltáró jellegű, a szakirodalmi kutatásra épül, a továbbiakban pedig fogvatartottakkal tervezek interjúkat készíteni és azokat az egészségkockázatok szempontjából elemezni.",
    "keywords": [],
    "generated_keywords": []
  },
  {
    "major": "Egészségtudomány",
    "year": 2025,
    "title": "Colectiv – tragédia a bukaresti szórakozóhelyen",
    "students": [
      {
        "name": "Eröss István",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, II."
      }
    ],
    "teachers": [
      {
        "name": "dr. Máthé Réka Zsuzsanna",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A dolgozat a 2015-ös bukaresti Colectiv nevezetű szórakozóhelyen történt tragédia előzményeit vizsgálja, amely 64 személy halálához, illetve több, mint 150 személy sérüléséhez vezetett. Kutatás célja felderíteni a rendszer szabálytalanságait, amely hozzájárult a tragédia kialakulásához. Kiemelt figyelmet kap a korrupció jelenléte, amely meghatározó szerepet tölt be a tűzvédelmi rendelkezések elmulasztásában, az egészségügyben felmerülő problémákra. A kutatás módszertani alapja az alulról felfele történő elemzésen alapszik, mely lehetővé teszi a közpolitikai döntések, mulasztások vizsgálatát. A jogi témakör elemzése során összehasonlításra kerülnek a tűzvédelmi előírások és azok tényleges alkalmazása a valóságban. A közpolitikai elemzés az elitizmus és csoportelmélet keretein belül vizsgálja az olyan gazdasági, illetve politikai döntések, melyek tragédiához vezettek. A dolgozat kiemeli a média szerepét, a tragédia eseményeinek napirendre kerülését, feltárva a korrupciós ügyeket. Az elemzés rávilágít arra, hogy a tragédia elkerülhető lett volna megfelelő jogszabályok alkalmazásával és hatékonyabb ellenőrzéssel.",
    "keywords": [],
    "generated_keywords": []
  },
  {
    "major": "Egészségtudomány",
    "year": 2025,
    "title": "Evaluating Nursing Students’ Experiences",
    "students": [
      {
        "name": "Onolaja Eniola Ebitienye Ngozi",
        "major": "Debreceni Egyetem, Egészségtudományi Kar"
      }
    ],
    "teachers": [
      {
        "name": "dr. Barth Anita",
        "university": "University of Debrecen, Faculty of Health Sciences"
      }
    ],
    "content": "Background: Simulation-based training (SBT) has become an essential component of nursing education, offering a controlled environment for students to apply theoretical knowledge, develop clinical skills, and build confidence. Aim: This study aimed to evaluate the experiences and perceived effectiveness of SBT among second-year international nursing students at the University of Debrecen. Methods: A qualitative research design was employed using semi-structured interviews with sixteen students following their participation in high-fidelity simulation sessions. Colaizzi’s phenomenological method was used for data analysis to extract themes from students’ narratives. Results: Three major themes emerged: emotional responses to simulation, learning through simulation, and application of simulation-based skills to clinical practice. Students reported initial anxiety, which transformed into increased confidence. SBT enhanced knowledge retention, clinical reasoning, and practical nursing skills. It also promoted the development of non-technical skills such as teamwork, communication, leadership, and time management. Conclusion: SBT is an effective pedagogical tool that bridges the gap between theoretical learning and clinical practice. It positively influences nursing students’ academic and practical performance, emotional preparedness, and professional development. Further integration of structured, high-quality simulation into nursing curricula is recommended to optimize learning outcomes.",
    "keywords": [],
    "generated_keywords": [
      "Colaizzi",
      "Conclusion",
      "SBT",
      "University of Debrecen"
    ]
  },
  {
    "major": "Egészségtudomány",
    "year": 2025,
    "title": "A globális betegségteher alakulása emlő- és petefészek-daganatok táplálkozási",
    "students": [
      {
        "name": "Nagy Lilla Zsófia",
        "major": "Debreceni Egyetem Egészségtudományi Kar, dietetikus szakirány, III."
      }
    ],
    "teachers": [
      {
        "name": "Ghanem Amr Sayed",
        "university": "Debreceni Egyetem Egészségtudományi Kar Egészségügyi Informatikai Tanszék"
      }
    ],
    "content": "Bevezetés és célkitűzés: A nőket leggyakrabban érintő daganat az emlődaganat, mely évente az új daganatos megbetegedések ~24%-a, szemben a petefészekrákkal (3,4%), ami túlélési esélyeket rontva sokszor későn kerül felismerésre, bizonyítja ezt egy 2018-as adat. Ebben az évben 290 000 nőt diagnosztizáltak, és ebből 184 000 fő halt meg petefészek-daganatban. Az elhízás e két daganat kockázatát emelheti. A kutatás célja magas testtömegindexhez (BMI) köthető emlő- és petefészek-daganatok vizsgálata, az SDI (országok fejlettségi mutatója), a DALY és a halálozás globális trendjei közötti kapcsolatra koncentrálva 1990 és 2019 között. Anyag és módszer: Az emlő- és petefészek-daganatok életkorra standardizált DALY- és halálozási rátáit a GBD 2019 adatbázisból nyertük, és az SDI-értékeket fuzzy matching eljárással kapcsoltuk össze. A statisztikai elemzéseket Stata 17 és Joinpoint Regression Program 5.3.0 verziójában végeztük. Kruskal-Wallis- és Dunn-féle tesztekkel vizsgáltuk az SDI-kategóriák közötti eltéréseket, a lineáris regresszióval értékeltük az SDI és a kimenetelek közötti összefüggést (illeszkedés: R²). A jointpoint regresszióval, legfeljebb három csatlakozási ponttal, az időbeli trendeket és azok szignifikanciáját permutációs tesztekkel, Monte Carlo-módszerrel becsült p-értékekkel vizsgáltuk. Eredmények: A magasabb SDI-kategóriák alacsonyabb DALY- és halálozási rátákkal társultak mindkét ráktípus esetében. A Kruskal-Wallis-tesztek szignifikánsan tértek el az SDI-kategóriák között (DALY: emlő χ²= 1625,606, petefészek χ²= 3506,615; halálozás: emlő χ²= 2200,485, petefészek χ²= 3657,454; mind p <0,0001). Dunn-féle tesztek az SDI növekedésével csökkenő trendeket igazoltak. A joinpoint regresszió alacsony SDI-régiókban növekvő DALY- (petefészek: AAPC: 3,62%; emlő: AAPC: 2,28%) és halálozási trendeket (petefészek: AAPC: 3,69%) tárt fel, míg magas SDI-régiókban csökkent (DALY: emlő: AAPC: -0,75%; halálozás: emlő: AAPC: - 0,82%, petefészek: AAPC: -0,47%). A lineáris regresszió szignifikáns pozitív összefüggéseket mutatott az SDI és a DALY (emlő: β = 35,013, R² = 2,08%; petefészek: β = 10,931, R² = 46,8%), valamint a halálozás (emlő: β = 2,009, R² = 5,07%; petefészek: β = 0,418, R² = 50,1%) között. Diszkusszió: A magas testtömegindex csökkentése és az alacsony SDI-régiók egészségügyi hozzáférésnek javítása közegészségügyi prioritás az emlő- és petefészek-daganatokhoz köthető aránytalan DALY- és halálozási teher globális mérsékléséhez.",
    "keywords": [],
    "generated_keywords": [
      "AAPC",
      "BMI",
      "DALY",
      "GBD"
    ]
  },
  {
    "major": "Egészségtudomány",
    "year": 2025,
    "title": "Anorexiában érintettek gyógyulásának dinamikája",
    "students": [
      {
        "name": "Fagyas Natália",
        "major": "Debreceni Egyetem, Egészségtudományi Kar, Védőnő szakirány, III. évfolyam"
      }
    ],
    "teachers": [
      {
        "name": "Barabás Ágota",
        "university": "Debreceni Egyetem, Egészségtudományi Kar, Védőnői Módszertani és Prevenciós Tanszék"
      }
    ],
    "content": "Az anorexia nervosa egy olyan multifaktoriális eredetű evészavar, amely globális szinten napjaink legmagasabb mortalitási arányú pszichiátriai kórképének tekinthető. Patológiai tünetei közé tartozik a testészlelés kognitív torzulása, az elhízástól való intenzív félelem, az energiabevitel jelentős restrikciója, illetve ezek következményeként a kórosan alacsony testsúly kialakulása. Az utóbbi évek kutatásai rámutattak, hogy a diszfunkcionális lelki működéseknek kulcsszerep jut a betegség krónikussá válásában, ugyanakkor a reziliencia mint pszichológiai védőfaktor potenciális szerepet tölthet be a felépülési folyamat facilitálásában. A tervezett kutatás célja az anorexiából való gyógyulás dinamikájának pontosabb operacionalizálása, figyelembe véve a tárgyiasított testtudat, a maladaptív attitűdök, illetve a reziliencia aspektusait. A kvantitatív, keresztmetszeti vizsgálat a Helsinki Nyilatkozat etikai alapelveinek megfelelően fog megvalósulni, kizárólag önkéntes, írásos beleegyezést követően. Az adatfelvétel anonim, tervezetten önkitöltős online kérdőív formájában zajlik majd a Qualtrics platformon, és a forráspopulációt megközelítőleg 150 fő 18–40 év közötti, önbevallás alapján jelenleg anorexiával küzdő vagy korábban a betegségben érintett női résztvevő fogja alkotni. A felmérés során három standardizált, validált magyar nyelvű mérőeszközt (Objectified Body Consciousness Scale, Dysfunctional Attitude Scale, Connor-Davidson Resilience Scale) kívánunk alkalmazni. Az adatfeldolgozás az SPSS szoftverrel fog történni, a leíró statisztikákon túl Pearson-féle korreláció, független mintás t-próba és egyfaktoros varianciaanalízis (ANOVA) segítségével. A vizsgálati eredmények várhatóan hozzájárulhatnak a kognitív-affektív tényezők hatásának újraértelmezéséhez az anorexia nervosa terápiájában, valamint alapot teremthetnek a személyre szabott, reziliencianövelő intervenciós protokollok kidolgozásához is. A klinikai szakemberek munkáját abban támogathatja, hogy differenciáltabban ítéljék meg a gyógyulási potenciált és annak pszichológiai feltételeit. A preventív célú pszichoedukációs programok fejlesztésének tekintetében szintén támpontot jelenthet, és gazdagíthatja a mentális egészség helyreállításával kapcsolatos interdiszciplináris tudásbázist az evészavarok területén.",
    "keywords": [],
    "generated_keywords": [
      "ANOVA",
      "Connor-Davidson Resilience Scale",
      "Dysfunctional Attitude Scale",
      "Helsinki",
      "Patológiai"
    ]
  },
  {
    "major": "Egészségtudomány",
    "year": 2025,
    "title": "Egészségműveltség vizsgálata Nyíregyházán",
    "students": [
      {
        "name": "Madarász Boglárka",
        "major": "Debreceni Egyetem, Egészségtudományi Kar, Védőnő szakirány, II."
      }
    ],
    "teachers": [
      {
        "name": "Barabás Ágota",
        "university": "Debreceni Egyetem, Egészségtudományi Kar, Védőnői Módszertani és Prevenciós Tanszék"
      }
    ],
    "content": "Bevezetés: Az egészségtudatosság az egészségmagatartás jelentős meghatározó tényezője. Az egészségtudatosság fejleszthető magasabb kockázatú csoportokban történő javítása az egészségegyenlőtlenségek csökkentésének lehetséges módszere. Az egészségműveltség az egyénnek azon kognitív és szociális készségeit foglalja magában, hogy az egészséggel, betegséggel kapcsolatos információkat képes legyen felkutatni, megérteni, értékelni és alkalmazni. A megfelelő egészségtudatosság az egészséges viselkedés előfeltételének tekinthető. Az alacsony szintű egészségműveltség rosszabb egészségmutatókkal jár együtt, mint pl. magas kórházi felvételi arány, a megelőző tevékenységekben való alacsony részvétel, krónikus betegségek rosszabb prognózisa, magasabb halálozási aránya. Anyag és módszer: A kutatás célja a Nyíregyházán élő, felnőtt korú személyek egészségműveltségének felmérése, alap- és szakellátással kapcsolatos vélekedésük, önértékelt egészségi állapotuk megismerése. A kutatás forráspopulációját a Nyíregyházán élő, 18. életévüket betöltött lakosok adták. A vizsgálat az online kérdőíves adatfelmérés módszerén alapult, melyet internetes közösségi oldal zárt csoportjában tettünk közzé előzetes adminisztrátori engedély birtokában. Az adatfelvétel 2024. 12. 11. és 2025. 04. 20. között zajlott. A kutatásba 140 főt sikerült bevonni, melyből az adattisztítás során szükséges volt 21 db kérdőívet törölni. Statisztikai adatelemzés: az adatok elemzése az SPSS 24.0 statisztikai program segítségével történt. Az adatelemzés során az általunk relevánsnak tartott egyszerű gyakoriságok vizsgálatára került sor. Eredmények: A mintában a nők felülreprezentáltak voltak (89,0%) a férfiakhoz képest (21,0%). Úgy véli a megkérdezettek 52,1%-a, hogy sokat tehet, 44,5%-a nagyon sokat tehet egészségéért, míg 3,4%-a szerint csak keveset tehet saját egészségéért. Az egészségműveltség szintjét tekintve megállapítható, hogy a válaszadók 46,2%-a kiváló egészségműveltséggel rendelkezik, 35,2%-a egészségműveltsége marginális, míg 18,5%-uk nem megfelelő egészségműveltséggel rendelkezik. Egészségi állapotát nagyon jónak 12,6% ítéli, rossznak 8,4%. A megkérdezettek 58,0%-a részt venne ingyenes elérhető egészségfejlesztő foglalkozásokon, és legtöbben (33,3%) a mentális egészégi állapotának fejlesztésében igényelne támogatást. Következtetések: A megkérdezettek kevesebb, mint fele rendelkezik kiváló egészségműveltséggel, és többségük igényelne egészségfejlesztésben támogatást. Az egészség fejlesztésének, támogatásának egyik kulcsfontosságú tényezője az egészségműveltség javítása. Az eredmények alapján javasolt a lakosság edukálása, egészségértésének, egészségfejlesztésének támogatására intervenciók kidolgozása.",
    "keywords": [],
    "generated_keywords": [
      "SPSS"
    ]
  },
  {
    "major": "Egészségtudomány",
    "year": 2025,
    "title": "Egészséghírnökök a pályán. Adaptált egészségfejlesztés speciális olimpikonoktól",
    "students": [
      {
        "name": "Horváth Réka",
        "major": "Debreceni Egyetem Egészségtudományi Kar, Védőnő szakirány"
      }
    ],
    "teachers": [
      {
        "name": "Pázmány Viktória",
        "university": "Debreceni Egyetem Egészségtudományi Kar Védőnői Módszertani és Prevenciós Tanszék"
      }
    ],
    "content": "A Speciális Olimpia mozgalom fő célja az értelmi fogyatékossággal élő személyek inklúziója, amihez a sportot használja eszközként. Ugyanakkor fontosnak találja az élet minden területén biztosítani számukra a javakhoz való egyenjogú bevonódást, hozzáférést. A fentiek értelmében különösen elkötelezett a spotrolók egészségfejlesztése iránt. Ehhez a misszióhoz kapcsolódott a DE-ETK Védőnői Módszertani és Prevenciós Tanszékének hallgatói és oktatói csapata. Az értelmi fogyatékosságban érintett személyek számára az egészség, a jóllét egy nehezebben értelmezhető és elérhető állapot. A szakmai team értelmi fogyatékos tapasztalati szakértő bevonásával azt a célt tűzte ki maga elé, hogy egy speciális sportolók számára értelmezhető és alkalmazható egészségfejlesztő képzést dolgoz ki. Az egészséghírnök képzés célja az érintett speciális sportolók felkészítése egészségfejlesztő foglalkozások tartására. A képzés tananyaga három modult dolgoz fel, melyek fókuszában a táplálkozás és higiéné, a fizikális egészség és a mentális egészség áll. A modulok tematikájának kiválasztását előzetes fókuszcsoportos interjúk alapozták meg. Jelen előadás azt a tréninganyagot és kézikönyvet kívánja bemutatni, melynek célja nem pusztán az értelmi fogyatékossággal élő sportolók egészségfejlesztése volt, hanem maguknak az érintetteknek mint tapasztalati szakértőknek a bevonása a teljes képzési folyamatba. A képzés célja az volt, hogy a fogyatékossággal élő sportolók és partnereik az elsajátított ismereteket képesek legyenek sporttársaik számára átadni, egészségmagatartásukat hatékonyan formálni.",
    "keywords": [],
    "generated_keywords": [
      "DE-ETK",
      "Speciális Olimpia",
      "fizikális egészség"
    ]
  },
    {
    "major": "Gépészmérnöki és mechatronika",
    "year": 2025,
    "title": "Mézpergető berendezés tervezése és kivitelezése",
    "students": [
      {
        "name": "Márton Botond",
        "major": "Sapientia EMTE, Gépészmérnöki szak, IV."
      }
    ],
    "teachers": [
      {
        "name": "dr. Gergely Attila Levente",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki Tanszék"
      }
    ],
    "content": "A méhészeti ágazat fontos részét képezi a méz hatékony és kíméletes kinyerése a lépből. E célból több mint másfél évszázada a mézet mézpergető segítségével nyerik ki a lépből. Dolgozatom célja egy kézi meghajtású mézpergető berendezés tervezése és kivitelezése. A berendezés tervezésekor figyelembe vettem a már létező kialakításokat, viszont a tervezés egyedi. A berendezéssel szemben támasztott kritériumok között fontos szempont a környezettudatos kivitelezés és a költséghatékonyság. A berendezés kivitelezéskor több tervezési nehézségbe ütköztem, amiknek kiküszöbölése közben jelentős műszaki tapasztalatra tettem szert.",
    "keywords": [],
    "generated_keywords": []
  },
  {
    "major": "Gépészmérnöki és mechatronika",
    "year": 2025,
    "title": "Lengéscsillapító mérőpad",
    "students": [
      {
        "name": "Nagy Jenő",
        "major": "Sapientia EMTE, Mechatronika szak, IV."
      }
    ],
    "teachers": [
      {
        "name": "dr. Egyed-Faluvégi Erzsébet",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki Tanszék"
      },
      {
        "name": "dr. Jakab-Farkas László",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki Tanszék"
      }
    ],
    "content": "A lengéscsillapítók világa évről évre fejlődik, a kezdetleges rugós lengéscsillapítóktól egészen a mágneses lengéscsillapítókig széles skálán mozognak. E sokszínűség oka az lehet, hogy a gépjárművek felhasználása egyre változatosabb, van, aki csak az országúton használja az autóját, és mások terepen vagy versenypályán is. Az autógyártóknak fontos, hogy minden felhasználási területre tudják behangolni a gépjárművek lengéscsillapítóit. A dolgozatom célja egy lengéscsillapító mérőpad tervezése, valamint létező lengéscsillapítók tesztelése. A berendezés tervezése a létező lengéscsillapítási módszerek figyelembevételével történt. Tesztelés során a vizsgált lengéscsillapítók azon paraméterei vannak vizsgálva, amelyek a leginkább befolyásolják a viselkedését: csillapítási tényező, lecsengési idő. A vezérlés és adatgyűjtés ESP VROOM 32 mikrovezérlővel történik.",
    "keywords": [],
    "generated_keywords": [
      "ESP VROOM"
    ]
  },
  {
    "major": "Gépészmérnöki és mechatronika",
    "year": 2025,
    "title": "Gyűjtögető mobilis robot",
    "students": [
      {
        "name": "Andras Ákos",
        "major": "Sapientia EMTE, Mechatronika szak, IV."
      }
    ],
    "teachers": [
      {
        "name": "dr. Egyed-Faluvégi Erzsébet",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki"
      },
      {
        "name": "dr. Jakab-Farkas László",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki"
      }
    ],
    "content": "Az autonóm rendszerek fejlesztése egyre nagyobb szerepet kap mind az ipari, mind a kutatási területeken. Az önvezető járművek és robotikai rendszerek összecsatolása lehetőséget teremt olyan intelligens eszközök létrehozására, amelyek képesek összetett feladatok önálló végrehajtására. Dolgozatom célja egy már létező mobilis platform kiegészítése, oly módon, hogy az képes legyen kis méretű tárgyak (labdák) lokalizálására, megközelítésére és összegyűjtésére. Felszerelésre került egy új vezérlési rendszerrel, saját tervezésű robotkarral, egy Serioux kamerával, valamint más kisebb feladatokat ellátó modulokkal. A rendszer egy kamerán alapuló algoritmust használ a labdák felismerésére és azok pontos koordinátáinak meghatározására. A navigációt a Reeds-Shepp útvonaltervező algoritmus segíti, biztosítva az optimális mozgást a térben. A robotkar vezérlése szorosan integrált a képfeldolgozó rendszerrel, lehetővé téve a precíz és dinamikus gyűjtögetést. Egy másik fejlesztés a webes kezelőfelület, amely interaktív vezérlő platformként működik, amelyen keresztül a felhasználók valós időben követhetik a jármű mozgását, a detektált objektumokat és a robot működését. Emellett lehetőség nyílik manuális vezérlésre is, ha a rendszer külső beavatkozást igényelne.",
    "keywords": [],
    "generated_keywords": [
      "Reeds-Shepp",
      "Serioux"
    ]
  },
  {
    "major": "Gépészmérnöki és mechatronika",
    "year": 2025,
    "title": "Olvadékos centrifugális szálképzés tanulmányozása",
    "students": [
      {
        "name": "Nagy Dániel",
        "major": "Sapientia EMTE, Gépészmérnöki szak, IV."
      }
    ],
    "teachers": [
      {
        "name": "dr. Gergely Attila Levente",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki Tanszék"
      }
    ],
    "content": "Polimer szálakat számos alkalmazásban használnak, az orvostudománytól a szűréstechnikáig. A polimer szálas szövedékek legelterjedtebb előállítási módja az oldószeres eljárások, mely keretében a polimer anyagot egy megfelelő oldószerben feloldják. Az oldatot felhasználva szálas szerkezetet hozhatunk létre többféle szálképzési eljárást alkalmazva. Viszont az oldatos szálképzés hátránya, hogy általában mérgező oldószereket kell alkalmazni. Az olvadékos szálképzés nem használ oldószert, így kiküszöbölve a káros szerek használatát, hiszen a polimer alapanyagot megömleszti, és így érhető el a megfelelő viszkozitás létrehozása. A dolgozat célja egy centrifugális szálképző berendezés tervezése és kivitelezése. A berendezés lehetővé teszi a fordulatszám, a hőmérséklet, valamint a tányér és kollektor közti távolság változtatását. A berendezés segítségével tanulmányozzuk az olvadékos centrifugális eljárást újrahasznosított műanyagok esetén.",
    "keywords": [],
    "generated_keywords": [
      "Polimer",
      "hőmérséklet"
    ]
  },
  {
    "major": "Gépészmérnöki és mechatronika",
    "year": 2025,
    "title": "Lineáris dörzshegesztés tanulmányozása",
    "students": [
      {
        "name": "Kantor Miklos-Ferencz",
        "major": "Sapientia EMTE, Gépészmérnöki szak, IV."
      }
    ],
    "teachers": [
      {
        "name": "dr. Gergely Attila Levente",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki"
      }
    ],
    "content": "A műanyagok hegesztése számos ipari alkalmazásban elengedhetetlen gyártástechnológiai eljárás. Kutatásunk célja a lineáris dörzshegesztés elvének vizsgálata, különös tekintettel annak hatékonyságára és a hegesztett kötések mechanikai tulajdonságaira. Ennek érdekében egy kísérleti berendezést terveztünk meg, melyet kiviteleztünk. A berendezés lehetővé teszi műanyag, termoplaszt lemezek különböző szerszámokkal és eltérő fordulatszámon történő hegesztését. Az így létrejött kötések szakítószilárdságát laboratóriumi vizsgálatokkal elemezzük. Az eredmények alapján következtetéseket vonunk le a technológia optimalizálására és ipari alkalmazhatóságára vonatkozóan.",
    "keywords": [],
    "generated_keywords": []
  },
   {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2025,
    "title": "Energiamenedzsment-rendszer fejlesztése intelligens otthonokhoz",
    "students": [
      {
        "name": "Szeibert Xavér",
        "major": "Sapientia EMTE, Számítógépes irányítási rendszerek szak, II."
      }
    ],
    "teachers": [
      {
        "name": "dr. Kutasi Dénes Nimród",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      }
    ],
    "content": "A modern és gyorsan fejlődő világban már minden szükségletünk, hobby és munka mögött egy elektromos technológia áll, amit kényelmesen, gondok nélkül használunk. A mostani időkben az infláció emelkedésével minden szükségletnek az ára megemelkedett, legfőképpen az elektromos áramé, ezáltal, hogy ha nem figyelünk oda a mindennapi energiafogyasztásunkra, és nem változtatunk az energiafelhasználási szokásainkon, akkor könnyen anyagi gondokba ütközhetünk. A dolgozatom célja egy olyan IoT (Internet of Things) rendszer kialakítása, amely lehetővé teszi a háztartáson belüli elektronikai berendezések fogyasztásának könnyű mérését és nyomon követését. Emellett a rendszer képes monitorozni a háztartásban telepített napelemek termelését is. Az adatokat egy adatbázisban tárolom, ami lehetővé teszi a későbbi statisztikák és elemzések készítését. Ezáltal pontosabb betekintést lehet nyerni az energiaköltségekbe, valamint segít optimalizálni a fogyasztást és kihasználni a megújuló energiaforrásokat. A mért adatok és egy betanított mesterséges intelligencia felhasználásával, az aktuális meteorológiai előrejelzések alapján lehetőség nyílik az adott napi átlag energiafogyasztás becslése. Ezáltal meghatározható, hogy mennyire tudunk profitálni a napenergia hasznosításából, valamint előre megtervezhető a legoptimálisabb energiafelhasználás. A különböző egységek MQTT protokollon keresztül kommunikálnak egymásközt, a publisherek (háztartási berendezés, napelemek) küldenek mintavételezett adatokat a brokernek (Raspberry pi), ahol az adatok fel vannak dolgozva, el lesznek tárolva egy MongoDB adatbázisban, és a kész adatok egy lokálisan futó Node-Red alkalmazáson lesznek megjelenítve.",
    "keywords": [],
    "generated_keywords": [
      "Internet of Things",
      "IoT",
      "MQTT",
      "MongoDB"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2025,
    "title": "Kameraalapú spektrométer",
    "students": [
      {
        "name": "Nagy Péter-Ferencz",
        "major": "Sapientia EMTE, Mechatronika szak, IV."
      }
    ],
    "teachers": [
      {
        "name": "dr. Papp Sándor",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      }
    ],
    "content": "A spektrométerek hasznos eszközök az elektromágneses spektrum különböző tartományainak, leggyakrabban a látható, közeli ultraibolya és közeli infravörös sugárzás elemzésére, segítségével különböző fényforrások színképe tanulmányozható. Fő alkotóeleme egy prizma vagy optikai rács, amely a fényt hullámhossz függvényében eltéríti, és egy érzékelőre vetíti. Dolgozatomban egy könnyen beszerezhető eszközökből elkészíthető spektrométer paramétereit tanulmányozom.",
    "keywords": [],
    "generated_keywords": []
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2025,
    "title": "Felderítő drón tervezése és megvalósítása katonai, kutatási és ipari alkalmazásokhoz",
    "students": [
      {
        "name": "Salat Tamás",
        "major": "Sapientia EMTE, Számítástechnika szak, II."
      }
    ],
    "teachers": [
      {
        "name": "dr. Bakó László",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      }
    ],
    "content": "A modern technológiai fejlődésben a robotika és automatizálás kulcsszerepet játszik, különösen a veszélyes vagy nehezen hozzáférhető területek felderítésében. Jelen kutatás célja egy olyan kompakt, távirányítással működő felderítő robot tervezése és prototípusának megvalósítása, amely hatékonyan alkalmazható katonai, ipari és kutatási célokra, csökkentve az emberi kockázatokat és a költségeket. A projekt egy olyan robot létrehozására összpontosít, amely képes a környezet gyors és pontos felmérésére. A rendszer központi elemei egy ESP32 mikrovezérlő a mozgás irányítására és szenzoradatok feldolgozására, valamint egy Raspberry Pi Zero 2 W a valós idejű videófeldolgozáshoz és -közvetítéshez. A robot stabilitását IMU modul (gyorsulásmérő és giroszkóp) segíti. A rendszer további szenzorokkal, például távolságérzékelőkkel bővíthető, amelyek hozzájárulhatnak a biztonságosabb navigációhoz és az akadályok észleléséhez, így támogatva a felhasználót komplex, akadályokkal teli környezetekben. A robot mechanikai felépítése könnyű és tartós, 3D-nyomtatási technológiával készül, lehetővé téve a moduláris kialakítást és a könnyű adaptációt különböző feladatokhoz. A fejlesztés során opcionális lehetőségként vizsgáljuk a fejlettebb mozgásrendszerek, például az omnidirekcionális meghajtás integrálását, amely tovább növelheti a robot manőverezési képességeit szűk terekben és bonyolult terepviszonyok között. A kutatás várható fő eredménye egy költséghatékony, könnyen használható felderítő robot prototípusa, amely valós idejű vizuális visszajelzést és alapvető navigációs támogatást nyújt a felhasználónak. Ezáltal hozzájárulhat a távirányítású rendszerek biztonságosabb és hatékonyabb alkalmazásához különböző veszélyes vagy speciális környezetekben.",
    "keywords": [],
    "generated_keywords": [
      "3D-nyomtatási technológia",
      "ESP32",
      "IMU",
      "Raspberry Pi"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2025,
    "title": "Biciklifelügyelő rendszer önvezetőjármű-technológiákhoz",
    "students": [
      {
        "name": "Balázs Bence-Adorján",
        "major": "Sapientia EMTE, Automatizálás és alkalmazott informatika szak, IV"
      }
    ],
    "teachers": [
      {
        "name": "dr. Márton Lőrinc",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      },
      {
        "name": "dr. Fehér Áron",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      }
    ],
    "content": "A biciklifelügyelő rendszer fejlesztése során a kerékpár térbeli pozíciójának és mozgásának pontos meghatározása érdekében szenzorfúziót alkalmazunk. A rendszer GPS-modult használ a helymeghatározáshoz, valamint IMU- szenzorokat a gyorsulás és elfordulás méréséhez. Az adatok fúziójával pontosabb és megbízhatóbb információt szolgáltatunk a felhasználó számára a kerékpár helyzetéről és dinamikájáról. A projekt célja egy olyan intelligens rendszer létrehozása, amely valós időben követi a kerékpár mozgását, figyelmeztetést ad a felhasználónak, ha a kerékpár nagyon megközelíti a járművet, és lehetővé teszi az adatok vizualizációját egy webes alkalmazáson keresztül. A rendszer az ESP32 mikrokontrollerre épül, amely a beérkező szenzoradatokat feldolgozza, és a releváns információkat továbbítja a felhasználó felé. A GPS-modul segítségével pontosan meghatározzuk a kerékpár földrajzi helyzetét és mozgási pályáját, míg az IMU- szenzorokkal mérjük a gyorsulást és az elfordulást, lehetővé téve a precíz mozgáskövetést és dőlésszögelemzést. A rendszer valós idejű figyelmeztetéseket biztosít hangjelzéssel és a webes felületen keresztül, így a felhasználó azonnal értesülhet a potenciális veszélyekről vagy a kerékpár mozgási rendellenességeiről. A projekt eredményeként egy olyan innovatív megoldás jön létre, amely nemcsak a kerékpározás biztonságát és kényelmét növeli, hanem új lehetőségeket teremt az önvezetőjármű-technológia alkalmazására a kerékpáros közlekedésben.",
    "keywords": [],
    "generated_keywords": [
      "ESP32",
      "IMU"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2025,
    "title": "Kódtól a vászonig",
    "students": [
      {
        "name": "Babos Dávid",
        "major": "Sapientia EMTE, Számítástechnika szak, IV."
      }
    ],
    "teachers": [
      {
        "name": "dr. Márton Lőrinc",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      },
      {
        "name": "dr. Fehér Áron",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      }
    ],
    "content": "Hogyan születik műalkotás kódsorokból? A dolgozat egy olyan interdiszciplináris rendszert mutat be, amely a mesterséges intelligencia által generált vagy szerkesztett képekből képes fizikai rajzokat létrehozni egy robotkar segítségével. A projekt célja a digitális kreativitás és az analóg művészi kifejezés közötti átjárhatóság megteremtése, algoritmikus és mérnöki eszközökkel. A rendszer működése során a bemeneti képeket először különböző képfeldolgozási lépéseken vezeti végig: hatch-elési algoritmusokkal árnyékolási textúrákat hoz létre, míg kontúrdetektálással meghatározza a lényegi formai elemeket. Az így nyert információkat egyenes vonalszakaszokká alakítja, melyeket a robotkar CMY és fekete színű markerekkel rajzol le egy vászonra. A hangsúly a vizuálisan esztétikus, de technikailag egyszerűsített vektoralapú megjelenítésen van, amely lehetővé teszi a gépi kivitelezést. A dolgozat a gépi kreativitás, a mesterséges látás és a robotika együttes alkalmazását vizsgálja a művészet szolgálatában. A kutatásom látványos eredményekkel rendelkezik, így megerősíti a továbbfejlesztési lehetőségeket.",
    "keywords": [],
    "generated_keywords": [
      "CMY"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2025,
    "title": "Virtuális mérések megvalósítása és megfigyelése LabView környezetben Raspberry Pi-n keresztül",
    "students": [
      {
        "name": "Balazs Tamás-Béla",
        "major": "Sapientia EMTE, Számítógépes irányítási rendszerek szak, II."
      }
    ],
    "teachers": [
      {
        "name": "dr. Papp Sándor",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      }
    ],
    "content": "A TDK dolgozat témája egy virtuális mérésekre alkalmas rendszer kialakítása, amely az iparban elterjedt NI adatbegyűjtő kártyák helyet például hobby szintű projektek alkalmazására, illetve didaktikai rendszerek könnyű kialakítására használható. A dolgozat a LabVIEW-nak a Raspberry Pi-n való működését mutatja be, amely helyettesíteni tudja a NI hardvereszközét adatbegyűjtés szempontjából. A Raspberryn egy erre a célra kifejlesztett LabVIEW verzió fut, amely, csak a kód futtatására alkalmas, nem pedig annak a fejlesztésére. Az adatok monitorizálását a Raspberry egy külső rendszerre továbbítja, ahol úgymond felhős megoldással azt könnyedén tudjuk megtekinteni. Ezt a rendszert egyszerűen lehet különböző alkalmazási területeken implementálni, mint például okosotthon-vezérlés, áramkörök tesztelése stb. Ez a megoldás egy más szemszögből veszi a szokványos alkalmazását a Labview-nak, illetve az alkalmazási területeknek is, mivel a nem megszokott módszerek alapján vannak azok megvalósítva.",
    "keywords": [],
    "generated_keywords": [
      "LabVIEW",
      "NI",
      "Raspberry"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2025,
    "title": "Állapotbecslő tervezése Allen–Cahn reakció-diffúziós rendszerekhez",
    "students": [
      {
        "name": "Csillag Alex",
        "major": "Sapientia EMTE, Számítógépes irányítási rendszerek szak, I."
      }
    ],
    "teachers": [
      {
        "name": "dr. Márton Lőrinc",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      }
    ],
    "content": "A dolgozat az Allen–Cahn parciális differenciálegyenleten alapuló reakció-diffúziós modellek közelítő megoldásának tanulmányozására összpontosít, amely kulcsfontosságú a dinamikus fázisátmenetek, például az ötvözetek mikroszerkezetének vagy a biológiai membránok változásainak modellezésében. Az Allen–Cahn-egyenlet matematikai keretet nyújt a határfelületek dinamikájának vizsgálatához, és széles körben alkalmazzák az anyagtudományban és a matematikai biológiában, valamint a plazmafizikában és a képfeldolgozás területén is. Az Allen–Cahn parciális differenciálegyenlet megoldásának közelítése egy állapotbecslő segítségével történik. Az állapotbecslő egy diszkrét idejű közelítő rendszeren alapul, amelynek feladata a teljes rendszer megoldásának becslése korlátozott, zajos mérési adatok alapján, figyelembe véve a szenzorok korlátait. A becslési hiba konvergenciáját is vizsgáljuk a Lyapunov stabilitási kritérium segítségével. A MATLAB, illetve Simulink környezetben megvalósított szimulációs mérések alapján alátámasztjuk azt a kijelentést, hogy a véges differenciák módszerével tervezett állapotbecslő kellő pontossággal megközelíti az Allen– Cahn parciális differenciálegyenlet megoldásait.",
    "keywords": [],
    "generated_keywords": [
      "Allen–Cahn",
      "Lyapunov",
      "MATLAB"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2025,
    "title": "Epilepsziás rohamok mesterségesintelligencia-alapú felismerése gyorsulásmérő mobileszköz segítségével",
    "students": [
      {
        "name": "Gombos Zsuzsa-Krisztina",
        "major": "Sapientia EMTE, Számítógépes irányítási rendszerek szak, II."
      }
    ],
    "teachers": [
      {
        "name": "dr. Dávid László",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      }
    ],
    "content": "Az epilepszia világszerte elterjedt neurológiai betegség, amely jelentős egészségügyi kockázatot hordoz a betegek számára, különösen a rohamok váratlan és kiszámíthatatlan jellege miatt. A rohamok előrejelzése és időben történő felismerése alapvető fontosságú a balesetek megelőzésében és az érintettek életminőségének javításában. A jelen kutatás célja egy hordozható, csuklóra szerelhető eszköz fejlesztése, amely egy háromtengelyes gyorsulásmérő segítségével folyamatosan figyeli a csukló mozgásait az X, Y és Z tengelyek mentén. Az így rögzített mozgási adatokból spektrogramképeket generál, amelyek lehetővé teszik a mozgásminták frekvenciatartomány szerinti elemzését. Ezeket a képi adatokat egy mélytanulási alapú modell elsősorban konvolúciós neurális hálózatok (CNN) segítségével dolgozza fel, és tanulja meg az epilepsziás rohamok alatt történő jellegzetes mintázatokat. A fejlesztett rendszer valós időben monitorozza a felhasználó mozgásait, és képes automatikusan felismerni ezen rendellenességeket. Ezzel lehetőséget biztosít a korai beavatkozásra, csökkentve a sérülések kockázatát, és javítva az érintettek életminőségét. A kutatás rávilágít arra, hogy az IoT-alapú viselhető eszközök és a mélytanulás kombinációja hatékony megoldást jelenthet az epilepsziás betegek állapotának nyomon követésére és a rohamok időbeni detektálására.",
    "keywords": [],
    "generated_keywords": [
      "CNN",
      "IoT-alapú",

      "neurológiai betegség"
    ]
  },
  {
    "major": "Hardverfejlesztések és beágyazott rendszerek",
    "year": 2025,
    "title": "Mobilis robotok UWB (Ultra Wideband) rádiójelalapú beltéri helyzetmeghatározása és irányítása",
    "students": [
      {
        "name": "Ilyés Levente Rajmund",
        "major": "Sapientia EMTE, Számítástechnika szak, IV."
      }
    ],
    "teachers": [
      {
        "name": "dr. Márton Lőrincz",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      },
      {
        "name": "dr. Szántó Zoltán",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      }
    ],
    "content": "A dolgozat célja egy omnidirekcionális robot elkészítése, helymeghatározása és szabályozása UWB (Ultra-wideband) technológiával működő beaconok segítségével. A szabályozás célja különböző referenciapályák minél pontosabb követése a robottal, kis pontosságú UWB helyzetmeghatározó technológiát használva. A dolgozat kulcsfontosságú része a helymeghatározás, mivel az ipari mobilis robotok feladataikat helyzetük ismeretében képesek pontosan elvégezni. Az Ultra-wideband alapú helymeghatározás előnye a kamerás és más helymeghatározó rendszerekhez képest az, hogy a szenzorok mérete kicsi, kötetlenül bárhova szerelhető, illetve sokkal költséghatékonyabb mind a szenzorok árát, mind az energiafelhasználást tekintve. Az általam készített UWB- alapú Estimote Beaconokat használó rendszer pontosságát egy Optitrack mozgásfigyelő rendszer segítségével tanulmányozom. Ezt a rendszert referenciaként használva összehasonlítom a nagy pontosságú optikai helyzetmeghatározáson és az UWB-alapú helyzetmeghatározáson alapuló szabályozást. A helyzetmeghatározást végző szoftver beágyazottan egy Raspberry Pi vezérlőn fut, amely a robot vezérlőegységeként is szolgál.",
    "keywords": [],
    "generated_keywords": [
      "Optitrack",
      "Raspberry Pi",
      "Ultra-wideband"
    ]
  },
    {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "BizChat",
    "students": [
      {
        "name": "Emilia Pethő",
        "major": "Sapientia EMTE, Informatika szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Márton Gyöngyvér",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      }
    ],
    "content": "A BizChat egy belső üzenetküldő rendszer, amelyet kifejezetten cégen belüli kommunikációra terveztem. Az alkalmazás Java alapú backenddel (STS4), Android frontenddel, valamint MySQL és RabbitMQ integrációval készült, amelyek Docker környezetben futnak. A rendszer lehetőséget biztosít egyéni és csoportos beszélgetések létrehozására, így a vállalat különböző részlegei könnyedén kommunikálhatnak. Az értesítési rendszer a RabbitMQ segítségével valósul meg, amely garantálja a valós idejű üzenetértesítéseket, így a felhasználók azonnal értesülnek az új üzenetekről és fontos közleményekről. A BizChat célja a gyors, megbízható és biztonságos vállalati kommunikáció.",
    "keywords": [],
    "generated_keywords": [
      "Android",
      "BizChat",
      "Docker",
      "Java",
      "MySQL"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "Drónraj modellezése és szabályozása virtuális környezetben",
    "students": [
      {
        "name": "Nüszl Richárd-István",
        "major": "Sapientia EMTE, Számítógépes irányítási rendszerek szak, II."
      }
    ],
    "teachers": [
      {
        "name": "dr. Márton Lőrinc",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      }
    ],
    "content": "A dróntechnológia rohamos fejlődésével egyre nagyobb figyelem övezi a drónrajok koordinált mozgását és vezérlési lehetőségeit. Kutatásom célja egy irányított drónraj vizsgálata vezérkövetés és előírt formációban történő haladás esetén. A vezető-követő megközelítésben a raj egyik drónjának (vezér) mozgását követik az autonóm egységek, biztosítva az előírt formáció fenntartását és az ütközések elkerülését. Előírt alakzatú formáció esetén a drónok előre meghatározott pozíciókat vesznek fel, miközben akadályokat is elkerülnek. A drónraj egyedeinek irányításához a drónokra szerelt pozíció- és elfordulásszenzorok méréseit használjuk fel. A formációban haladó drónok egymással rádión keresztül kommunikálnak. Az egyes drónok irányítási stratégiájának kidolgozásához a drónok matematikai modelljét alkalmazzuk. A kutatás során a Webots szimulációs tesztkörnyezetben elemzem a különböző szabályozó paraméterek hatását a formációkövetés minőségi jellemzőire. A kutatás várható eredményei hozzájárulhatnak a drónrajok hatékonyabb irányításához, amelyek nemcsak a katasztrófavédelemben, mezőgazdaságban és katonai területeken, hanem a szórakoztatóiparban is hasznosíthatók.",
    "keywords": [],
    "generated_keywords": [
      "Webots"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "SmartHome okosotthon és irodamenedzselő rendszer",
    "students": [
      {
        "name": "Gáll Benedek",
        "major": "Sapientia EMTE, Számítástechnika, IV."
      },
      {
        "name": "Gáspár Tamás",
        "major": "Sapientia EMTE, Számítástechnika, IV."
      }
    ],
    "teachers": [
      {
        "name": "dr. Domokos József",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      }
    ],
    "content": "A SmartHome egy olyan okosotthon és irodamenedzselő rendszer, ami az okoseszköz-hálózatok kezelését hivatott segíteni épületek szintjén, felhasználóbarát vizuális felületet nyújtva a felhasználóknak. A rendszer két felhasználói felületből áll: egyik része egy webes adminisztrátori felület, a másik egy mobilos felhasználóknak készült alkalmazás. A rendszer szükséges eleme egy helyileg Raspberry Pi-on futtatott Home Assistant alkalmazás, amelyen keresztül kommunikálunk az okoseszközökkel. Ahhoz, hogy az eszközeinket személyes preferenciák alapján tudjuk szabályozni, a rendszer magába foglal egy szabálytervező és -kiértékelő alegységet is, ami előre strukturált termosztát szabályozásra vagy szabad elképzelés alapján történő, Python alapú kódírásra alkalmas. A webes felületen több minden valósul meg: többek között a felhasználók megrajzolhatják a szobák vagy helyiségek tervrajzait, majd ezekből egész emeleteket lehet kialakítani. Továbbá itt található az alkalmazás szabálytervező része is. A mobilos applikáció többnyire a rendszermenedzselés részére fókuszál, mivel itt tekinthetőek meg az emeletek és szobák tervrajzai, az ezekhez tartozó okoseszközök, valamint a szabályok listája. A szabálykiértékelő rendszer alapját egy Pyodide nevezetű JavaScript csomag adja, amely képes a rendszeren belül a szabályok Python kódját futtatni (akár felhasználó által használt új csomagokkal bővíteni, micropipet használva), majd JavaScriptté alakítani azok kimenetét. Így a szabályok komplexitása szinte teljes mértékben csak a felhasználótól függ. Ezeket a szabályokat a rendszer épületenként összesíti, melyek alapján képes vezérelni az eszközöket. A Home Assistant program használata azért fontos, mivel rengeteg kommunikációs protokollt támogat, amelyekkel a különböző gyártók különféle eszközei kommunikálnak, ezáltal lehetővé téve számunkra a szabadságot az eszközhasználat terén. Jelenleg Sonoff termékekkel volt tesztelve a rendszer.",
    "keywords": [],
    "generated_keywords": [
      "Home Assistant",
      "JavaScript",
      "Python",
      "Raspberry Pi"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "Tömegmozgás szimulációja dinamikus 3D-környezetben vizuális zsúfoltság jelzéssel",
    "students": [
      {
        "name": "Pál Andor",
        "major": "Sapientia EMTE, Számítógépes irányítási rendszerek szak, II."
      }
    ],
    "teachers": [
      {
        "name": "dr. Novák Pálma-Rozália",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék, Villamosmérnöki Tanszék"
      },
      {
        "name": "dr. Márton Lőrinc",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék, Villamosmérnöki Tanszék"
      }
    ],
    "content": "A modern várostervezés, rendezvényszervezés és katasztrófavédelem egyik fontos kihívása a tömegek mozgásának előrejelzése és vizualizálása. Jelen dolgozat egy interaktív webalkalmazást mutat be, amely lehetővé teszi a tömeg dinamikájának szimulációját egy tetszőlegesen kialakított 3D-környezetben. A rendszer támogatja mind a manuálisan felépített terek, mind a beolvasott 3D-makettek használatát, biztosítva ezzel a sokoldalú alkalmazhatóságot különböző szakterületeken. Az alkalmazás egyik kiemelkedő tulajdonsága a vizuális zsúfoltságjelzés, amely a hőtérképek elvén alapul. A tömegben lévő egyének színe dinamikusan változik az adott területen tapasztalható zsúfoltság mértékének megfelelően: minél sűrűbb egy adott térben a tömeg, annál vörösebb árnyalatot kapnak az egyének, míg ritka eloszlás esetén színük zöld marad. Ez a vizuális megoldás segíti a felhasználókat a kritikus pontok gyors azonosításában és a mozgási mintázatok elemzésében. A fejlesztett szimulációs eszköz hasznos lehet a várostervezők, rendezvényszervezők és biztonsági szakemberek számára, akik tömegrendezvények, közlekedési csomópontok vagy menekülési útvonalak optimalizálásával foglalkoznak. Az alkalmazás nemcsak a tömeg viselkedésének elemzését teszi lehetővé, hanem segíthet a hatékonyabb térkihasználás tervezésében és a potenciális veszélyforrások előrejelzésében is.",
    "keywords": [],
    "generated_keywords": [
      "3D",
      "közlekedési csomópontok",
      "manuálisan felépített terek"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "Orvosi képek diagnosztikai célú osztályozása konvolúciós neurális hálózatokkal",
    "students": [
      {
        "name": "Kaffai Levente",
        "major": "Sapientia EMTE, Számítástechnika szak, IV."
      }
    ],
    "teachers": [
      {
        "name": "dr. Szilágyi László",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      }
    ],
    "content": "Napjainkban a tüdőgyulladás a leggyakoribb fertőző betegségek egyike, amely világszerte jelentős megbetegedést és halálozást okoz. A korai és pontos diagnózis kulcsfontosságú a hatékony kezelés megkezdéséhez, azonban a röntgenfelvételek értelmezése időigényes és szubjektív folyamat. Kutatásom célja olyan automatikus osztályozó algoritmus kidolgozása, amely képes a tüdőgyulladás különböző típusainak (vírusos tüdőgyulladás, COVID-19 eredetű tüdőgyulladás) felismerésére és elkülönítésére a normál esetektől és egyéb tüdőelváltozásoktól röntgenfelvételek alapján. Az algoritmus megvalósításához három különböző mély konvolúciós neurális hálózati architektúrát hasonlítottam össze, ezek a ResNet-50, GoogLeNet és Inception-ResNet-v2 modellek. A PyTorch keretrendszerben implementált modellek betanításához speciális adatelőkészítő modult (MaskedImageDataset) fejlesztettem, amely lehetővé tette a röntgenképek és a hozzájuk tartozó szegmentációs maszkok hatékony kezelését, annak érdekében, hogy valós és hasznos képi adatokon tudjanak tanulni az általam tanított modellek. A modellek kiértékelését ötszörös keresztvalidációs módszerrel végeztem. A modellek teljesítményének egységes és objektív értékelése érdekében a modellek teljesen összekapcsolt kimeneti rétege egységesítésre került. A legjobb eredményt az Inception-ResNet-v2 architektúra érte el, átlagosan 93,1%-os osztályozási pontossággal. A modell mind a négy vizsgált kategóriában (COVID, Normál, Vírusos tüdőgyulladás, Tüdőhomály) kimagasló eredményeket ért el, 0,9315-ös makró F1-értékkel. A kategóriánkénti teljesítményt tekintve a vírusos tüdőgyulladás esetében érte el a legmagasabb F1-értéket (0,9524), míg a COVID-19 esetében 0,9276, Normál esetekben 0,9465, Tüdőhomály esetén pedig 0,8996 volt az F1-érték. A tanítási folyamat elvégézéséhez és az objektív elemzéshez COVID-19 Radiography Database publikus adathalmazt használtam, amely több mint 21000 annotált röntgenfelvételt tartalmaz. Következtetésként a kifejlesztett rendszer jelentősen felgyorsíthatja és objektívebbé teheti a tüdőgyulladás diagnosztikáját, csökkentve az orvosok terhelését és a diagnosztikai hibák előfordulását. A módszer könnyen integrálható meglévő klinikai munkafolyamatokba, valós idejű döntéstámogatást nyújtva a radiológusok számára. A modell további fejlesztése és validálása klinikai környezetben fontos következő lépés a gyakorlati alkalmazhatóság igazolására.",
    "keywords": [],
    "generated_keywords": [
      "COVID",
      "COVID-19",
      "F1-érték"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "Sorbanállási hálózatok modellezése és szimulációja",
    "students": [
      {
        "name": "Olosz Izabella-Noémi",
        "major": "Sapientia EMTE, Számítógépes irányítási rendszerek szak, II."
      }
    ],
    "teachers": [
      {
        "name": "dr. Márton Lőrinc",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      }
    ],
    "content": "A sorbanállási hálózatok fontos szerepet töltenek be különböző rendszerek vizsgálatában és optimalizálásában, mint például a számítógépes adatforgalom irányítása vagy a közúti közlekedés. Kutatásom célja egy webalkalmazás létrehozása, amely interaktív felhasználói felületen keresztül lehetőséget biztosít a szabályozott és nem szabályozott sorbanállási hálózatokban zajló jelenségek szimulációjára, vizualizálására és elemzésére. A gráfalapú modellben a csomópontok különböző szerepköröket tölthetnek be, például forrásként, köztes feldolgozó egységként (sorként) vagy elnyelő pontként működhetnek. A csomagok mozgását és feldolgozását az adott csomópont adatátviteli sebessége határozza meg. A fejlesztett interaktív felhasználói felület lehetővé teszi a rendszer paramétereinek (átviteli ráta, kezdeti sorhossz, csatolások) dinamikus módosítását, így különböző működési esetek és terhelési helyzetek vizsgálhatók. A szimulációs eredmények alapján optimális stratégiák dolgozhatók ki, amelyek hozzájárulhatnak a hálózati forgalom hatékonyabb szabályozásához és a hálózat teljesítményének javításához.",
    "keywords": [],
    "generated_keywords": [
      "csomópontok"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "Feather - MI-alapú álomelemzés a személyre szabott önismeretért",
    "students": [
      {
        "name": "Madaras Lidia",
        "major": "Sapientia EMTE, Informatika szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Iclănzan David Andrei",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      }
    ],
    "content": "Az álmok értelmezése ősidők óta felkelti az emberek kíváncsiságát és figyelmét. A modern technológia új lehetőségeket teremt az álomelemzés támogatására. Kutatásomban egy Android-platformra fejlesztett alkalmazást mutatok be, amely nagy nyelvi modellek (LLM) segítségével elemzi a felhasználók által rögzített álmokat. Az alkalmazás fő célja az álomnaplózás támogatása, valamint az álmok értelmezése, ezek által az önreflexió támogatása. Az alkalmazás különleges értéke, hogy idővel egyre gazdagabb kontextust épít fel a felhasználó álmairól és személyiségéről, így az elemzések fokozatosan mélyebbé és testre szabottabbá válhatnak, ahogy a rendszer egyre több információt gyűjt és értelmez a felhasználó álomvilágáról és gondolkodásmódjáról. A Feather alkalmazás képes azonosítani visszatérő motívumokat, érzelmi összefüggéseket és kontextuális kapcsolatokat, amelyek hozzájárulhatnak az önismeret elmélyítéséhez. Az alkalmazás több különböző elemzési perspektívát, MI-perszónát tartalmaz, amik segítségével a felhasználó kiválaszthatja, milyen szempontból legyenek értelmezve az álmai (például pszichológiai vagy vallásos). Az alkalmazás egy beépített álomszótárral is rendelkezik, amely a leggyakoribb szimbólumok értelmezését segíti elő. A rendszer túlmutat az álomelemzésen: lehetőséget biztosít a napi érzelmi állapot, affirmációk és mentális jóllét követésére, ezáltal támogatva a hosszú távú pszichológiai mintázatok felismerését. A Feather alkalmazás hasznosságát egy pszichológiai szakértői kiértékelés és egy kérdőíves felhasználói élménykutatás is alátámasztja. Az eredmények azt mutatják, hogy az alkalmazás felhasználóbarát, és releváns, értéket nyújtó, személyre szabott elemzésekkel támogatja az önreflexiót és a pszichológiai jólétet. A szakértői vélemény szerint a rendszer hatékony támogató eszközt jelenthet az önismeret fejlesztésében, míg a felhasználók visszajelzései alapján az alkalmazás intuitív működése és személyre szabhatósága különösen nagy előnyt jelent.",
    "keywords": [],
    "generated_keywords": [
      "Feather",
      "LLM",
      "kontextuális kapcsolatokat"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "Qvkr - Riasztások, amelyek gyorsabbak a tűznél",
    "students": [
      {
        "name": "Lakatos-Berényi László",
        "major": "Sapientia EMTE, Informatika szak, I."
      }
    ],
    "teachers": [
      {
        "name": "dr. Novák Pálma-Rozália",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      }
    ],
    "content": "A tűzoltók munkája egyike azon dolgoknak az életben, amit nem mindenki tud értékelni, amíg be nem következik a baj, amely elhárítására ők hivatottak. Ez az egyik legveszélyesebb és egyben legfontosabb hivatás már évszázadok óta. Ugyanakkor a technológia előrehaladtával az ő módszereiknek és eszközeiknek is fejlődniük kell a nagyobb hatékonyság érdekében. Tűzeseteknél és más vészhelyzetekben minden másodperc számít, és életek múlhatnak azon, hogy milyen gyorsan tudjuk értesíteni a tűzoltókat. Ennek az elősegítésére fejlesztettem ki a Qvkr alkalmazást, amelynek fő célja a tűzoltók és a katasztrófaelhárítási szervek kommunikációjának gyorsítása, és ezzel a munkájuk támogatása. A romániai tűzoltók jelentős része (>60%) önkéntes, ezért nem mindenkinek van fejlett rádiós adó-vevő készüléke, amelyen elérhetik a csapattagokat. Mivel napjainkban a telefonunk mindig a zsebünkben van, egy erre fejlesztett megoldás néhány esetben még hatékonyabb és kényelmesebb lehet, mint az adó-vevő készülékek. A Qvkr egy Android Studio-ban készült, Java nyelven írt Android alkalmazás, amely segítségével offline és online is küldhetnek a szervek riasztásokat a csapattagoknak, vagy akár más, érintett csapatoknak. Az offline riasztások a telefon beépített SMS szolgáltatásait használják, az online riasztások pedig a Firebase Cloud Messaging szolgáltatást, ezzel biztosítva, hogy az információk eljutnak mindenkihez, a lehető leggyorsabban, bármilyen körülmények között. A felhasználók és állomások adatainak tárolására a Firebase Firestore-t használtam, amely egy könnyen skálázható adatbázis. Egyes tűzoltóságok már több mint fél éve használják és tesztelik az alkalmazást, visszajelzést adva az esetleges hibákról és ötletekről. Ezzel az alkalmazás odáig fejlődött, hogy már 9 tűzoltóság és közel 100 felhasználó használja aktívan a Qvkr-t riasztórendszerként, és pozitív visszajelzést adnak a megbízhatóságáról. A biztonság és sebesség mellett a rendszer más, bevetést segítő funkciókat is kínál, például térképes megjelenítést a tűzcsapoknak és tűzeseteknek, valamint beépített statisztikai grafikonokat.",
    "keywords": [],
    "generated_keywords": [
      "Android",
      "Firebase Cloud Messaging",
      "Java"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "3kcal - kalóriaszámláló és -követő alkalmazás",
    "students": [
      {
        "name": "Fülöp Bernadett-Timea",
        "major": "Sapientia EMTE, Informatika szak, III."
      },
      {
        "name": "Illés Izabella-Krisztina",
        "major": "Sapientia EMTE, Informatika szak, III."
      },
      {
        "name": "Nagy Henrietta",
        "major": "Sapientia EMTE, Informatika szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Novák Pálma-Rozália",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      }
    ],
    "content": "A dolgozat témája a táplálkozás nyomon követésének hatékonyabbá tétele, különös tekintettel a kalóriabevitel gyors és pontos monitorozására. A táplálkozás napjainkban kiemelkedő szerepet játszik az egészséges életmód fenntartásában, melynek elősegítésére egyre többen próbálnak alkalmazni olyan lehetőségeket, amelyek elősegítik a kalóriabevitel pontosabb nyomon követését. A napi étkezések figyelemmel kísérése elengedhetetlen ahhoz, hogy személyre szabott táplálkozási terveket készíthessünk, különösen azok számára, akik a megfelelő testsúlyt vagy egyéb egészségi célokat szeretnének elérni. A kalóriák pontos követése azonban időigényes és gyakran bonyolult folyamat, különösen akkor, ha az étkezések összetett fogásokból állnak, és nem mindig könnyű meghatározni egy étkezés tápanyag-összetételét. Továbbá, az emberek hajlamosak alábecsülni az elfogyasztott kalóriákat, vagy időhiány miatt egyszerűen elfelejteni rögzíteni az étkezéseket, ami a pontos nyomon követés egyik legnagyobb akadálya. A 3KCAL egy innovatív alkalmazás, amely átfogó megoldást kínál az étkezések és a vízfogyasztás nyomon követésére. Az automatikus ételfelismerésnek köszönhetően a felhasználók gyorsan és egyszerűen rögzíthetik az elfogyasztott ételeket, valamint a Meal Line funkció segít az étkezések áttekinthető rendszerezésében. A beépített kalóriaszámláló rendszer valós idejű adatokat biztosít a napi bevitelről, megkönnyítve ezzel a pontos követést. A rendszer egy kezdeti Survey kitöltésével meghatározza a felhasználó napi kalóriaszükségletét, és személyre szabott nutriciós ajánlásokat nyújt, ezzel támogatva az egészséges és kiegyensúlyozott táplálkozást. Az alkalmazás Flutter technológiával készül, amely lehetővé teszi a többplatformos, reszponzív felhasználói felület kialakítását. A háttérrendszer egy mikroszervizes architektúrára épül, biztosítva a rugalmas skálázást és a hatékony működést. Az adatok tárolására és kezelésére több adatbázisrendszert használunk, míg az alkalmazás biztonságát és konfigurációkezelését Vaultwarden biztosítja. A szolgáltatások kitelepítését és menedzselését Helm Chartok segítik, megkönnyítve a konténerizált környezetben történő üzemeltetést.",
    "keywords": [],
    "generated_keywords": [
      "3KCAL",
      "Helm Chartok",
      "Meal Line",
      "Vaultwarden",
      "nyomon követés"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "Vitalink Mobilalkalmazás: Pulzusmérés PPG-technológia alkalmazásával",
    "students": [
      {
        "name": "Bús Gergő-Vince",
        "major": "Sapientia EMTE, Informatika szak, III."
      },
      {
        "name": "Orbán Botond",
        "major": "Sapientia EMTE, Informatika szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Novák Pálma-Rozália",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      }
    ],
    "content": "A szív- és érrendszeri betegségek világszerte a vezető elhalálozási okok közé tartoznak. A modern életmód – a mozgásszegény életvitel, a helytelen táplálkozás és a fokozott stressz – jelentősen növeli ezen betegségek kialakulásának kockázatát. Ennek ellenére a népesség jelentős része nem fordít hangsúlyt az egészsége megőrzésére, mivel a hagyományos orvosi vizsgálatok időigényesek és nem mindig elérhetőek. Dolgozatunk célja a mobileszközök kamerájával végzett szívritmusmérés lehetőségeinek vizsgálata, valamint a módszer hatékonyságának és megbízhatóságának értékelése. Az okostelefonok alkalmazása egy könnyen elérhető és felhasználóbarát megoldást kínálhat az egészségmonitorozásra, hozzájárulva a szív- és érrendszeri állapot folyamatos nyomon követéséhez és fenntartásához. Munkánk során a fotopletizmográfia (PPG) elvét alkalmaztuk, amely az iparban széles körben elterjedt szívritmus- meghatározási technika. Népszerűségét non-invazív jellege és könnyű elérhetősége biztosítja, mivel egyszerűen alkalmazható mind orvosi, mind fogyasztói eszközökben. Az alkalmazásunk a React Native keretrendszerben készült, míg a szerveroldalt a Java Spring biztosítja. A mérések pontosságát különböző külső eszközökkel, például okosórával és pulzoximéterrel végzett összehasonlító vizsgálatokkal ellenőriztük.",
    "keywords": [],
    "generated_keywords": [
      "Java Spring",
      "PPG",
      "React Native",
      "nyomon követés"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "Skinology: A bőrápolás és technológia találkozása",
    "students": [
      {
        "name": "Dezső Szabolcs",
        "major": "Sapientia EMTE, Informatika szak, III."
      },
      {
        "name": "Kádár Ákos-Gergő",
        "major": "Sapientia EMTE, Informatika szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Novák Pálma-Rozália",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      }
    ],
    "content": "A bőrápolás egyre nagyobb jelentőségű terület a modern társadalomban, ahol a szubjektív, egyéni igények és a tudományos ismeret kulcsfontosságú szerepet játszanak az emberek életében. Az emberek egy része felismeri, hogy a jól ápolt és igényes bőr hozzájárul a magabiztos és pozitív megjelenéshez egyaránt a magán- és szakmai életükben is, ennek ellenére a társadalom nagy része nem fordít elég hangsúlyt a bőre megfelelő ápoltságára. Jelen dolgozat célja egy innovatív és kompakt mobilalkalmazás, a Skinology fejlesztése, amely mesterséges intelligencia (MI) segítségével személyre szabott és gyors bőrápolási megoldásokat kínál a felhasználóknak. Az applikáció három funkcióra épül, amelyekkel hozzájárul a felhasználók mindennapjainak átalakításához: ● Személyre szabott bőrápolási rutinok kialakítása a rendszeresség érdekében. A felhasználó emlékeztető értesítést kap a rutinja megkezdése előtt, így nem felejti el az elvégzését. ● Bőrápolási termékek összetevőinek elemzése, amely segítségével többletinformációt kaphat a felhasználó arról, hogy pontosan mit is használ a bőrére. Az összetevők kategorizálása segítségével egyértelműen látszik az, hogy melyik termék mennyire egészséges a bőrfelületre nézve. ● Bőranalízis AI segítségével. Az alkalmazás egy saját, személyre szabott AI modell segítségével elemzi a felhasználók által feltöltött fotókat és azonosítja a potenciális bőrproblémákat, vagy pozitív visszajelzést ad, hogy nincs semmilyen betegség az adott felületen, ezzel időt spórolva a felhasználóknak. A Skinology egy ígéretes eszköz a személyre szabott dermatológia területén, amely a mesterséges intelligencia és a bőrápolási tudomány ötvözésével hatékony megoldást kínál a felhasználóknak, mindezt emberközeli és intuitív módon. Az applikáció célja, hogy hozzájáruljon a tudatos bőrápoláshoz, és növelje a bőrgyógyászati ellátás hatékonyságát. A Skinology segítségével az emberek bőre ápoltabb, megjelenésük igényesebb és magabiztosabb lesz.",
    "keywords": [],
    "generated_keywords": [
      "Skinology"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "EventHub - Generatív AI módszereken alapuló eseménygyűjtő és -kereső szoftverrendszer",
    "students": [
      {
        "name": "Tőtős Armand",
        "major": "Sapientia EMTE, Informatika szak, III."
      },
      {
        "name": "Kukta Norbert-Attila",
        "major": "Sapientia EMTE, Informatika szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Novák Pálma-Rozália",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      }
    ],
    "content": "Sokunk számára ismerős lehet az a helyzet, amikor otthon, vagy akár egy új városban tartózkodva nem tudjuk, hogyan töltsük el a szabadidőnket. Gyakran előfordulhat, hogy a számunkra érdekes eseményekről nem szerzünk tudomást időben, vagy egyáltalán nem is értesülünk róluk. Ennek oka általában az, hogy az eseményekről szóló információk szétszórtan érhetők el, vagy teljesen elkerülnek minket. Erre a problémára kínál megoldást az EventHub nevű webalkalmazás. Az alkalmazás célja, hogy segítsen a felhasználóknak nyomon követni a különböző eseményeket, így biztosítva, hogy soha ne maradjanak le a számukra fontos programokról. Az alkalmazás könnyen elérhetővé és áttekinthetővé teszi az eseményekről szóló információkat, megkönnyítve a szabadidő eltöltésének tervezését, bárhol is tartózkodjunk. A rendszer frontendje Next.js/React és TypeScript használatával készült, biztosítva az intuitív felhasználói élményt, míg a backend .NET/C# és PostgreSQL technológiákra épül, hatékony adatkezelést és skálázhatóságot kínálva. Az adatgyűjtést támogató Facebook SDK, Puppeteer és az AI-Scraper kombinációja lehetővé teszi az események pontos és gyors begyűjtését, akár komplex weboldalakról is. Az alkalmazás térképes nézetet, szűrési lehetőségeket, naptárintegrációt és útvonaltervezést kínál, tovább bővítve az alkalmazás funkcionalitásait. A platform különböző szerepköröket támogat (Guest, User, Organizer, Superadmin), így a vendégek regisztráció nélkül böngészhetnek, míg az eseményszervezők automatizáltan integrálhatják eseményeiket. A kitelepítés GitLab CI/CD pipeline-nal és Docker konténerizációval valósult meg, garantálva a stabil és biztonságos működést (pl. wildcard SSL tanúsítvány).",
    "keywords": [],
    "generated_keywords": [
      ".NET",
      "AI-Scraper",
      "C#",
      "CD",
      "Docker"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "Biciklifelügyelő rendszer önvezetőjármű-technológiákhoz",
    "students": [
      {
        "name": "Magyari Csaba",
        "major": "Sapientia EMTE, Számítástechnika szak, IV."
      }
    ],
    "teachers": [
      {
        "name": "dr. Márton Lőrinc",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      },
      {
        "name": "dr. Fehér Áron",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      }
    ],
    "content": "Az autonóm járművek és a kerékpárok összehangolt működése kulcsfontosságú a modern közlekedésbiztonság szempontjából. Az ilyen típusú rendszerek alkalmazásával nemcsak a balesetek száma csökkenthető, hanem a közlekedés hatékonysága és gördülékenysége is jelentősen javítható. A dolgozat célja a kerékpáros közlekedés biztonságának növelése autonóm járművek jelenlétében. Ennek érdekében egy beágyazott biztonsági rendszert fejlesztettünk kerékpárra. Az eszköz ESP32 mikrovezérlővel van felszerelve, amely folyamatosan figyeli és feldolgozza a hozzákapcsolt GPS és IMU (inerciális mérőegység) szenzorok adatait. Az így nyert információkat az eszköz MQTT protokollon keresztül továbbítja egy központi szerver felé, amely az autonóm járművön helyezkedik el, és megvalósítja a valós idejű adatcserét, valamint a folyamatos kapcsolat fenntartását a rendszer különböző komponensei között. Ez a megoldás segíti az autonóm járműveket abban, hogy pontosan érzékeljék a közelükben haladó kerékpárokat, ezzel jelentősen csökkentve az ütközések és balesetek kockázatát. Az elküldött adatok alapján a bicikli pontos pozíciója, valamint a váz és az első kerék orientációja is megjeleníthető egy térképes vizualizáció segítségével. A begyűjtött adatok egy MySQL adatbázisban kerülnek eltárolásra, így lehetőség nyílik a kerékpár mozgásának pontos visszakövetésére. Minden adatot időbélyeggel együtt mentünk el, hogy később pontos elemzéseket és rekonstrukciókat lehessen végezni.",
    "keywords": [],
    "generated_keywords": [
      "ESP32",
      "IMU",
      "MQTT",
      "MySQL"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "Pumped, the fitness revolution",
    "students": [
      {
        "name": "Ambarus Balázs",
        "major": "Sapientia EMTE, Informatika szak, II."
      },
      {
        "name": "Kilyén László",
        "major": "Sapientia EMTE, Informatika szak, II."
      }
    ],
    "teachers": [
      {
        "name": "dr. Jánosi Rancz Katalin Tünde",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      }
    ],
    "content": "A szociális média a világ legnagyobb online kommunikációs platformja, amelyen emberek milliárdjai aktívan jelen vannak. Jelentős szerepet játszik a kapcsolattartásban és az információáramlásban, megkönnyítve a kommunikációt és az összekapcsolódást. Emellett a leggyorsabban növekvő digitális piacok egyikévé vált. A fitnesz jelenleg egy feltörekvő piac, amely különösen nagy hatást gyakorol a fiatalokra. Egyre többen nyitnak az egészséges életmód felé, azonban sokan az első néhány hét után, motiváció hiányában, feladják. Továbbá, ha valaki megosztaná eredményeit a közösségi médiában, gyakran tart mások negatív véleményétől. A mi applikációnk ezeket a problémákat kívánja megoldani. Egy olyan fitneszorientált közösségimédia-alkalmazást hoztunk létre, amely jutalmazza a kitartó sportolókat. Emellett reklámlehetőséget biztosítunk személyi edzőknek és fitnesztermeknek, elősegítve azok növekedését. Célunk, hogy egy támogató közösséget építsünk, ahol az emberek szabadon megoszthatják fejlődésüket, és mindenki egy közös célért, az egészségesebb életért dolgozhat. Egymást inspirálva és támogatva egy egészségesebb világot teremthetünk. A mi alkalmazásunk nagyon sok AI megvalósítást tartalmaz, de kiemelnénk azt az egyedülálló funkcióját, amely a felhasználó arcképe alapján generál egy 3D-modellt, amely az izomtömeg változásait tükrözi az aktivitás alapján. Az applikáció front-end része React Native technológiával készült, míg a back-end Node.js-ben valósult meg, különböző mesterségesintelligencia-modellekkel kombinálva. Térképünkön megtalálható a világ összes edzőterme, amelyet web scraping technológia segítségével importáltunk. Ennek köszönhetően egy natív, felhasználóbarát és egyszerű felületet hoztunk létre, amely képes biztosítani a kívánt eredményeket. Alkalmazásunk elérhető az App Store-ban és a Google Play Áruházban. Letöltési útmutató megtalálható a weboldalunkon: https://thepumpedapp.com.",
    "keywords": [],
    "generated_keywords": [
      "3D-modell",
      "App Store",
      "Google Play Áruház"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "BlitzARena",
    "students": [
      {
        "name": "Nagy Botond",
        "major": "Sapientia EMTE, Informatika szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Jánosi Rancz Katalin Tünde",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      }
    ],
    "content": "A kiterjesztett valóság (AR) technológia dinamikusan fejlődő terület, amely jelentősen átalakítja a szórakoztatóipart, különösen a videojátékok világát. Az AR lehetővé teszi a digitális tartalmak integrálását a fizikai valósággal, interaktív és magával ragadó élményeket teremtve. A projektem, melynek a BlitzARena nevet adtam, egy úttörő AR shooter játékot mutat be, amely a legmodernebb mesterséges intelligencia, számítógépes látás és mobil technológiákat használja fel. A játék alapkoncepciója a valós térben történő szabad mozgás és a virtuális elemekkel való interakció ötvözése. A játékosok a mobiltelefonjuk képernyőjét használják a célzásra, de készíthetnek játékfegyvert kartonból, amire felerősíthetik az eszközt, így fokozva a játékélményt és segítve a pontos célzást. A telefonok kamerái valós időben rögzítik a környezetet, és AI algoritmusok segítségével azonosítják az eltalált játékost és annak testrészét. A mesterséges intelligencia kulcsszerepet játszik a játékban, a játékosokat megkülönböztető AI modellek tanítása minden játék elején történik meg. A játékmenet során a játékosok csapatokra osztva küzdenek egymás ellen. A projektemben a mobilalkalmazáshoz React Native-et, a szerver oldaloz NestJS-t és FastAPI-t, az AI modellekhez YOLO modelleket használok.",
    "keywords": [],
    "generated_keywords": [
      "AR",
      "BlitzARena",
      "FastAPI",
      "NestJS",
      "React Native"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "Didaktikai szoftveralkalmazás Hamming- és Hsiao-kódok tanulmányozására",
    "students": [
      {
        "name": "Kocsis Lenke",
        "major": "Sapientia EMTE, Infokommunikációs hálózatok és rendszerek szak, IV."
      }
    ],
    "teachers": [
      {
        "name": "dr. Domokos József",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      }
    ],
    "content": "A dolgozat célja egy didaktikai szoftver eszköz fejlesztése a Hamming- és Hsiao-kódok szemléltetésére és elemzésére. A Hamming-kód az egyik legismertebb hibajavító kód, amely egyszeres hibák javítására és kétszeres hibák detektálására alkalmas, míg a Hsiao-kód az előbbi optimalizált változata, amely hatékonyabb hardveres implementációt tesz lehetővé. A kutatás során először a kódok matematikai alapjait és működési elvét vizsgáltam meg, majd a különböző implementálási lehetőségeket elemeztem. Az első szakaszban manuális lépésekkel állítottam elő a kódokat, majd teljesen algoritmikus megoldást dolgoztam ki, amely bármely méretű és a valóságban felhasznált kódra alkalmazható. A program MATLAB környezetben készült, és lehetővé teszi a Hamming-kódok generálását (szisztematikus és nem szisztematikus formában), ellenőrzését, vizualizációját, valamint az egyes kódolási és dekódolási lépések részletes elemzését mind a szűkített Hammingkódok, mind a bővített Hamming-kódok esetében. Az interaktív megjelenítés segíti a felhasználókat a hibajavító mechanizmusok működésének mélyebb megértésében, ezáltal támogatva az oktatást és a kutatást egyaránt. A dolgozatban bemutatom az implementáció lépéseit, a különböző módszerek közötti különbségeket, valamint az eszköz didaktikai szerepét. Az elkészült program hozzájárul a hibajavító kódok elméleti és gyakorlati elsajátításához, megkönnyítve azok tanulmányozását és alkalmazását mind az oktatásban, mind a mérnöki gyakorlatban.",
    "keywords": [],
    "generated_keywords": [
      "Hamming",
      "Hsiao-kód"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "Didaktikai szoftveralkalmazás ciklikus és BCH-kódok tanulmányozására",
    "students": [
      {
        "name": "Jakab Evelin",
        "major": "Sapientia EMTE, Infokommunikációs hálózatok és rendszerek szak, IV."
      }
    ],
    "teachers": [
      {
        "name": "dr. Domokos József",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      }
    ],
    "content": "A dolgozat célja egy didaktikai eszköz fejlesztése a ciklikus kódok, különösen a BCH-kódok szemléltetésére és elemzésére. A BCH-kódok fontos szerepet töltenek be a hibajavító kódolás területén, mivel képesek többszörös hibák javítására, és széles körben alkalmazzák őket a távközlési rendszerekben. A kutatás során a ciklikus kódok és a BCH-kódok matematikai alapjait és működési elvét tanulmányoztam, majd a különböző implementálási lehetőségeket elemeztem. Először manuálisan állítottam elő a kódokat, majd további fejlesztésként egy automatikus megoldást dolgoztam ki, amely bármely méretű és valós alkalmazásokban használt ciklikus kódra alkalmazható. A program MATLAB környezetben készült, és lehetővé teszi az egy hibát és a több hibát javító kódok generálását. A dolgozatban bemutatom a ciklikus kódok elméleti hátterét, az implementáció lépéseit, valamint az eszköz didaktikai szerepét. Az elkészült program hozzá fog járulni a ciklikus kódok elméleti és gyakorlati elsajátításához, megkönnyítve azok tanulmányozását és alkalmazását mind az oktatásban, mind a mérnöki gyakorlatban.",
    "keywords": [],
    "generated_keywords": [
      "BCH-kódok",
      "MATLAB"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "Automatikus jelenlét-nyilvántartás didaktikai környezetben",
    "students": [
      {
        "name": "Kénesi Balázs Attila",
        "major": "Sapientia EMTE, Informatika szak, III."
      }
    ],
    "teachers": [
      {
        "name": "Naghi Mirtill Boglárka",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      }
    ],
    "content": "Dolgozatom témája egy automatikus jelenlét-nyilvántartó rendszer oktatási környezetben. A jelenlétek nyilvántartása nagy szerepet játszik az oktatási rendszerekben, mivel a tanárok így követhetik, hogy egyes hallgatók teljesítették-e a kötelező órai jelenléteket. A jelenlegi rendszerben a jelenlétek rögzítése legtöbbször írásos módon vagy jelenlét- felolvasással történik, amelyek időigényesek és a csalás veszélye is fennál. Az dolgozatom célja, hogy erre a problémára egy olyan megoldást adjon, amely a jelenlegi rendszert digitalizálja, felgyorsítja, és minimalizálja a csalás lehetőségét. A rendszerem három fő komponensből áll: egy mobilalkalmazásból, egy weboldalból és egy intelligens eszközből, amely NFC technológiát használ. A hallgatók a mobiltelefonjukkal azonosítják magukat az intelligens eszköznél, amely egy hitelesítési folyamatot indít el. A tanárok a webalkalmazásban férnek hozzá a jelenléti adatokhoz, ezeket itt kezelhetik, szűrhetik, illetve letölthetik. A folyamat célja, hogy az intelligens eszköz integrálásával megnehezíti a diákoknak a saját jelenlétük meghamisítását. Különböző támadási módszerek figyelembevételével a rendszer – kialakításának köszönhetően – megvalósíthatatlanná teszi a jelenlétek meghamisításának leggyakoribb módjait. A digitalizált és automatizált rendszerem minimalizálja a jelenléti csalások lehetőségeit, emellett egy átláthatóbb és egységesített megoldást kínál az oktatók számára a jelenléti adatok kezelésére. A fejlesztés során alkalmazott modern technológiák biztosítják a rendszer skálázhatóságát, karbantarthatóságát és könnyen kezelhetőségét, mind a diákok, mind a tanárok számára.",
    "keywords": [],
    "generated_keywords": [
      "NFC",
      "csalás"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "PawPrints szociális média alkalmazás",
    "students": [
      {
        "name": "Novák Blanka-Bernadett",
        "major": "Sapientia EMTE, Informatika szak, III"
      },
      {
        "name": "Sipos Bálint",
        "major": "Sapientia EMTE, Informatika szak, III"
      }
    ],
    "teachers": [
      {
        "name": "dr. Antal Margit",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      }
    ],
    "content": "Dolgozatunk egy olyan közösségimédia-alkalmazás fejlesztésére összpontosít, amely kisállatgazdák és az állatok iránt érdeklődő személyek számára kínál egy szórakoztató, interaktív platformot. Célunk, hogy egy olyan helyet hozzunk létre, ahol a felhasználók megoszthatják kisállataikkal kapcsolatos élményeiket, fotóikat és történeteiket, miközben új barátokat találhatnak, és közösen élvezhetik a sétákat és más szórakoztató programokat. A felhasználók az alkalmazásban könnyedén posztolhatnak, képeket oszthatnak meg, valamint nyomon követhetik más gazdák sétáit és eseményeit. Az applikáció arra is lehetőséget ad, hogy a gazdák könnyen kapcsolatba lépjenek egymással, szervezzenek közös sétákat, és segítsenek egymásnak a legjobb helyek és programok felfedezésében kisállataikkal. A frontend fejlesztéséhez a React Native keretrendszert használtuk, amely lehetővé teszi, hogy az alkalmazás zökkenőmentesen működjön mind iOS, mind pedig Android platformokon. Az adatokat a Firebase segítségével tároljuk és kezeljük, ami biztosítja a gyors és biztonságos adatkezelést és a valós idejű kommunikációt a felhasználók között. A backendet egy saját fejlesztésű, NestJS alapú REST API biztosítja, amely lehetővé teszi az alkalmazás számára, hogy skálázható legyen, és biztonságos módon működjön. A célunk nemcsak egy technológiai megoldás biztosítása, hanem egy olyan közösség építése is, ahol a kisállatgazdák és azok, akik szeretik az állatokat, egy helyen találkozzanak, és együtt élvezhessék a közösen eltöltött időt. A projekt olyan egyedülálló élményt kínál, amely a közösségi interakciókon és a szórakozáson keresztül erősíti a felhasználók kapcsolatát egymással és kisállataikkal.",
    "keywords": [],
    "generated_keywords": [
      "Android",
      "Firebase",
      "NestJS",
      "React Native",
      "iOS"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "Bus4U",
    "students": [
      {
        "name": "Portik Szabolcs",
        "major": "Sapientia EMTE, Számítástechnika szak, IV."
      },
      {
        "name": "Zsigmond Attila",
        "major": "Sapientia EMTE, Számítástechnika szak, IV."
      }
    ],
    "teachers": [
      {
        "name": "dr. Szántó Zoltán",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
      }
    ],
    "content": "Napjaink felgyorsult világában kevesen használják a tömegközlekedést, mert az nem elég kényelmes, nem elég gyors, vagy éppen nem úgy működik, ahogy azt elvárnánk tőle. A gyakori problémák közé tartozik, hogy a buszok nem tartják a menetrendet vagy a jegyek megvásárlása nehézkes. Sok helyen a menetrend nincs kifüggesztve a megállókban, és az interneten sem elérhető. Az is gyakran megesik, hogy a buszok nagyon zsúfoltak, és erről az utazni vágyók csak akkor vesznek tudomást, amikor már a megállóban vannak, és nem áll rendelkezésre más utazási lehetőség. A fent említett problémákra kínál megoldást a Bus4U online platform, amely egy mobilalkalmazásból, egy felhasználói weboldalból és egy adminisztrátori weboldalból tevődik össze. A végfelhasználók számára elérhető funkciók közé tartozik a buszjáratok keresése a kiindulópont, a célállomás és az időpont megadásával, a járatokra szóló előzetes online jegyvásárlás, illetve a járatok indulási időpontjainak megtekintése városokra és megállókra lebontva. Ezen kívül megtekinthetőek a buszmegállók a térképen, városok és útvonalak szerint szűrve, valamint valós időben követhetők az autóbuszok pillanatnyi helyzetei is. Az alkalmazás másik fontos része az adminisztrációs felület, amelyet a busztársaságok használhatnak. Ezen a felületen lehetőség van a menetrendek kezelésére, új útvonalak és megállók felvitelére, valamint a meglévő adatok frissítésére. Továbbá itt kezelhetők az alkalmazottak információi, beleértve a sofőrök és egyéb személyzet adatait, valamint az autóbuszok műszaki és üzemeltetési adatai. Ez az adminisztrációs rendszer biztosítja a busztársaságok adatainak karbantartását, így azok könnyedén frissíthetik szolgáltatásaikat és biztosíthatják a pontosságot. A rendszer különböző szolgáltatásainak biztosításához, mint például a jegykezelés, szükség van egy másik alkalmazásra is, amely a buszokon található POS-terminálon fut. Ez biztosítja a jegyek érvényesítését, illetve az autóbuszok élő információinak megosztását is a központi szerverrel. Továbbfejlesztési lehetőségek között szerepel a bérletek és különböző kedvezmények létrehozása, valamint a buszok telítettségének követése valós időben. A busztársaságok szempontjából fontos lehet még a sofőrök munkaidejének követése és az automatizált könyvelés bevezetése is.",
    "keywords": [],
    "generated_keywords": [
      "Bus4U",
      "POS-terminál",
      "buszjáratok"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "Tenzorműveletek algoritmikai kifejezése",
    "students": [
      {
        "name": "Hadnagy Lóránt",
        "major": "Sapientia EMTE, Informatika szak, II."
      }
    ],
    "teachers": [
      {
        "name": "dr. Horobeț Emil",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      }
    ],
    "content": "A dolgozat célja olyan programozási nyelvek vizsgálata, amelyek alkalmasak tenzorműveletek algoritmikai kifejezésére, miközben minimalizálják a szintaktikai bonyolultságot. Az APL és BQN mint Iverson-féle nyelvek tömbalapú paradigmájukkal természetesen támogatják a többdimenziós adatok kezelését. Ezek a nyelvek rangpolimorfikus primitíveket kínálnak, amelyek lehetővé teszik komplex algoritmusok tömör megfogalmazását explicit ciklusok nélkül. A kutatás egyik fő eredménye a magasabb rendű szingulárisérték-felbontás (HOSVD) implementálása, ami új betekintést nyújt az NP-teljes tenzorrang-felbontás (CPD) problémába. A dolgozatban bemutatott kód- és algoritmuspéldák jelentős lépést jelentenek az algoritmusok kifejezésének egyszerűsítésében. Ezek értékes eszközöket kínálnak mind az oktatás számára, mind olyan alkalmazásoknak, ahol a matematikai jelölésrendszerrel való szoros kapcsolat, a fejlesztési sebesség, illetve az algoritmusokról való érvelés kiemelt fontosságú.",
    "keywords": [],
    "generated_keywords": [
      "APL",
      "BQN",
      "HOSVD"
    ]
  },
  {
    "major": "Informatika és szoftverfejlesztés",
    "year": 2025,
    "title": "ThesisFinder: Intelligens keresés diplomadolgozatokban",
    "students": [
      {
        "name": "Fazakas Nimród",
        "major": "Sapientia EMTE, Számítástechnika szak, IV."
      }
    ],
    "teachers": [
      {
        "name": "dr. Antal Margit",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      }
    ],
    "content": "Dolgozatom témája egy keresőrendszer tervezése és implementálása, amely államvizsga-dolgozatokat tárol és dolgoz fel Elasticsearch segítségével. A rendszer háromféle keresési lehetőséget biztosít a felhasználók számára: hagyományos kulcsszavas keresést, szemantikus keresést, valamint egy mesterséges intelligenciával támogatott kérdés-válasz rendszert. A hagyományos keresési mód teljes szöveges keresést és pontos kifejezésegyezést tesz lehetővé, kiemelve a releváns találatokat. A szemantikus keresés ezzel szemben a dokumentumok tartalmi hasonlóságát vizsgálja vektoralapú szövegreprezentációk (embeddingek) segítségével, lehetővé téve a fogalmi egyezések és a szinonimák felismerését, még akkor is, ha azok eltérő megfogalmazásban jelennek meg. A harmadik keresési mód, a Retrieval-Augmented Generation (RAG) rendszer, amely egy nagy nyelvi modellt használ a felhasználói kérdések értelmezésére és a legrelevánsabb válaszok generálására. A folyamat során a modell először az Elasticsearch-ben tárolt dokumentumok között végez tartalomalapú keresést, majd a megtalált szövegek alapján generál pontos és kontextusfüggő válaszokat. A válaszok mellett a rendszer hivatkozásokat is biztosít az eredeti forrásokra. Célom egy olyan keresőrendszer megvalósítása volt, amely gyors és hatékony információkeresést tesz lehetővé tudományos dolgozatok között. A projekt backendje Python és Flask alapú, a frontend pedig React segítségével készült. A mesterséges intelligencia komponens az Ollama és a SentenceTransformers technológiákra épül, amelyek nagy nyelvi modellek és transzformeralapú szövegreprezentációk alkalmazásával biztosítják a természetes nyelvfeldolgozási képességeket. A rendszer egyik fő erőssége az Elasticsearch keresési lehetőségeinek kihasználása, amely lehetővé teszi a skálázható és nagy teljesítményű információ-visszakeresést.",
    "keywords": [],
    "generated_keywords": [
      "Elasticsearch",
      "Ollama",
      "Python",
      "RAG"
    ]
  },
    {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "A mediatizáció hatása az iskolai bántalmazás megjelenésére és kezelésére",
    "students": [
      {
        "name": "Marosán Mária-Magdolna",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, I."
      }
    ],
    "teachers": [
      {
        "name": "dr. Tőkés Gyöngyvér Erika",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A digitális technológia egyre inkább átszövi a mindennapjainkat, ami a társas kapcsolatainkra is komoly hatással van – különösen az iskolai környezetben. Az iskolai bántalmazás már nem korlátozódik a személyes interakciókra; a cyberbullying egyre elterjedtebb, és leginkább a közösségi médiában zajlik. Az online tér anonimitása, a gyors információáramlás és a folyamatos elérhetőség miatt a bántalmazás felismerése és kezelése sok esetben nehezebb, mint a hagyományos zaklatásé. Kutatásomban azt vizsgálom, hogyan alakítja át a digitális média beépülése a mindennapokba az iskolai bántalmazás jelenségét. Arra keresem a választ, hogy milyen hatással van a diákok közötti kiközösítésre, a cyberbullying különböző formáira és arra, hogy a bántalmazás mennyire befolyásolja a diákok biztonságérzetét. Emellett azt is szeretném megérteni, hogy a médiában bemutatott iskolai bántalmazási esetek hogyan hatnak a pedagógusok és diákok problémakezelési stratégiáira. A kutatás során többféle módszert használok: kérdőívvel mérem fel a diákok tapasztalatait, és interjúkat készítek pedagógusokkal. Az eredmények segíthetnek jobban megérteni, hogyan működik a digitális bántalmazás, és hozzájárulhatnak a hatékonyabb megelőzési stratégiák kidolgozásához.",
    "keywords": [],
    "generated_keywords": [
      "digitális bántalmazás"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "A közösségi média erkölcs- és norma alakító szerepe",
    "students": [
      {
        "name": "Novák Adrienn",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Vajda András",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A közösségi média a modern kommunikáció egyik meghatározó terepévé vált, amely nem csupán az információátadás eszköze, hanem aktívan formálja a társadalmi normarendszereket és értékeket is. A deviancia jelensége egyre inkább észlelhető a közösségi média oldalakon közzétett tartalmakban. A TikTok az egyik legszélesebb körben elterjedt platform a fiatal generációk körében, amely sajátos algoritmusának köszönhetően gyorsan terjedő trendeket hoz létre. Ebből kifolyólag ezek a tartalmak nehezen felülvizsgálhatók, ezért olyan tartalmak is kerülhetnek nyilvánosságra, amelyek szembemennek a kialakult normarendszerekkel. A közösségimédia-felületeken, így a TikTok felületén is észlelhető a cenzúra hiánya. A platform demokratikus jellege miatt ezek a cenzúrázatlan tartalmak esetenként promoválhatnak deviáns viselkedésformákat, és ezek gyors terjedése elősegítheti a deviáns megnyilvánulások normalizálódását. A TikTok által kínált interaktivitás lehetősége, például a „stitch” vagy „duet” funkció, amelyek még inkább elősegítik a tartalmak gyors terjedését, a társadalmi normák átalakulásához járulhatnak hozzá. Ezek a funkciók segíthetnek abban is, hogy egy videó több alkalommal is megjelenjen a TikTok kezdőoldalán vagy az úgynevezett „For You Page”-en . A kutatás célja a TikTok szerepének vizsgálata a deviáns viselkedések megjelenésében és elterjedésében. A dolgozat tartalomelemzés módszerével vizsgálja a TikTok platformján található különböző műfajok alapján rendszerezett tartalmakat, a tartalomgyártok motivációit a deviáns tartalmak népszerűsítésében és a tartalomfogyasztók visszajelzéseit az adott tartalmakra.",
    "keywords": [],
    "generated_keywords": [
      "TikTok"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "A 2024-es romániai választások elnökjelöltjeinek ígéreteiből és jóslataiból kibontakozó jövőképvíziók",
    "students": [
      {
        "name": "Szabo Lajos-Dániel",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Fülöp Otília",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      },
      {
        "name": "dr. Tonk Márton",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A dolgozat a 2024-es romániai választások elnökjelöltjeinek nyilatkozatait vizsgálja, különös tekintettel az ezekben megjelenő ígéretekre és jóslatokra, valamint vizsgálja, hogy ezekből milyen egyéni jövőképvíziók bontakoznak ki az országra vonatkozóan. Románia politikai jövőképe, más szavakkal az az elképzelés, amelyet politikai szereplők és pártok fogalmaznak meg az ország vagy társadalom lehetséges vagy kívánt fejlődési irányairól, magában foglalva a gazdasági, társadalmi és nemzetközi célokat, meghatározva, hogy a politikai szereplők milyen értékeket, prioritásokat és stratégiákat tartanak szükségesnek a jövő alakításához, egy igen érdekfeszítő kérdéssé vált a 2024-es romániai elnökválasztások során, az ország nemzetközi megítélésével vállvetve. A szakdolgozat célkitűzéseinek megvalósítását a következő kutatási kérdések megválaszolása teszi lehetővé. Milyen kulcstémák jelentek meg az elnökjelöltek nyilatkozataiban Románia jövőjével kapcsolatban? Milyen retorikai és kommunikációs eszközöket használtak az elnökjelöltek a jövőképük közvetítésére? Hogyan viszonyultak az elnökjelöltek Románia geopolitikai helyzetéhez és nemzetközi szerepéhez? Milyen társadalmi és gazdasági kihívásokra reflektáltak a jelöltek nyilatkozatai? Milyen mértékben használták a jelöltek a közösségi médiát a jövőképről szóló üzeneteik terjesztésére? Hogyan különböztek az egyes elnökjelöltek által megfogalmazott jövőképek egymástól? Milyen hatással voltak ezek a nyilatkozatok a választók percepciójára Románia jövőjéről? Milyen módon jelent meg Románia jövőképének PR-ja a nemzetközi közvélemény számára? Mennyiben feleltek meg az elnökjelöltek által közvetített jövőképek a választók elvárásainak? Milyen következményei lehetnek a jelöltek nyilatkozatai által közvetített jövőképeknek Románia hosszú távú fejlődésére? A dolgozat kérdéseinek megválaszolása érdekében számos kutatást és tudományos publikációt tekintek át, valamint a politikai diskurzus elemzésével és tartalomelemzéssel vizsgálom a kutatási kérdések alapján a jelöltek kommunikációját a Facebook és TikTok közösségi média platformokon, valamint a Digi24 és Maszol hírportálokon. A dolgozat célja, hogy a kutatási kérdések megválaszolásával hozzájáruljon a politikai kommunikáció és az országimázs-építés mélyebb megértéséhez.",
    "keywords": [],
    "generated_keywords": [
      "Digi24",
      "Facebook",
      "Románia"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "Figyelem a mediatizált társadalomban: A digitális média hatása a koncentrációra",
    "students": [
      {
        "name": "Vágási Áron",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, I."
      }
    ],
    "teachers": [
      {
        "name": "dr. Tőkés Gyöngyvér-Erika",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A digitális média egyre növekvő jelenléte a mindennapi életben felveti a kérdést, hogy milyen hatással van a figyelemre és a koncentrációra, különösen a fiatal felnőttek körében. A kutatásom célja, hogy feltárja a médiahasználat és a multitasking jelenségének hatásait az egyetemisták figyelmi kapacitására. A dolgozat egyik célja, hogy hozzájáruljon a mediatizált társadalomban végbemenő figyelmi változások pontosabb megértéséhez, továbbá hogy rávilágítson azokra a mechanizmusokra, amelyek befolyásolják a hallgatók tanulási hatékonyságát. A dolgozat hipotézise szerint a digitális multitasking csökkenti a koncentrációs képességet, míg az önszabályozó stratégiák elősegíthetik a figyelem fenntartását. A kutatás kérdőíves módszertannal készül, amelyre főként a Sapientia Erdélyi Magyar Tudományegyetem Marosvásárhelyi Karán tanuló egyetemisták körében kerül sor. A minta elsősorban 18–25 éves hallgatókból áll, akik különböző szakirányokon tanulnak, így biztosítva a vizsgálat értékét. Az eredmények várhatóan rávilágítanak arra, hogy milyen mértékben befolyásolja a digitális médiahasználat a figyelmi kapacitást, és hogy léteznek-e hatékony stratégiák ennek kezelésére, valamint mennyire elterjedt ezek használata az Sapientia EMTE Marosvásárhelyi Kar keretében tanuló egyetemisták körében. A kutatás hozzájárulhat a digitális média és a figyelem kapcsolatának jobb megértéséhez, amely hosszú távon segíthet a hatékonyabb oktatásban, valamint új módszerek kidolgozásában a tanulók figyelmének fenntartására. Továbbá, segítséget nyújthat a figyelem hatékonyabb fenntartásában, felhívja a figyelmet a csökkenő figyelmi kapacitásra, és ösztönözheti olyan stratégiák kialakítását, amelyek támogatják a koncentráció javítását mind az oktatásban, mind a mindennapi életben.",
    "keywords": [],
    "generated_keywords": [
      "Sapientia"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "Divatkommunikáció a mély mediatizáció korában: Vizuális tartalmak és testképformálás",
    "students": [
      {
        "name": "Oroth Viktória",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, I."
      }
    ],
    "teachers": [
      {
        "name": "dr. Tőkés Gyöngyvér-Erika",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A divat és a vizuális kultúra szoros kapcsolatban áll a társadalmi normákkal, az identitásképzéssel és az önkifejezéssel, de a digitális korszak új dimenziókat nyitott ezen a téren. A közösségi média térhódításával, a mély mediatizáció korában az öltözködés és a divatfogyasztás egyre inkább az online térben zajlik, ahol a nagy divatmárkák trendszetter szerepét ma már átvették az influenszerek, és rohamos tempóban befolyásolják az egyének testképét, önkifejezését és fogyasztói attitűdjét. Az állandóan elérhető és jelen lévő, esztétikailag gondosan szerkesztett vizuális tartalmak befolyásolják a fogyasztók öltözködési szokásait, valamint azt, hogy hogyan érzékelik saját testüket. A kutatás különös figyelmet fordít arra, hogy a közösségi médiában fogyasztott vizuális tartalmak miként befolyásolják a divathoz és öltözködéshez kapcsolódó döntéshozatali folyamatokat, valamint azt, hogy a fogyasztók mennyire érzékelik és tudatosítják ezt a hatást. Milyen szerepet játszanak a trendek és az influenszerek a mindennapi megjelenésük megválasztásában? Mennyire tekintik az öltözködést tudatos önkifejezési formának, és milyen mértékben igazodnak a közösségi média által felállított normákhoz? Vajon művészetként használhatják-e a divatot, az önkifejezés eszközeként, vagy inkább megfelelési kényszer hatására uniformizálódik a megjelenésük? A kutatás rávilágíthat arra, hogyan változik a divathoz és a testképhez való viszony a folyamatos online jelenlét hatására, és milyen dinamikák alakítják az erdélyi magyar egyetemisták fogyasztói magatartását a divattal kapcsolatban a digitális térben.",
    "keywords": [],
    "generated_keywords": [
      "digitális korszak",
      "önkifejezését"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "Újhullámos zenei előadók szerepvállalása a politikai diskurzus kialakításában",
    "students": [
      {
        "name": "Nagy Flórián Attila",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak,"
      }
    ],
    "teachers": [
      {
        "name": "dr. Vajda András",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "Tanulmányom az újhullámos magyar könnyűzenei előadók politikai diskurzusban betöltött szerepét vizsgálja. Az utóbbi években egyre több fiatal előadó lépett ki a hagyományos zenei keretek közül, és vállalt aktív véleményformáló szerepet közéleti és politikai kérdésekben egyaránt. A kutatás fő célja feltárni, hogy milyen hatással vannak ezek a megnyilvánulások a fiatal generáció politikai szocializációjára és közéleti aktivitására. A dolgozat központi kérdése, hogy az újhullámos előadók politikai és társadalmi üzenetei miként befolyásolják rajongóik nézeteit és részvételi hajlandóságát. Emellett releváns kérdésként merül fel, hogy a követők mennyire azonosulnak az előadók által közvetített értékekkel, és milyen mértékben befolyásolják, alakítják ezek a narratívák a politikai közbeszédet Magyarországon. A kutatás kvalitatív módszertant alkalmaz, elsősorban tartalomelemzésre építve. Elemeztem az érintett előadók dalszövegeit, nyilvános megnyilvánulásait és közösségi médiás aktivitásukat, valamint vizsgáltam a rajongói reakciókat és diskurzusokat és ezek egymásra gyakorolt hatását. Az elemzés során kiemelt figyelmet fordítottam a politikai üzenetek fogadtatására és azok társadalmi beágyazottságára. A várható eredmények alapján az újhullámos előadók politikai szerepvállalása jelentős hatással lehet a fiatalok politikai attitűdjeire és aktivitására. Az eredmények hozzájárulhatnak annak megértéséhez, hogy a populáris kultúra miként válhat a politikai szocializáció eszközévé, és hogyan alakíthatja egy generáció közéleti elköteleződését.",
    "keywords": [],
    "generated_keywords": [
      "Magyarország"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "A multimédiás eszközök és az online közvetítés hatása a marosvásárhelyi keresztény közösségekre",
    "students": [
      {
        "name": "Kodok Alpár-Mihály",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Fülöp Otília",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A kutatásom célja kideríteni, hogy a multimédiás eszközök és az online közvetítés a marosvásárhelyi keresztény közösségekben létrehozott-e egy új, az online térben kialakult közösséget. Mindezek mellett figyelmet fordítok arra, hogyan használják a magyar keresztény közösségek a multimédiás eszközöket, és ezek hogyan hatnak a hitéletre és a közösségi kapcsolatokra. Továbbá szeretném megérteni, hogy ezek az eszközök milyen előnyöket és problémákat hoznak a marosvásárhelyi keresztény közösségek életébe. A kutatásom során az interjúzás módszerével térképezem fel a marosvásárhelyi keresztény közösségek multimédiás eszközhasználatával kapcsolatos szokásait, tapasztalatait és ezek hatását a vallási gyakorlatokra, közösségi életre és hitéleti fejlődésre. Az interjúk során a marosvásárhelyi keresztény közösségek vezetőinek (papjainak) tapasztalatait és véleményeit vizsgálom, hogy hogyan vélekednek a technológia szerepéről, előnyeiről és kihívásairól, illetve milyen jövőbeli lehetőségeket látnak a multimédiás eszközök alkalmazásában hitéleti és közösségi szinten.",
    "keywords": [],
    "generated_keywords": []
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "Hagyomány és modernitás: Az okostelefon befolyása a nyárádbálintfalvi Gábor cigányok házasságkötésére",
    "students": [
      {
        "name": "Amota Lóránt",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Gagyi József",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A digitális technológia, különösen az okostelefonok és a közösségi média jelentős változásokat idézett elő a hagyományos közösségi normákban. Jelen tanulmány a Maros megyei nyárádbálintfalvi Gábor cigány közösség példáján vizsgálja, hogyan alakította át az okostelefonhasználat a házassági szokásokat 2018 és 2023 között. A kvalitatív kutatás terepmegfigyeléseken és interjúkon alapul, és azt mutatja, hogy a digitális eszközök használata és ennek hatásai fellazítják a generációs hierarchiákat, erősítik az egyéni autonómiát, és növekvő válási arányhoz vezetnek. Az elemzés elméleti kerete szerint a digitális eszközök nem csupán kommunikációs médiumok, hanem a társadalmi viszonyok aktív formálói is. A tanulmány újszerűsége abban rejlik, hogy egy hagyományőrző közösségen belül vizsgálja a digitális kultúra társadalomszervező és normabontó hatásait.",
    "keywords": [],
    "generated_keywords": [
      "Gábor",
      "Maros",
      "digitális"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "Nemek, fülek, kommunikáció: Az üzenetértelmezési stílusok taníthatósága gendernézőpontból",
    "students": [
      {
        "name": "Pápai Melánia Adél",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Fülöp Otília",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A mindennapi kommunikáció során gyakran tapasztalható, hogy a beszélgető felek nem pontosan azt értik, amit a másik mondani akar – különösen igaz ez a férfiak és a nők közötti interakciókra. Deborah Tannen szerint a férfiak és nők eltérő kommunikációs „dialektusokat” használnak, mintha különböző kultúrákból származnának: a férfiak inkább státusz- és teljesítményorientáltan, míg a nők kapcsolat- és empátiaközpontúan kommunikálnak. Friedemann Schulz von Thun négy fül elmélete szerint minden üzenet négy szinten értelmezhető, attól függően, hogy a hallgató melyik „fülével” hallgat: tartalmi, kapcsolati, önkifejező vagy felhívó. A dolgozat a nemek közötti kommunikációs sajátosságok megértésére és tudatosítására törekszik Deborah Tannen nemek nyelvhasználati modellje és Friedemann Schulz von Thun a kommunikáció értelmezési szintjeinek elmélete alapján. A két megközelítés összekapcsolása lehetőséget teremt olyan gyakorlatok kidolgozására, amelyek támogatják a nemek közötti kommunikációs stílusok és értelmezési lehetőségek felismerését. Ezáltal elősegíthető a saját kommunikációs stílus tudatosítása, valamint a másik fél üzenetének a pontosabb értelmezése. A dolgozat célja egy tudatosító gyakorlatsorozat összeállítása, amely fejleszti a kommunikációs érzékenységet, és hozzájárul az együttműködőbb, érthetőbb párbeszéd kialakulásához.",
    "keywords": [],
    "generated_keywords": [
      "Deborah Tannen",
      "nők"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "Generációkon átívelő vállalkozások felelősségvállalása",
    "students": [
      {
        "name": "Lukáts- Menyhárt Boróka",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, II."
      }
    ],
    "teachers": [
      {
        "name": "dr. Molnár Eszter",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A generációkon átívelő vállalkozások felelősségvállalása egyre fontosabb szerepet kap a 21. század üzleti környezetében. A vállalatok ma már nemcsak a gazdasági növekedés elérésére fókuszálnak, hanem arra is, hogy több figyelmet fordítsanak a társadalmi, környezeti és etikai felelősségvállalásra is. Emellett törekednek arra, hogy ezt az online térben is kommunikálják. A tanulmányomban feltérképezem, hogy hogyan is alakulnak a hosszú távú vállalati értékek és a felelősségvállalás a generációk közötti öröklődés során, miközben az online platformok és digitális kommunikációs csatornák új kihívásokat és lehetőségeket kínálnak. A kutatásomban vizsgálom, hogy a vállalkozások hogyan alkalmazkodnak a változó társadalmi és gazdasági környezethez, mialatt fenntartják a generációk közötti kapcsolatot, és közvetítik küldetésüket. A felelősségvállalás, mint kulcsfontosságú tényező, nemcsak a vállalkozás fenntarthatóságát biztosítja, hanem hozzájárul a társadalmi elismertségéhez is. Az empirikus kutatás tartalomelemzésre és interjúkra épül, amelyek révén feltárhatók azok a stratégiák, amelyek hozzájárulnak a vállalkozások generációkon átívelő sikeréhez. A tartalomelemzés során megvizsgáltam a vállalkozások weboldalait és a használt közösségimédia-oldalakat. Az interjúk során pedig a vállalatok vezetőit kérdeztem meg olyan fontos témákról, mint például hogy milyen kihívásokkal szembesültek a vállalat átvételekor, illetve hogyan biztosítják az értékek fennmaradását. Autizmussal élő emberek kommunikációja chatbotokkal Hints Orsolya Sapientia EMTE, Kommunikáció és közkapcsolatok szak, II. Témavezető: dr. Fülöp Otília Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék Az autizmus spektrumzavar az egyének társas interakcióira és kommunikációjára gyakorolt hatása miatt kiemelt figyelmet igénylő terület. Az autizmussal élő személyek számára a hagyományos kommunikációs formák sok esetben nehézséget okoznak, ezért a technológia, különösen a mesterséges intelligenciával működő chatbotok alkalmazása megoldást nyújthat számukra, valamint lehetőséget biztosíthat az önkifejezésre. Jelen kutatás célja, hogy feltárja a chatbotok szerepét az autizmussal élő személyek kommunikációjának támogatásában. A vizsgálat arra is rá kíván világítani, hogy milyen kommunikációs kihívásokkal szembesülnek az autizmussal élők, és hogy a digitális megoldások milyen mértékben képesek csökkenteni ezeket a nehézségeket. A kutatás kvalitatív módszertannal, egy autizmusszakértővel készített mélyinterjú segítségével valósul meg. Az interjú célja, hogy átfogó képet nyújtson az autizmussal élők kommunikációs sajátosságairól, valamint a chatbotok előnyeiről és korlátairól a kommunikációban. A kutatás hipotézise szerint az autizmussal élő személyek könnyebben kommunikálnak chatbotokkal, mint szemtől szemben embertársaikkal. Az eddigi szakirodalmi eredmények alapján feltételezhető, hogy az írásbeli és digitális kommunikációs formák csökkenthetik a szorongást, és segíthetik a társas kapcsolatok kialakítását. Tényként megállapítható, hogy az autizmussal élő emberek számára a szemtől szembeni kommunikáció jelentős nehézséget okoz, ami még inkább indokolja a technológiai megoldások kutatását és fejlesztését. A kutatás eredményei hozzájárulhatnak az autizmussal élő személyek kommunikációs lehetőségeinek bővítéséhez, valamint olyan digitális eszközök fejlesztéséhez, amelyek hatékonyabban támogatják e csoport speciális igényeit. A dolgozatom célja, hogy felhívja a figyelmet erre az aktuális témára, és edukálja az embereket, hiszen bármikor kerülhetnek olyan helyzetbe, ahol autizmussal élő személlyel kommunikálnak – akár a mindennapi életben, akár saját érintettségük révén. A tudatosság növelése segíthet abban, hogy ezek a találkozások gördülékenyebbek legyenek.",
    "keywords": [],
    "generated_keywords": []
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "Nők az online játékokban: kommunikáció és sztereotípiák a gaming kultúrában",
    "students": [
      {
        "name": "Uszkai Erika-Patricia",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Vajda András",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "Az online játékok már a 20. századtól fogva szerves részei a társadalmunknak. Bár az online játékok fejlődése folyamatos, az elmúlt évtizedekben robbanásszerű növekedésük figyelhető meg. A 21. században az online játékok nem csupán elterjedtek, hanem a digitális szórakoztatás egyik legmeghatározóbb formájává váltak. Az internet és a technológiai innovációk gyors fejlődése lehetővé tette, hogy ezek a játékok ne csak egyéni kikapcsolódásként szolgáljanak, hanem globális közösségeket hozzanak létre, amelyekben a játékosok együttműködhetnek, versenyezhetnek, és kapcsolatokat építhetnek. A szakdolgozatom témája a nőkre gyakorolt hatás az online játékokban. A kutatásom keretein belül két játékot figyeltem meg, amely a League of Legends és a Valorant. Mind a két játék esetében elemeztem a játék dinamikáját, felépítését, valamint a karaktereket és a külső jellemvonásaikat. A játékon belül fontos szerepet kapott a kommunikáció, legfőképpen a kommunikációs csatornák és a nemek közötti kommunikáció kibontakozása. A nemek közötti kommunikációt és az egymáshoz viszonyulást több szempontból is fontosnak tartottam, ehhez kapcsolódik a nőket illető sztereotípiák sokasága, valamint a sztereotípiák hatása a játékon belüli kommunikációra. Ezekből adódóan a kutatási kérdésem a következő: milyen előítéletek érik a nőket a gaming kultúrában, valamint milyen sztereotípiák vannak jelen a társadalomban? A kiválasztott módszertanom a kérdőív és az interjú. A kérdőívemben megjelenő kérdések közül hét kérdés a szociális helyzetre utal, a többi kérdés pedig férfi és nő esetében változó. A kérdések között szerepel a kommunikáció, a karakterválasztás, valamint nők esetében a kérdéskör, miszerint érte-e őket bármilyen előítélet vagy sértő megnyilvánulás az ellenkező nem részéről. A válaszokból igyekszem csoportokat alakítani, majd a csoportokba tartozó személyekkel interjút készíteni, ahol jobban kibontakozik a nemek közötti kommunikáció. Az empirikus anyagaim tehát kvantitatívak és kvalitatívak egyaránt.",
    "keywords": [],
    "generated_keywords": [
      "League of Legends",
      "játékok"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "Marosvásárhelyi egyetemisták önmegjelenítési és kapcsolatépítési stratégiái az Instagramon",
    "students": [
      {
        "name": "Madaras Polixénia",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Tőkés Gyöngyvér-Erika",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A közösségi média elterjedése nagy hatással volt az emberek önmegjelenítési és kapcsolatépítési szokásainak átalakulására. Az utóbbi években az Instagram a digitális identitásképzés és a társas interakciók meghatározó platformjává vált. Ahhoz, hogy a felhasználók az új felületen érvényesülni tudjanak, létre kell hozniuk egy, a többi felhasználó által elfogadott, online identitást, mivel ez segíti őket az online kapcsolataik kialakításában és fenntartásában. Jelen kutatás célja, hogy feltárja, milyen stratégiákat alkalmaznak a marosvásárhelyi egyetemisták az Instagramon történő önmegjelenítés és kapcsolatépítés során. A kutatás során az interjú és a tartalomelemzés módszerét együttesen alkalmaztam annak érdekében, hogy részletes betekintést nyerjek az egyetemista hallgatók online viselkedésébe. Arra a kérdésre kerestem a választ, hogy a felhasználók milyen szempontok alapján alakítják ki digitális identitásukat, milyen tartalomtípusokat részesítenek előnyben, és hogyan építik kapcsolataikat a platformon keresztül.",
    "keywords": [],
    "generated_keywords": [
      "Instagram",
      "digitális identitás"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "Szürke digitális egyenlőtlenségek",
    "students": [
      {
        "name": "Kovács Szentmártoni Szilvia",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Tőkés Gyöngyvér-Erika",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "Kutatásom a digitális egyenlőtlenségek jelenségét vizsgálja az idősebb korosztály körében Romániában. A téma relevanciáját az adja, hogy ez a generáció nem született bele a digitális világba, hanem élete későbbi szakaszában találkozott a technológiai fejlődéssel, ami számos kihívást jelenthet számukra. A kutatás célja annak feltárása, hogy milyen tényezők befolyásolják az idősek digitális eszközökhöz és az internethez való hozzáférését, illetve azok használatát. A kvalitatív kutatás során félig strukturált interjúkat alkalmaztam, amelyek lehetőséget biztosítanak a személyes tapasztalatok mélyebb megértésére. Az interjúalanyok kiválasztása hólabdamódszerrel történt, miközben arra is figyelmet fordítottam, hogy a minta nem, életkor és társadalmi státusz tekintetében is változatos legyen. Az interjúk elemzése alapján megállapítható, hogy azok az idősek, akik munkájuk során már használtak digitális eszközöket, könnyebben alkalmazkodtak a mindennapi technológiai környezethez. Emellett a családtagok támogató attitűdje és bátorítása jelentős szerepet játszik a digitális kompetenciák elsajátításában és fejlesztésében.",
    "keywords": [],
    "generated_keywords": [
      "Romániában",
      "digitális világ"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "Székelyudvarhelyi Városi Könyvtár online kommunikációjának elemzése",
    "students": [
      {
        "name": "Gálfi Szidónia",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Vajda András",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A megváltozott kommunikációs és technológiai környezet miatt a könyvtáraknak egyre nagyobb kihívást jelent hagyományos feladatainak és szerepének megőrzése, azaz a tudástermelés és a tudásátadás hatékony biztosítása, az olvasók megszólítása, a fiatalabb generációkhoz tartozó olvasók fiegyelmének felkeltése és fenntartása. A digitális technológia olyan változásokat hozott az emberek mindennapi életébe, melyek a könyvtárakat nemcsak új kihívások elé állítja, de egyben aktív és folyamatos jelenlétet is biztosít számára. A 21. század közönségét leghatékonyabban nem a weboldalak, hanem elsősorban a közösségi média segítségével lehet elérni, mivel a társadalmi kommunikáció jobbára ezeken az oldalakon valósul meg. Dolgozatomban a Székelyudvarhelyi Városi Könyvtár online kommunikációját elemzem. A vizsgálat a könyvtár weboldalával és a közösségimédia-oldalak használatával kapcsolatos stratégiákat igyekszik feltárni, kitérve a weboldalon és a közösségi médiában megjelenő tartalmakra is. Azt szeretném megvizsgálni, hogy milyen platformokon és milyen tartalmak mentén tartja a könyvtár a kapcsolatot a célközönségével. Mennyiben igazodik a könyvtár online kommunikációja a mai kor, illetve a célközönség elvárásaihoz, megfelelően tájékoztatja-e a könyvtár a város lakosságát az aktuális programokról és szolgáltatásokról. Központi kérdésem az lenne, hogy hogyan használja a könyvtár az online kommunikációs eszközöket a közönségével való kapcsolattartásban. Mennyire hatékony ezeknek a platformoknak az alkalmazása, illetve mennyire nő a népszerűsége a könyvtárnak ezeknek a kommunikációs eszközöknek a használatával.",
    "keywords": [],
    "generated_keywords": [
      "Székelyudvarhelyi Városi Könyvtár"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "Magyar influenszerek sportmárkákra irányuló marketingkommunikációja a közösségi médiában",
    "students": [
      {
        "name": "Labancz Csenge-Dorottya",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Vajda András",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "Az internet elterjedésével megnőtt az aktív közösségimédia-felhasználók száma, és egyre jellemzőbb az, hogy az emberek az online térben kezdik el építeni személyes énmárkájukat. Így jelentek meg a különböző influenszerek, akik megosztják mindennapjaikat követőikkel, és napról napra azon dolgoznak, hogy minél több embert érjenek el posztjaik által. Időközben több márka is felfigyelt rájuk, és ennek következtében alakult meg az influenszermarketing. A cégek együtt dolgoznak velük, ami egy nagy lehetőséget jelent mindkét fél számára: az influenszerek nagyobb ismertségre tesznek szert azáltal, hogy cégekkel dolgoznak együtt, ugyanakkor a vállalatok termékei/szolgáltatásai is több embert érhetnek el azáltal, hogy az influenszerek saját tapasztalataikat megosztva reklámozzák termékeiket. Dolgozatom központi kérdése az, hogy milyen eszközöket használnak az influenszerek a követőik meggyőzése érdekében, és ebben mennyire tudnak hitelesek maradni. Két sportmárkát választottam ki, amelyek esetében 2-2 influenszert vizsgálok meg. Az egyik márka a Myprotein, amely 2004-ben alakult meg, és mára már a világ vezető online sporttáplálkozási márkájává nőtte ki magát. A két kiválasztott influenszer: Lukovics Tamara, aki 2023-tól, és Halmosi Viki, aki 2024 januárjától van együttműködésben a vállalattal. A másik márka a Gymglamour, amely 2016- ban alakult, és célja, hogy olyan női edzőruhákat értékesítsen, amelyekben minden nő kényelmesen érezheti magát az edzőteremben és azon kívül is. A két kiválasztott influenszer: Kecskés Enikő, aki 2022 szeptembere, és Tóth Andi, aki 2023 májusa óta van együttműködésben a vállalattal. A kiválasztott módszertan a netnográfia és a tartalomelemzés módszere. Az említett influenszereket fél évre visszamenőleg megfigyelem: milyen tartalmakat tettek közzé, milyen fizetett együttműködéseket posztolnak, valamint milyen arányban van jelen a fizetett és nem fizetett tartalom oldalaikon. A megfigyelt közösségimédia-oldalak az Instagram és a TikTok, illetve kisebb mértékben a YouTube felülete lesz. Ugyanakkor megnézem azt is, hogy vannak- e visszatérő motívumok posztjaikban, milyen leírásokat használnak, és milyen reakciókat, kommenteket kapnak posztjaikra a megfigyelt influenszerek.",
    "keywords": [],
    "generated_keywords": [
      "Gymglamour",
      "Halmosi Viki",
      "Instagram",
      "Myprotein"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "A vizuális trendek szerepe a marosvásárhelyi márkák Instagram-kommunikációjában",
    "students": [
      {
        "name": "Vajna Erika-Zsuzsánna",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Tőkés Gyöngyvér-Erika",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A vizuális kommunikáció, a vizualitás nagy jelentőséggel bír a digitális korban, különösen a különböző közösségimédia-platformokon, ahol a képi elemek meghatározó szerepet játszanak a fogyasztókkal való kapcsolatteremtésben és márkaépítésben. Az Instagram fontos eszközként szolgál a márkák arculatának kialakításában és megerősítésében. A dolgozatom a Marosvásárhelyen működő vállalkozások Instagram-kommunikációját vizsgálja, kiemelve a vizualitás szerepét a márkaidentitás építésében. A kutatás célja, hogy feltárja, hogyan használják a helyi márkák az Instagramot vizuális üzeneteik közvetítésére. Dolgozatomban négy helyi vállalkozás Instagramposztjait elemzem, figyelembe véve a vizuális elemeket (színek, tipográfia, arculati elemek), a tartalom jellegét, valamint a felhasználói aktivitást. Bár a kutatás eredményei elsősorban a marosvásárhelyi piac sajátosságait tükrözik, az elemzés hozzájárul a vizuális kommunikáció és a márkaépítés összefüggéseinek mélyebb megértéséhez a digitális térben.",
    "keywords": [],
    "generated_keywords": [
      "Marosvásárhelyen",
      "közösségimédia"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "Székelyföldi múzeumok megjelenése a digitális térben",
    "students": [
      {
        "name": "Balázs Laura",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Vajda András",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A digitalizáció térhódítása a kulturális intézményeket is új kihívások elé állítja. Dolgozatom célja, hogy feltárja, milyen módon jelennek meg a Székelyföld múzeumai a digitális térben, és milyen stratégiákat alkalmaznak a látogatók elérésére érdekében az online felületeken. Kutatásom arra keresi a választ, hogy milyen eszközökkel és milyen platformokon kommunikálnak ezek az intézmények, mennyire aktívak a közösségi médiában, valamint milyen digitális tartalmakat kínálnak a látogatóknak. A vizsgálat során tartalomelemzést végeztem a kiválasztott múzeumok online jelenlétének feltérképezésére, valamint e-mailes interjúkat készítettem az intézmények képviselőivel, hogy mélyebb betekintést nyerjek stratégiáikba és kihívásaikba. Az eredmények rámutattak arra, hogy bár a székelyföldi múzeumok többsége jelen van a digitális térben, az aktivitásuk és a tartalomfrissítés gyakorisága eltérő. Néhány intézmény kiemelkedően jól használja a közösségi médiát és a honlapját a látogatók tájékoztatására, míg mások kevésbé aktívak. A legnagyobb kihívások közé tartozik az erőforráshiány, a szakértelem hiánya, valamint a célközönség digitális elérésének nehézsége. A kutatás rávilágít arra, hogy a múzeumok számára elengedhetetlen a digitális stratégiák tudatos fejlesztése. A sikeres online jelenlét hozzájárulhat a látogatószám növekedéséhez, az intézmények láthatóságának erősítéséhez, valamint a kulturális örökség szélesebb közönséghez való eljuttatásához.",
    "keywords": [],
    "generated_keywords": [
      "Székelyföld"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "Történetmesélés a múzeumi kiállításokban: Dan Perjovschi kiállításának kommunikáció szempontú elemzése",
    "students": [
      {
        "name": "Varga Alexandra",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Vajda András",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A történetmesélés egyre meghatározóbb szerepet játszik a múzeumi kiállításokban, mivel a narratív megközelítés segítségével a látogatók könnyebben kapcsolódhatnak a bemutatott tartalmakhoz, jobban megérthetik azokat, és mélyebb élményben részesülhetnek. A dolgozat megírására az motivált, hogy megtudjam, a narratív megközelítés milyen módon befolyásolja a látogatói élményt, és milyen eszközökkel segítheti a kiállítások üzenetének hatékony közvetítését. Jelen kutatásom célja, hogy feltárjam, hogyan érvényesül a történetmesélés Dan Perjovschi „Muzeu- Múzeum-Museum” című kiállításában, milyen kommunikációs stratégiák jellemzik a műalkotásokat, és ezek milyen hatással vannak a látogatói élményre. A kutatásomban három fő módszertani megközelítést alkalmaztam: tartalomelemzést, vizuális tartalomelemzést és interjúkat. A tartalomelemzés során a kiállítás szöveges és vizuális elemeit vizsgálom, feltárva azok kommunikációs stratégiáit. A vizuális tartalomelemzés Perjovschi grafikáit elemzi abból a szempontból, hogy ezek hogyan támogatják a narratív struktúrát. Az interjúk magukba foglalják a művésszel és a kurátorral készült tartalmas beszélgetést, amit e- mailen keresztül folytattunk, majd megkaptam a feltett kérdéseimre a válaszokat. A kutatás eredményei rávilágítottak arra, hogy Perjovschi kiállítása a vizuális narratíva eszközeivel hatékonyan közvetíti üzeneteit. Az egyszerű, de erőteljes grafikai megoldások interaktív dialógust hoznak létre a látogatókkal, akik aktív részeseivé válnak a kiállítás által megfogalmazott történetnek. A kutatás rámutat arra, hogy a vizuális történetmesélés hatékony eszköz lehet a múzeumi kommunikációban, segítve a látogatók bevonását és a kiállított tartalmak elérhetőbbé tételét. Perjovschi kiállítása például segítségül szolgálhat a kortárs múzeumi narratívák megértéséhez, valamint ahhoz, hogy a múzeumok hogyan alkalmazhatják a vizuális történetmesélés eszközeit a kommunikációs hatékonyság növelésére.",
    "keywords": [],
    "generated_keywords": [
      "Dan Perjovschi",
      "Muzeu- Múzeum-Museum",
      "Perjovschi"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "BookTuberek: Könyvek népszerűsítése a YouTube felületén",
    "students": [
      {
        "name": "Bajnoczy Csiki Yvett",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Vajda András",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A dolgozat a BookTube jelenséget teszi vizsgálat tárgyává. A kutatás során választ szeretnék kapni arra, hogy az Erdélyben élő fiatalokra miképpen hat a BookTube, mennyire határozza meg azt, hogy mit is olvasnak, valamit arra is rákérdezek, hogy a kiadók miként reagálnak a jelenségre, tudnak-e róla egyáltalán, és ha igen, élne-e az általuk adta lehetőségekkel. Mindezek mellett meg szeretném vizsgálni, hogy mennyiben érvényesülnek a magyar booktuberek esetében a nemzetközi trendek, mind például a könyvek annotációi, azok mikéntje, az olvasási szokások, könyves hashtagek és kihívások, amelyek meghatározzák, hogy mit és hogyan olvasnak a követők. Vannak-e olyan műfajok és könyvek, amelyek minden könyvszeretőhöz, könyvrajongóhoz, függetlenül attól, hogy Amerikában, az Egyesült Királyságban vagy magyar nyelvterületen élnek, egyaránt elérnek, és hogy miként változik a bemutatók menete. Emellett megvizsgálom, hogy milyen típusú videók szerepelnek a csatornákon, illetve, nem utolsó sorban, alapul véve a digitális etnográfia módszertanát, konkrét példák elemzésén keresztül bemutatom, hogy hogyan működik a booktuber kultúra a magyar nyelv területén, és mik annak sajátosságai. A kutatás fő célja egy tipológa felállítása, amely segít a booktube-jelenség leírásában és elemzésében. A kutatásom során azt vizsgálom, hogy hogyan viselkednek a kutatás során megfigyelt booktuberek, milyen tevékenységeket folytatnak csatornáikon. Az általam kiválasztott és vizsgált négy booktubert külön alfejezetek keretében fogom bemutatni, tevékenységüket elemezni. Hipotézisem az, hogy a BookTube ma már magyar nyelvterületen (Magyarországon és Erdélyben is) nagyban meghatározza az olvasási szokásokat, legfőképpen a fiatal felnőttek és tinédzserek körében.",
    "keywords": [],
    "generated_keywords": [
      "Amerikában",
      "BookTube",
      "Egyesült Királyságban",
      "booktube-jelenség"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "A Vibe fesztivál kommunikációja az új média felületeken",
    "students": [
      {
        "name": "Bakos Rolland",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Fülöp Otília",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "Dolgozatomban a Vibe fesztivál kommunikációs stratégiáját vizsgálom az új média platformokon, különös tekintettel a közösségi média szerepére. A kutatás célja, hogy feltérképezze, milyen eszközöket és milyen módon alkalmaznak a fesztivál szervezői a közönségükkel való kapcsolattartásra és az új közönség bevonására. A kutatás során tartalomelemzés módszerrel vizsgálom a Vibe- Facebook, Instagram- és Tiktok-felületein megjelenő tartalmakat, melynek eredményeit összevetem az elméleti háttér keretében bemutatott korábbi kutatások eredményeivel. A kutatás arra keresi a választ, hogy Erdély legnagyobb magyar zenei fesztiválja milyen módszereket és milyen rendszerességgel alkalmaz az online felületeken történő kommunikációjában. Magyar és külföldi szakirodalmi tételek megállapításait egyaránt figyelembe véve összesen hat hipotézist állítottam fel. Ezek a közösségimédia-posztok tartalmára és a kommunikációs stratégia időszakos változására is vonatkoznak. Ezen túlmenően, az évről évre egyre több látogatót bevonzó fesztivál esetében esedékessé válhat a nemzetközi, tehát nem magyar anyanyelvű közönség felé való nyitás. Ehhez viszont elengedhetetlen az angol nyelv használata a közösségi médiában. Ennek értelmében arra a döntésre jutottam, hogy dolgozatomban kitérek arra is, hogy a Vibe milyen nyelveken kommunikál az online felületein.",
    "keywords": [],
    "generated_keywords": [
      "Erdély",
      "Vibe",
      "Facebook"
    ]
  },
  {
    "major": "Kommunikáció",
    "year": 2025,
    "title": "Sportfogadás a digitális térben",
    "students": [
      {
        "name": "Fülöp Szilárd",
        "major": "Sapientia EMTE, Kommunikáció és közkapcsolatok szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Kovács Barna",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A digitális technológia és a mobilkommunikáció fejlődése drasztikusan átalakította a sportfogadási piacot. Az online platformok térnyerése és a mobilalkalmazások megjelenése nemcsak a fogadás gyakorlati aspektusait alakította át, hanem befolyásolta a kommunikációs és marketingstratégiákat is. Ahogy egyre mélyebben elmerültem ebben a témában, rájöttem, hogy ez nem csupán egy technológiai változásról szól, hanem arról is, hogy miként változtatja meg egy sport iránt érdeklődő személy életét és döntéseit egy ilyen dinamikusan fejlődő piac. Gyerekkorom óta foglalkoztatott a különböző sportágak felépítése, és hogy milyen befolyásoló tényezők mozgatják a szálakat egy sportesemény mögött. Míg korábban a sportfogadás egyszerű végeredmény tippelést jelentett számomra, az elmúlt néhány év során világossá vált, hogy a digitális technológia és a mobilkommunikáció térnyerése teljesen új dimenziót adott ennek a területnek. Az online fogadási platformok, mobilalkalmazások és valós idejű fogadási lehetőségek mind hozzájárultak ahhoz, hogy a sportfogadás egyre népszerűbbé és elérhetőbbé váljon. Ugyanakkor ezek a változások olyan új kérdéseket is felvetnek, amelyek túlmutatnak a technológián, és mélyen érintik a társadalmat, különösen a fiatalabb generációk védelmét és a szerencsejáték-függőség kockázatait. A kutatásom célja, hogy megismerjem, miként változtatta meg a sportfogadási piac technológiai fejlődése a fogyasztói magatartást. Különösen izgalmasnak találom annak vizsgálatát, hogy a mobilkommunikáció és az online eszközök milyen szerepet játszanak a sportfogadás gyakorlatában. Ez a téma azért is fontos számomra, mert ez választ adhat arra a kérdésre, hogy a fiatalok milyen mértékű tudatossággal vesznek részt ebben a folyamatban. A kutatás során arra törekedtem, hogy közvetlenül és személyesen ismerhessem meg a résztvevők véleményét és tapasztalatait. Ennek érdekében a fókuszcsoportos interjút és a mélyinterjút választottam, amely lehetőséget ad arra, hogy a résztvevők őszintén és részletesen osszák meg gondolataikat. Ez a módszer betekintést enged a sportfogadási gyakorlat mélyebb megértésébe, különösen a digitális és mobiltechnológia kontextusában.",
    "keywords": [],
    "generated_keywords": []
  },
    {
    "major": "Neveléstudomány",
    "year": 2025,
    "title": "Algoritmusok új dimenziója: MI támogatású kereső- és rendezőalgoritmusok interaktív tanulása",
    "students": [
      {
        "name": "Vernes Dávid László",
        "major": "Sapientia EMTE, Számítástechnika szak, IV."
      }
    ],
    "teachers": [
      {
        "name": "Csaholczi Szabolcs",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      },
      {
        "name": "dr. Kátai Zoltán",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      }
    ],
    "content": "Napjainkban az informatika oktatása egyre nagyobb hangsúlyt kap, különösen a programozás és az algoritmusok megértésének a terén. Az algoritmusok oktatásának hatékonysága szempontjából kulcsfontosságú az elérhetőség, az interaktivitás és a vizuális megjelenítés. A hagyományos tanulási módszerek gyakran nem tudják kielégíteni a modern kor diákjainak igényeit, akik a digitális eszközökön keresztül gyors és intuitív módon szeretnének tanulni. A játékosított, interaktív tanulási formák motiváló hatással bírnak, ezért fontos, hogy a pedagógiai módszerek fejlődjenek az igényeknek megfelelően. Sokkal könnyebb a tanulás és megértés folyamata a diákok számár, ha egy jól strukturált, lépésről lépésre haladó interaktív módon közelítik meg az algoritmusok világát, ahol egyszerre több érzékszervre lehet hatást gyakorolni. A platform kialakításánál fontos tényezői a konstruktív pedagógiai módszerek és a digitális oktatás legújabb trendjei, mint az interaktivitás, gamifikáció, adaptív tanulás és a tanári kontroll és visszacsatolás. Az aktív tanulási folyamatok elősegítik a hosszú távú tudás megszerzését, míg a vizuális animációk és interaktív feladatok növelik a diákok motivációját. Az MI által generált statisztikák lehetőséget biztosítanak a differenciált oktatásra, de mindezek által pedagógus szerepe megmarad, biztosítva a tanulási folyamat minőségét. A fejlesztett oktatási platform React alapú webalkalmazás, amely kifejezetten kereső- és rendezőalgoritmusok tanulására szolgál. A rendszer fő funkciói közé tartoznak a leckék, amelyek biztosítják az elméleti alapot, amely szükséges lesz a platform további részében és az algoritmusok megértésében. Az animációk és a gyakorlás része hasonló, az animációk nyújtják a vizuális szemléltetést, míg a gyakorlás által a felhasználóknak lehetőségük van lépésről lépésre végigcsinálni egy rendezést és keresést vizuális és auditív visszajelzéssel. Végül a tesztek következnek, ahol a mesterséges intelligencia is jelen van, az MI generálja a teszteket és monitorizálja a felhasználók haladását, továbbá az osztályozás folyamatában is szerepet játszik, viszont a végső osztályzat a tanár kezében van.",
    "keywords": [],
    "generated_keywords": [
      "MI",
      "React"
    ]
  },
  {
    "major": "Neveléstudomány",
    "year": 2025,
    "title": "A testi higiéniára nevelő játékos pedagógiai módszerek",
    "students": [
      {
        "name": "Lovász Rebeka",
        "major": "Sapientia EMTE, Közegészségügyi szolgáltatások és politikák szak, I."
      }
    ],
    "teachers": [
      {
        "name": "dr. Sántha Ágnes-Rózsa",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A pedagógusokat és az egészségügyi szakembereket régóta foglalkoztatja a testi higiéniai nevelés sikeres módszertana. Ezen kutatás célja ötletgazdag megoldások javaslata a romániai oktatási rendszer számára a gyermekek hiányos higiéniai szokásainak javítására. Kutatási kérdésem arra irányul, hogy melyik pedagógiai módszer hatékonyabb a kisiskolások körében a helyes kézmosás tanításában: a kooperatív tanulás vagy a szerepjáték. A helyes kézmosási szokások kialakulása mellett vizsgálom a játékos nevelés sokszínű következményeit a társas kapcsolatokra nézve. Dolgozatom magyarázó jellegű, mivel a szakirodalom elemzése után didaktikai és módszertani fókusz használatával, a két módszerrel való oktatás hatékonyságát vizsgálja. A két módszerrel elért eredményeket összehasonlítom, hogy választ kapjak kutatási kérdésemre. Kutatásomtól a gyermekek kézmosási javulását és a higiéniai ismereteik bővülését remélem.",
    "keywords": [],
    "generated_keywords": [
      "játékos"
    ]
  },
  {
    "major": "Neveléstudomány",
    "year": 2025,
    "title": "Digitális avatárok a szaknyelvoktatásban: Romániai magyar diákok visszajelzése recap-videókra",
    "students": [
      {
        "name": "Szabó Nikoletta-Laura",
        "major": "Sapientia EMTE, Informatika szak, III."
      }
    ],
    "teachers": [
      {
        "name": "dr. Kátai Zoltán",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      }
    ],
    "content": "A Sapientia Erdélyi Magyar Tudományegyetem kiemelt figyelmet fordít az anyanyelvi oktatásra, ugyanakkor hangsúlyozza a többnyelvűség jelentőségét is: a hallgatóknak nemcsak anyanyelvükön, hanem románul és angolul is meg kell tanulniuk kommunikálni. Ez a nyelvi sokszínűség különösen fontos az olyan karrierutak esetén, ahol az angol nyelvtudás elengedhetetlen. Az intézmény célja, hogy hallgatóinak olyan nyelvi hátteret biztosítson, amely előnyt jelent számukra a nemzetközi és hazai munkaerőpiacon. A kutatásban végzett munkám során azt vizsgáltam, hogy a rövid, digitális videók milyen lehetőségeket kínálnak a többnyelvű oktatás támogatására. A projekt keretében mesterséges intelligencia segítségével három különböző videós összefoglaló készült az órai prezentációk alapján, román és angol nyelven. A videók különlegessége, hogy a tanár saját magát használta avatarként, így a személyes jelenlét érzete is megmaradt, miközben a tartalmat AI-generált narrációval és vizualitással támogattuk. A kész videókat a tanév végén vetítettük le a hallgatóknak, akik strukturált visszajelzést adtak azok hatékonyságáról. A hallgatói visszajelzések alapján a videók fogadtatása vegyes volt. A többség értékelte a rövid, figyelemfelkeltő formátumot, és praktikusnak találta az ilyen típusú összefoglalókat. Ugyanakkor többen hiányolták a mélyebb tartalmat, és hosszabb, részletesebb videókat igényeltek. A TikTok-szerű stílus egyes hallgatóknál elnyerte a tetszést, míg mások sztereotipikusnak és monoton szerkesztésűnek találták azt. A háttérzene és a hangminőség szintén megosztó véleményeket váltott ki; többen technikai javításokat javasoltak, ám ezekre a felvételek körülményei miatt korlátozott lehetőség volt. Összegzésként megállapítható, hogy a hallgatók nyitottak a digitális tananyag új formái iránt, ugyanakkor világos elvárásaik vannak a tartalom minőségével és mélységével kapcsolatban. A videók formátumát és stílusát a jövőben célszerű tovább finomítani annak érdekében, hogy még hatékonyabban támogassák a többnyelvű tanulást.",
    "keywords": [],
    "generated_keywords": [
      "TikTok",
      "anyanyelvi oktatás",
      "hallgatók"
    ]
  },
  {
    "major": "Neveléstudomány",
    "year": 2025,
    "title": "Tudnak a rókák tanítani? – Egy eredeti, érzelmi jelenséget bemutató mesekönyv eredményességének kutatása",
    "students": [
      {
        "name": "Kacsó Tamás",
        "major": "Sapientia EMTE, Mechatronika szak, IV"
      }
    ],
    "teachers": [
      {
        "name": "dr. Szentes Erzsébet",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Tanárkézpő Intézet"
      }
    ],
    "content": "Érzelmi intelligenciára (EQ) – a saját és mások érzelmeinek felismerésére, megnevezésére és megértésére – mindannyiunknak szükségünk van kapcsolatainkban és az érzelmi kihívások kezelésében. A mesék és a mesemondás jelentős szerepet játszanak az EQ fejlesztésében a gyerekeknél, és a „Halkaa o Tarkaa – Síró színek repedése” című mesekönyv éppen ezzel a céllal készült. Első olvasóitól pozitív visszajelzések érkeztek, jól fogadták a „boldogtalanság” témát, pontosabban azt az ötletet, hogy a karakterek mind problémákkal küzdenek, és a történet nem egy ideális mesevilágot mutat be. Átfogóbb, rendszerezhetőbb visszajelzések összegyűjtése érdekében egy kutatást végeztünk, melynek fő célja a mesekönyv alkalmazhatóságának és minőségének feltérképezése volt. Két csoportot céloztunk meg: a célközönséget (gyerekek 8-tól 16 éves korig) és a tanárképzős egyetemi hallgatókat, akik alkalmazni tudnák a könyvet tanítási célokra. A kutatás két részben, a gyerekeknek, illetve a hallgatóknak készített online kérdőív segítségével valósult meg, ami a történet alkalmazhatósága, minősége és élménye mellett rákérdezett a kitöltők személyes és érzelmi jellemzőire is, annak érdekében, hogy azokat összefüggésbe tudjuk hozni a véleményekkel, és további következtetéseket is levonhassunk. Az eredmények alapján bebizonyosodott, hogy a tanárképzős hallgatók alkalmasnak találják a könyvet tanítási célokra, a célközönségnek tetszett a történet és várják a folytatást, továbbá mindkét csoport elégedett volt a könyv minőségével.",
    "keywords": [],
    "generated_keywords": [
      "EQ"
    ]
  },
  {
    "major": "Neveléstudomány",
    "year": 2025,
    "title": "Tanulási stílusok találkoztatása: diákközpontú tudásmegosztás és AI-támogatás",
    "students": [
      {
        "name": "Babos Dávid",
        "major": "Sapientia EMTE, Számítástechnika szak, IV."
      },
      {
        "name": "Csizmadia László",
        "major": "Informatika szak II."
      },
      {
        "name": "Salat Tamás",
        "major": "Számítástechnika szak, II."
      }
    ],
    "teachers": [
      {
        "name": "dr. Kátai Zoltán",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      }
    ],
    "content": "A dolgozat célja egy olyan mini Moodle-szerű oktatási platform bemutatása, amely a hallgatók közösségi tanulását támogatja jegyzetmegosztás és mesterséges intelligenciára épülő interakció révén. A rendszer lehetővé teszi, hogy a diákok feltöltsék az előadások alapján készített jegyzeteiket, amelyek tükrözik a tanulói sokszínűséget – különösen a tanulási stílusok tekintetében. E jegyzetek minden hallgató számára elérhetőek, így a tanári magyarázatokat kiegészítő, alternatív nézőpontokhoz juthatnak hozzá. A platform része egy kontextusérzékeny AI-chatbot is, amely az éppen megnyitott jegyzet szellemében válaszol a hallgatói kérdésekre, ezzel egy sokarcú, privát segédtanár élményét nyújtva. A rendszer használhatóságát és elfogadottságát a TAM modell alapján gyűjtött hallgatói visszajelzések segítségével értékeltük, melyeket nyílt végű kérdésekkel is kiegészítettünk. Az eredmények ígéretesek, és számos továbbfejlesztési lehetőségre világítottak rá.",
    "keywords": [],
    "generated_keywords": []
  },
  {
    "major": "Neveléstudomány",
    "year": 2025,
    "title": "A vizsgáztatás játékosítása: Új módszer és eszköz a Legyen Ön is milliomos! TV-játék szellemében",
    "students": [
      {
        "name": "Nágó Dániel",
        "major": "Sapientia EMTE, Informatika szak, II., Szoftverfejlesztés I"
      },
      {
        "name": "Nágó Márk",
        "major": "Sapientia EMTE, Informatika szak, II., Szoftverfejlesztés I"
      }
    ],
    "teachers": [
      {
        "name": "dr. Kátai Zoltán",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
      }
    ],
    "content": "A dolgozat célja a vizsgáztatás játékosításának vizsgálata egy új módszer és egy ehhez fejlesztett webalapú eszköz bemutatásán keresztül. A kísérleti rendszerben a hallgatókat két csoportra osztottuk, akik egy kétszakaszos teszt során mérhették meg tudásukat. Az első szakasz egy hagyományos, 15 kérdésből álló feleletválasztós teszt volt, amelynek eredményei alapján kérdésenkénti nehézségi súlyozást végeztünk. A második szakaszban a csoportok egymás tesztsorát játszották végig a Legyen Ön is Milliomos! vetélkedő szabályai szerint, három segítség (felezés, közönség, telefon) használatával, növekvő nehézségű kérdéssorrenddel és két biztonsági küszöbbel. A végső jegy a két szakasz közül a kedvezőbb eredmény alapján került meghatározásra, így a játékosított forma csak javíthatta az eredményt. A módszer elfogadottságát és használhatóságát a TAM modell alapján gyűjtött hallgatói visszajelzésekkel értékeltük, kiegészítve nyílt végű kérdésekkel. Az eredmények biztatóak, és rávilágítottak több, a továbbfejlesztést segítő irányra.",
    "keywords": [],
    "generated_keywords": [
      "Legyen Ön is milliomos!",
      "TAM"
    ]
  }

]