[{
    "major": "Alkalmazott nyelvtudományok",
    "year": 2024,
    "title": "Attitudes regarding multilingualism and multiculturalism",
    "students": [
      {
        "name": "Vass Dalma",
        "major": "Sapientia EMTE, Marosvásárhelyi Kar, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Nyelvészeti Tanszék"
      }
    ],
    "content": "My paper explores the various questions and issues around the concept and understanding of societal and individual multilingualism and multiculturalism in the region of Transylvania, in a small town in Mureș county. The goal of my research is to explore how the community in which one is brought up, shapes one’s views on language, let it be their own or that of others. I focus on the attitudes of members defining themselves as belonging to the Hungarian community towards their own mother tongue and culture as well as the languages and cultures surrounding them. My analysis is based on a series of interviews conducted with members of the Hungarian community. In my paper, I aim to point out the underlying meanings and ideological patterns that can be recognized using the methods of critical discourse analysis, providing a starting point for a large-scale examination of the discussed issues.",
    "keywords": [
      "multiculturalism",
      "multilingualism",
      "discourse analysis",
      "mother tongue",
      "linguistic",
      "socialization"
    ],
        "generated_keywords": []
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2024,
    "title": "Sociolects in dubbing: the case of Black English",
    "students": [
      {
        "name": "Fazakas Szabolcs",
        "major": "Sapientia EMTE, Marosvásárhelyi Kar, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Nyelvészeti Tanszék"
      }
    ],
    "content": "My paper focuses on the issue of sociolects in audiovisual translation, more exactly on the dubbing of African American English Vernacular (AAEV) or Black English into Hungarian. I examine the show entitled The Boondocks, an American series, written by Aaron McGruder. In the theoretical part of my paper, I describe the history of Black English (AAEV or Ebonics), as well as its most important phonetic and grammatical features, including its relationship to slang. I discuss the problem of untranslatability and the issues of realia. I also present the brief history of Hungarian dubbing, and the dubbing team behind The Boondocks show. In my practical part, I provide a parallel analysis of excerpts from the The Boondocks series, comparing the English original with the Hungarian dubbing. This research aims to point out the cultural differences, phonetical differences, possible translation solutions and the difficulties of dubbing in light of the notion of untranslatability.",
    "keywords": [
      "Black English",
      "slang",
      "dubbing",
      "untranslatability",
      "realia"
    ],
    "generated_keywords": [
      "audiovisual translation",
      "The Boondocks",
      "African American Vernacular English"
    ]
  },
  {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2024,
    "title": "Korond község történeti helynevei",
    "students": [
      {
        "name": "Birtalan M.-Alexandra",
        "major": "Sapientia EMTE, Marosvásárhelyi Kar, Fordító és tolmács szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Fazakas Noémi",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Nyelvészeti Tanszék"
      }
    ],
    "content": "Az előadásom célja egy folyamatban lévő helynévkutatási munka bemutatása. A kutatást a Magyar Tudományos Akadémia által támogatott Magyar Nemzeti Helynévtár Program keretein belül végzem. Gyűjtőmunkám helyszínéül szülőfalumat, Korondot és a közigazgatásilag hozzá tartozó tanyatelepüléseket választottam. A gyűjtés és a feldolgozás során felhasználom a már hozzáférhető történeti forrásokat, falumonográfiákat, valamint az általam végzett élőnyelvi gyűjtésből származó adatokat. Az adatok a székely nyelvjárás, azon belül is az udvarhelyszéki nyelvjáráscsoport sajátosságait, ugyanakkor Korond mára már jobbára ismeretlen történetének részleteit is őrzik.",
    "keywords": [
      "helynévkutatás",
      "Magyar Nemzeti Helynévtár Program",
      "Korond",
      "Udvarhelyszék"
    ],
    "generated_keywords": [
      "nyelvjáráskutatás",
      "történeti helynevek",
      "élőnyelvi adatgyűjtés"
    ]
  },
    {
    "major": "Alkalmazott nyelvtudományok",
    "year": 2024,
    "title": "The Language of Crime-fighting: The Case of \"Blindspot\"",
    "students": [
      {
        "name": "Májai Áron-Vazul",
        "major": "Sapientia EMTE, Marosvásárhelyi Kar, Fordító és tolmács szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Imre Attila",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Nyelvészeti Tanszék"
      }
    ],
    "content": "Crime TV shows play an important role in popular culture, as evidenced by the countless productions and their global widespread. ...",
    "keywords": [
      "crime",
      "TV",
      "forensic science",
      "criminalistics",
      "law",
      "acronym",
      "AVT"
    ],
    "generated_keywords": [
      "crime series translation",
      "audiovisual language",
      "forensic terminology"
    ]
  },
  {
    "major": "Kommunikáció és közkapcsolat",
    "year": 2024,
    "title": "Felhasználói élmény a Duolingo alkalmazásban",
    "students": [
      {
        "name": "Pécsi Blanka",
        "major": "Sapientia EMTE, Marosvásárhelyi Kar, Kommunikáció és közkapcsolat szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Kovács Barna",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományi Tanszék"
      }
    ],
    "content": "Dolgozatom témája a Duolingo alkalmazás, amely sokféle lehetőséget kínál a felhasználóknak, alkalmazkodva az igényekhez ...",
    "keywords": [
      "gamifikáció",
      "felhasználói élmény",
      "Duolingo"
    ],
    "generated_keywords": [
      "language learning app",
      "UX research",
      "mobile education"
    ]
  },
  {
    "major": "Közegészségügyi szolgáltatások és politikák",
    "year": 2024,
    "title": "HPV-fertőzéssel kapcsolatos ismeretek a méhnyakrákszűrésre jelentkezett nők körében Románia központi régiójában",
    "students": [
      {
        "name": "Hella Anita",
        "major": "Sapientia EMTE, Marosvásárhelyi Kar, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Sántha Ágnes",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "Bevezetés: A méhnyakrák világszerte a nőket érintő egyik leggyakoribb rosszindulatú daganatos betegség, ...",
    "keywords": [
      "méhnyakrák",
      "HPV",
      "egészségtudatosság",
      "prevenció"
    ],
    "generated_keywords": [
      "public health screening",
      "women's health",
      "HPV awareness"
    ]
  },
    {
    "major": "Közegészségügyi szolgáltatások és politikák",
    "year": 2024,
    "title": "Az egészségügyi szakemberek körében bekövetkező körkörös vándorlás",
    "students": [
      {
        "name": "Szép Anita",
        "major": "Sapientia EMTE, Marosvásárhelyi Kar, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Tóth-Batizán Emese-Emőke",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "Romániában dolgozó egészségügyi szakemberek számára a külföldi munka vonzó lehetőségeket kínál magasabb fizetés és fejlettebb karrierlehetőségek formájában...",
    "keywords": [
      "egészségügy",
      "migráció",
      "körkörös vándorlás"
    ],
    "generated_keywords": [
      "egészségügyi mobilitás",
      "hazatérési motiváció",
      "szakpolitikai kihívások"
    ]
  },
  {
    "major": "Közegészségügyi szolgáltatások és politikák",
    "year": 2024,
    "title": "Fiatal felnőttek mentális és fizikai jóléte, akiknek szülei hosszabb ideig külföldön dolgoztak",
    "students": [
      {
        "name": "Baló Andrea",
        "major": "Sapientia EMTE, Marosvásárhelyi Kar, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Lukács-Márton Réka",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "Bevezetés: Romániában jelen van a munkahelyi migráció, hiszen sok ember számára kifizetődőbb a külföldi munkavállalás...",
    "keywords": [
      "migráció",
      "külföldi munkavállalás",
      "hátrahagyott gyerekek",
      "mentális jólét",
      "fizikai jólét"
    ],
    "generated_keywords": [
      "szülői távollét hatása",
      "ifjúsági reziliencia",
      "családi migrációs dinamika"
    ]
  },
  {
    "major": "Közegészségügyi szolgáltatások és politikák",
    "year": 2024,
    "title": "A szemészeti betegségek előfordulása és kockázati tényezői Romániában",
    "students": [
      {
        "name": "Gálfi Zsolt",
        "major": "Sapientia EMTE, Marosvásárhelyi Kar, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Sántha Ágnes",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "Egy olyan világban, amely a látás képességére épül, legdominánsabb érzékszervünk mindegyik közül a látás...",
    "keywords": [
      "szemészet",
      "szociológia",
      "látásvesztés",
      "egészségi kockázatok"
    ],
    "generated_keywords": [
      "szemészeti statisztikák",
      "romániai egészségügy",
      "látásvesztés társadalmi hatása"
    ]
  },
    {
    "major": "Közegészségügyi szolgáltatások és politikák",
    "year": 2024,
    "title": "Hargita megyei egészségügyi helyzetkép",
    "students": [
      {
        "name": "Darvas Apollónia",
        "major": "Sapientia EMTE, Marosvásárhelyi Kar, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Sántha Ágnes",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "A világ népességének elöregedése jelentős kihívások elé állítja a társadalmat. Hargita megyében különféle egészségügyi kihívások merülnek fel. A kutatásom célja az egészségmegőrzés, krónikus és fertőző betegségek, valamint életmódbeli tényezők (táplálkozás, fizikai aktivitás) vizsgálata. A statisztikai adatok a Hargita Megyei Egészségügyi Igazgatóságtól származnak. Az elemzés alapján a krónikus betegségek növekvő trendje, a légzőszervi és emésztőrendszeri megbetegedések alakulása, valamint a daganatok előfordulásának emelkedése figyelhető meg.",
    "keywords": [],
    "generated_keywords": [
      "Hargita megye",
      "krónikus betegségek",
      "egészségügyi statisztika"
    ]
  },
  {
    "major": "Egészségtudomány / Védőnő szak",
    "year": 2024,
    "title": "Érzékenyítő jó gyakorlat hatásának mérése egészségügyi és szociális ágazati képzésben résztvevő tanulók körében",
    "students": [
      {
        "name": "Horváth Réka",
        "major": "Debreceni Egyetem, Egészségtudományi Kar, Védőnő szak, 4. év"
      }
    ],
    "teachers": [
      {
        "name": "Pázmány Viktória",
        "university": "Debreceni Egyetem, Egészségtudományi Kar, Védőnői Módszertani és Népegészségtani Tanszék"
      }
    ],
    "content": "Az értelmi fogyatékossággal élők társadalmi befogadása kihívást jelent. Az érzékenyítő program célja a középiskolás fiatalok attitűdváltozásának vizsgálata a Speciális Olimpia „Szállj be te is!” programján keresztül. A vizsgálat kérdőíves módszerrel történt közvetlenül a program előtt és után. Az eredmények azt mutatják, hogy a személyes tapasztalat pozitív irányban befolyásolja a fiatalok hozzáállását.",
    "keywords": [],
    "generated_keywords": [
      "érzékenyítés",
      "attitűdvizsgálat",
      "fogyatékosság elfogadása"
    ]
  },
  {
    "major": "Közegészségügyi szolgáltatások és politikák",
    "year": 2024,
    "title": "Idegenvezetők Székelyföld gyógyturizmus imázsa",
    "students": [
      {
        "name": "Pito Márta",
        "major": "Sapientia EMTE, Marosvásárhelyi Kar, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Tóth-Batizán Emese-Emőke",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "Székelyföld természeti és kulturális kincsei gyógyturisztikai vonzerőt képviselnek. A kutatás célja a térség gyógyturizmusának megértése és fejlesztési lehetőségeinek feltérképezése idegenvezetők és turisták véleménye alapján. A dolgozat célja továbbá az idegenvezetők munkájának elismertségét növelni és a turisztikai kínálat bővítését elősegíteni.",
    "keywords": [],
    "generated_keywords": [
      "gyógyturizmus",
      "Székelyföld",
      "idegenvezetők szerepe"
    ]
  },
    {
    "major": "Közegészségügyi szolgáltatások és politikák",
    "year": 2024,
    "title": "Időskori marginalizáció",
    "students": [
      {
        "name": "Varga Viola",
        "major": "Sapientia EMTE, Marosvásárhelyi Kar, Közegészségügyi szolgáltatások és politikák szak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Sántha Ágnes",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "Szerző neve, képzési helye: Varga Viola, Sapientia Erdélyi Magyar Tudományegyetem Marosvásárhelyi Kar\nTémavezető neve, munkahelye: Dr. Sántha Ágnes, Sapientia Erdélyi Magyar Tudományegyetem Marosvásárhelyi Kar, egyetemi docens\nBevezetés: Az időskorral együtt jár a visszavonulás, elcsendesülés. A legtöbb esetben az idősek teljesen a társadalom peremére szorulnak és elvesztik a külvilággal a kapcsolatot, elmagányosodnak. A család jelenti számukra a biztos pontot, a gyerekeik és unokáik jelenléte a legfontosabb az életükben. Sokakat a gyermekeik gondoznak, amikor már nem tudnak magukról gondoskodni, másokat pedig idősotthoni ellátásba helyeznek.\nCélok, hipotézisek: Elsősorban idősotthonban szeretnék hipotéziseimhez információkat gyűjteni, majd otthon élő időseket is meglátogatnék és feltenném nekik kérdéseimet. A két különböző csoporttól kapott információt összehasonlítanám egymással. Mennyire magányosak az idősek az idősotthonban és saját otthonukban? Mennyire érzik otthonuknak az idősotthont az ott élők? Milyen az életminőségük? (mindkét esetben) Milyen mértékben megy végbe szocializáció az intézmény tagjainak életében, hát az otthon élő idősek esetében? Milyen tevékenységekben vesznek részt? (mindkét esetben) Milyen a viszonyuk ápolóikkal? Milyen gyakran találkoznak családtagjaikkal? (mindkét esetben)\nValóban elszigeteltek és elmagányosodottak az idősek a mai társadalomban?\nMódszerek: Interjú készítése az otthonban élő idősekkel, illetve otthon élő idősekkel.",
    "keywords": [],
    "generated_keywords": [
      "idősellátás összehasonlítása",
      "társadalmi elszigeteltség",
      "interjús kutatás"
    ]
  },
  {
    "major": "Egészségügyi Gondozás és Prevenció",
    "year": 2024,
    "title": "Reziliencia mértékének vizsgálata védőnők körében Magyarországon",
    "students": [
      {
        "name": "Fagyas Natália",
        "major": "Debreceni Egyetem Egészségtudományi Kar, Egészségügyi Gondozás és Prevenció alapszak, 2. év"
      }
    ],
    "teachers": [
      {
        "name": "Barabás Ágota",
        "university": "Debreceni Egyetem, Egészségtudományi Kar, Védőnői Módszertani és Népegészségtani Tanszék"
      }
    ],
    "content": "A mentális egészség központi szerepet játszik a nemzetek emberi, társadalmi, valamint gazdasági tőkéjében. Bár a stressz magas szinten van jelen a segítő tevékenységek végzése során, a valahová tartozás és a közösségek szerepe bizonyítottan képes általános biztonságérzetet nyújtani a lelkiállapot tekintetében. A reziliencia védőfaktorként magában foglalja azokat a személyiségjellemzőket, melyek veszélyeztetett körülmények mellett elősegítik a sikeres alkalmazkodást, az adaptív megküzdést, ezáltal csökkentve a stressz negatív hatásait.\nJelen tanulmány célja felmérni hazánkban a védőnői hivatást folytató szakemberek rezilienciáját, és az azt befolyásoló háttértényezőket. Az adatfelvétel kérdőíves módszerrel, papír-ceruza alapon történt. A válaszadók (N=152) mindannyian védőnői végzettséggel rendelkező nők, legmagasabb arányban (56,58%) 40-59 éves életkorúak, és többségük (34,21%) több mint 25 éve dolgozik védőnőként. Az adatfeldolgozás során az általunk relevánsnak tartott változók gyakorisági értékeit elemeztük, majd kereszttábla elemzést követően a csoportok közötti eltéréseket Khi- négyzet próbával teszteltük, 5%-os szignifikancia szinttel dolgozva.\nAz eredmények alapján megállapítható, hogy az általunk megkérdezett szakemberek reziliencia átlaga 31,6 pont. Medián értéke 32,00, a módusz 30, a szórás 4,91. Medián értéket ért el, tehát reziliens a védőnők 52,6%-a. Medián érték alatti kategóriába a válaszadók 47,4%-a tartozik. Szignifikánsan magasabb arányban érzik a reziliens csoportba tartozó személyek úgy, hogy életükben több az öröm, mint a bánat (p <0,001), mint a medián érték alatti reziliencia szinttel rendelkezők. A fentiek alapján javasolt stresszoldó, reziliencia fejlesztő programok kidolgozása a szakemberek számára, melyek fejleszthetik a jóllét kialakítása iránti igényüket.",
    "keywords": [
      "védőnő",
      "segítő hivatás",
      "stressz",
      "reziliencia"
    ],
    "generated_keywords": [
      "kérdőíves kutatás",
      "reziliencia statisztika",
      "mentálhigiéné"
    ]
  },
  {
    "major": "Közegészségügyi szolgáltatások és politikák",
    "year": 2024,
    "title": "Székelyföld mint egészségügyi fogadóhely",
    "students": [
      {
        "name": "Nagy Dalma",
        "major": "Sapientia EMTE, Marosvásárhelyi Kar, Közegészségügyi szolgáltatások és politikák szak, 3. év"
      }
    ],
    "teachers": [
      {
        "name": "Dr. Tóth-Batizán Emese-Emőke",
        "university": "Sapientia EMTE, Marosvásárhelyi Kar, Alkalmazott Társadalomtudományok Tanszék"
      }
    ],
    "content": "Célom egy új nézőpontból megközelíteni Székelyföldet, és felfedni annak potenciálját mint egészségügyi fogadóhely. Interjúkat készítettem különböző Székelyföldön élő emberrel, akinek köze van a turizmushoz. Fel szeretném fedni, hogy Székelyföld nemcsak gyönyörű tájakkal és kulturális örökséggel rendelkezik, hanem jelentős potenciállal is bír egészségügyi fogadóhelyként.",
    "keywords": [],
    "generated_keywords": [
      "egészségturizmus interjúk",
      "regionális egészségügyi fejlődés",
      "Székelyföld imázs"
    ]
  },
  {
  "major": "Közegészségügyi szolgáltatások és politikák",
  "year": 2024,
  "title": "Várandósok táplálkozási szokásainak és az azt befolyásoló tényezőinek felmérése",
  "students": [
    {
      "name": "Kiss Orsolya",
      "major": "Debreceni Egyetem, Egészségtudományi Kar, Egészségügyi tanár szak, 2. év"
    }
  ],
  "teachers": [
    {
      "name": "Jávorné Dr. Erdei Renáta",
      "university": "Debreceni Egyetem, Egészségtudományi Kar, Védőnői Módszertani és Prevenciós Tanszék"
    }
  ],
  "content": "Napjainkban az egészséges életmód azon belül is a megfelelő táplálkozás egyre nagyobb hangsúlyt és odafigyelést kap mindennapjaink során, hiszen bizonyított, hogy az egészségünk megőrzésben az egyik legfontosabb tényező̋ az életmód.2019-ben Magyarországon az életmódtényezők közül a táplálkozással összefüggő kockázati tényezők a halálozások megközelítőleg feléért voltak felelősek, mely több, mint kétszer magasabb az uniós 17%-os átlagtól. A várandós nők egészségi állapota kiemelt odafigyelést igényel. A Barker elmélet szerint az anya életmódja nagyban összefügg a koraszülések számával és a magzat intrauterin fejlődésével. Az anya helytelen életmódjának következtében gyakoribb a kissúlyú újszülöttek (2500 gramm alatt) születése. A KSH adatok szerint ugyan a 90-es évek óta a kis súllyal született újszülöttek száma csökkent, még mindig jelentős mértékű. A várandósság kialakulhatnak olyan rendellenességek, melyek hátterében állhat az egészségtelen táplálkozás. Ha a várandós szervezetében nem találhatóak meg a károsodás kivédésére szolgáló nyomelemek és vitaminok, probléma léphet fel. Kutatásunk célja volt, feltérképezni, hogy a várandósok mennyire ismerik és tartják be a táplálkozási ajánlásokat Magyarországon, továbbá, hogy milyen tényezők befolyásolják táplálkozási szokásaikat. A kutatás során kvalitatív, prospektív kutatási módszert választottunk, a kérdőív maga papíralapú és önkitöltős volt. A kitöltés anonim módon történt, a kutatásban részt vett személyek nem visszaazonosíthatóak. Kutatás területileg 7 megyében zajlott, de országos lefedést tudott elérni azáltal, hogy hazánk négy szülészeti ellátást biztosító klinikáján is kitöltötték, ebben az intézményekben így olyan várandósokhoz is eljutott a kérdőív, akik lakóhely tekintetében más megyében élnek, és nem a területileg illetékes kórházban vették igénybe az ellátást. Összesen 2000 db kérdőív került kiküldésre, ebből 1655 db értékelhető kérdőívet kaptunk vissza. A kitöltők közül 847-en (51,2%) 30-39 éves korcsoportba estek, 654 fő (39,5%) 18-29 éves csoportba helyezte magát, 102 (6,2%) várandós 40 éve kor felett volt, a mintának legkevesebb számát a 18 éves kor alattiak tették ki, összesen 52 fő volt (3,1%). 639 nőnek ez volt az első várandóssága (38,6%), második gyermekét várta 509 fő (30,8%), harmadik terhessége 282 főnek volt (17,1%), negyedik terhességet 144 fő (8,7%) írta, ötödik vagy annál több terhessége 80 főnek volt, ami az egész mintának a 4,8 %. Az előbb bemutatott mintának a válaszaiból megtudtuk, hogy az 1655 várandósból 633 naponta ötször étkeznek, ami a kitöltőknek 38,2%-át tette ki, 465 kitöltő naponta négyszer étkezik, ami 28 %, 24,2 %, azaz 401 fő válaszolta azt, hogy naponta háromszor étkezik. Kevesen voltak azon válaszadók, akik naponta csak kétszer étkeznek, összesen 34-en, az egésznek csak 2,05%-a. Naponta egyszer csak 2 válaszadó, 0,2%-a választotta. A kitöltők közül 1132 fő (68,4 %) várandós nem tart semmilyen diétát. Gyümölcsöt 1038 fő (62,7%) fogyaszt naponta 1-2 alkalommal, 234 fő (14,2%) azt válaszolta, hogy egyáltalán nem fogyaszt gyümölcsöt. A zöldség fogyasztás hasonlóképpen alakult, naponta 1- 2 alkalommal 1057 (63,9%) fő fogyaszt, 184 fő (11,1 %) egyáltalán nem fogyaszt zöldséget. Gyorsétteremben hetente maximum egyszer 807 fő (48,0%) étkezik, 579 fő (35%) egyáltalán nem étkezik ilyen helyeken. A kapott eredmények alapján azt lehet mondani, hogy a várandósok többsége az ajánlásoknak megfelelően igyekeznek minél egészségesebben étkezzenek, emiatt célszerű a fejlesztő programokon leginkább a meglévő ismeretek elmélyítése, és az ajánlások fontosságának hangsúlyozása.",
  "keywords": [],
  "generated_keywords": [
    "várandós táplálkozás",
    "kérdőíves kutatás",
    "anyai egészség"
  ]
},
{
  "major": "Gépészmérnöki és Mechatronika",
  "year": 2024,
  "title": "Hőre lágyuló polimerek fröccsöntési üregnyomásának mérésére alkalmas berendezés tervezése",
  "students": [
    {
      "name": "Keresztes Kristóf",
      "major": "Sapientia EMTE, Marosvásárhelyi kar, Mechatronika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Gergely Attila Levente",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki Tanszék"
    }
  ],
  "content": "A dolgozat célja egy eszköz létrehozása, mely lehetővé teszi az üregnyomás mérését műanyag fröccsöntés közben. A tervezett berendezés a Sapientia EMTE, Marosvásárhelyi Karának Polimertechnológiai laboratórium eszközkészletét hivatott bővíteni. A tervezés során a fő hangsúly az egyszerű felhasználhatóságot biztosító kivitelezésre esett. A berendezés két erőmérő cellával, két HX711 erősítővel, egy ESP32 alapú fejlesztői lappal, illetve az ezekhez tartozó számítógépes felhasználói felülettel lett megvalósítva. A felhasználói felület a National Instruments LabVIEW programjával lett elkészítve, majd egy különálló alkalmazásként véglegesítve. A tervezési lépések során figyelem fordult a berendezés gyakorlati alkalmazhatóságára is.",
  "keywords": [
    "fröccsöntés",
    "mikrovezérlő",
    "üregnyomás",
    "LabVIEW",
    "erőmérő cella"
  ],
  "generated_keywords": [
    "műanyagipari mérés",
    "nyomásmonitorozás",
    "beágyazott rendszerek"
  ]
},
{
  "major": "Gépészmérnöki és Mechatronika",
  "year": 2024,
  "title": "A transztibiális futóprotézis additív gyártásának tanulmányozása",
  "students": [
    {
      "name": "Szőcs Krisztina",
      "major": "Sapientia EMTE, Marosvásárhelyi kar, Gépészmérnöki, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Egyed-Faluvégi Erzsébet",
      "university": "Sapientia EMTE, Marosvásárhelyi kar, Gépészmérnöki Tanszék"
    }
  ],
  "content": "Dolgozatomban a lábszári futóprotézisek additív gyártásának tanulmányozásával foglalkozom. A futóprotézisek készítése időigényes és nagy odafigyelést igénylő folyamat. Manapság az additív gyártás lehetőséget kínál arra, hogy jelentős gyártási idő, ár- és tömegcsökkentést érjünk el a protézisgyártás terén. A kutatás két fő résszel rendelkezik: tervezés és tesztelés. A tervezés a transztibiális futóprotézis AutoCAD Inventor programban való megtervezését foglalja magába. A következő fázis érdekében a modellt úgy kell létrehozni, hogy a belseje különböző, egy háromdimenziós nyomtató által létrehozható mintázatok szerint legyen kitöltve. Mivel a protézisnek nemcsak könnyűnek kell lennie, hanem teherbírónak bármely irányban, ezért a következő kitöltésekkel szeretnék kísérletezni: zig-zag, grid, triangles és tri-hexagon. A tesztelési fázisban a transztibiális futóprotézis modellt végeselem módszert használva szeretném megvizsgálni. Az elkészült modellt három különböző terhelésnek tesszük ki, így pontosabb képet kaphatunk a modell teherbíró képességéről és korlátairól. A modellben keletkező feszültségeket és elmozdulások mértékeit vizsgáljuk és értelmezzük. Amennyiben sikerül megállapítani, hogy melyik kitöltési tényezővel érhető el egy olyan futóprotézis, amely megfelelő teherbírással rendelkezik, anyagot és időt nyerhetnénk a jövőben ezeknek a termékeknek a gyártásánál, ugyanakkor még könnyebbé tehetnénk őket, amely által a művégtag viselete kényelmesebbé válhatna a futók számára.",
  "keywords": [
    "futóprotézis",
    "additív gyártás",
    "kitöltési minta",
    "végeselem módszer"
  ],
  "generated_keywords": [
    "3D nyomtatás biomechanikája",
    "protézistervezés",
    "strukturális optimalizáció"
  ]
},
{
  "major": "Gépészmérnöki és Mechatronika",
  "year": 2024,
  "title": "Lebegtető rendszerek intelligens szabályozása",
  "students": [
    {
      "name": "Czimbalmos Áron",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Mechatronika szak, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Márton Lőrinc",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "Napjainkban számos helyen találkozunk szabályozási rendszerekkel úgy az ipari megvalósításokban, mint a háztartási alkalmazások terén. A szabályozási rendszerek képesek a környezetétől információt felvenni és azt feldolgozva egy valós idejű reakciót nyújtani egy előírt feladat megvalósítása érdekében.\nIpari szempontból fontos technológia a légsugárral megvalósított lebegtetés. Segítségével megvalósítható a tárgyak érintésmentes mozgatása. Szabályozástechnikai szempontból a lebegtető rendszer pozíciószabályozása kihívást jelent, mivel a lebegtetést megvalósító levegősugár aerodinamikai jellemzői nehezen mérhetőek és modellezhetőek, bizonyos jellemzők időben változnak, és nagymértékben befolyásolják a szabályozás pontosságát.\nA dolgozatom célja, hogy korszerű szabályozási módszereket alkalmazva, olyan lebegtető rendszert valósítunk meg, amely az oktatás, az ipar és akár a gyógyászat területén is alkalmazható lesz az érintésmentes steril mozgatásokra, csökkentett súrlódási hatással.\nA munkám során megvalósítottam egy függőleges mozgatásra alkalmas lebegtető rendszert. Elkészítettem a lebegtető rendszer vezérléséhez szükséges hardver és szoftver elemeket. Olyan lebegtetésszabályozási eljárást dolgoztunk ki, amely intelligens szabályozási módszerek segítsével biztosítja a nagy pontosságú pozíciószabályozást, változó aerodinamikai feltételek mellett is. Mérésekkel igazoltam a rendszer alkalmazhatóságát.",
  "keywords": [],
  "generated_keywords": [
    "intelligens vezérlés",
    "érintésmentes mozgatás",
    "aerodinamikai modellezés"
  ]
},
{
  "major": "Gépészmérnöki és Mechatronika",
  "year": 2024,
  "title": "Lendkerék által meghajtott egyensúlyozó kocka",
  "students": [
    {
      "name": "Kádár Alex-Jenő",
      "major": "Sapientia EMTE, Marosvásárhelyi kar, Mechatronika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Jakab-Farkas László",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki Tanszék"
    },
    {
      "name": "Dr. Márton Lőrinc",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "A dolgozat célja egy olyan kocka alakú eszköz létrehozása, mely képes önállóan egyensúlyozni egy élén. Az egyensúlyozáshoz szükséges nyomatékot egy lendkerék gyorsításával, illetve fékezésével érjük el. A lendkereket meghajtó motor szabályozásához mérjük a kocka orientációját. A rendszer működési elve hasonló egyes műholdakban alkalmazott orientáció szabályozáshoz.\nA tervezés során fő szempont volt, hogy a kocka tömege és mérete minél kisebb legyen. Lendkerék gyanánt egy bicikli féktárcsát használtam, melynek meghajtása egy kefenélküli egyenáramú motorral történik. A vezérlőegység a dőlés szöget egy háromtengelyes gyorsulásmérő által szolgáltatott adatokból számolja ki. Ennek alapján egy szoftveresen megvalósított szabályozási algoritmus számolja ki a motor vezérlőjelét. A vezérlés egy ESP32 mikrovezérlőn van megvalósítva, aminek vezeték nélküli hálózaton keresztül utasításokat küld egy telefonos applikáció. Az aplikáción belül lehetőség van a szabályozó algoritmus paramétereinek megváltoztatására is. A rendszer áram ellátását egy lítium akkumulátor biztosítja.",
  "keywords": [],
  "generated_keywords": [
    "dinamikus egyensúlyozás",
    "ESP32 vezérlés",
    "lendkerék stabilizálás"
  ]
},
{
  "major": "Gépészmérnöki és Mechatronika",
  "year": 2024,
  "title": "Forgácsolási erőkomponensek mérése esztergáláskor",
  "students": [
    {
      "name": "Dávid Dénes",
      "major": "Sapientia EMTE, Marosvásárhelyi kar, Gépészmérnök, 4. év"
    },
    {
      "name": "Keresztes Kristóf",
      "major": "Sapientia EMTE, Marosvásárhelyi kar, Gépészmérnök, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Gergely Attila",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki Tanszék"
    }
  ],
  "content": "A dolgozat célja egy olyan berendezés tervezése és kivitelezése, amely képes a forgácsolási erő mindhárom komponensének szimultán mérésére esztergálási megmunkálás során. A forgácsolási erő ismerete elengedhetetlen a megmunkálási folyamatok optimalizálásához, illetve a forgácsolási szerszám tervezéséhez. A tervezett berendezés egy olyan laboratóriumi eszköz, amely segítségével a hallgatók megfigyelhetik a különböző forgácsolási parméterek hatását a forgácsolási erő komponenseire. A berendezés lehetőséget ad egy forgácsoló szerszám befogására, oly módon, hogy mindhárom irány menti elmozdulás lehetséges legyen a forgácsolás során. A három erőkomponenst három erőmérő cella hivatott mérni, melyek jeleinek feldolgozhatóságáért három darab HX-711 típusú erősítő felel, illetve egy ESP32 alapú mikrovezérlő. A felhasználó felület a National Instruments LabVIEW programjával készült el, mely segítségével vizualizálhatjuk és kimenthetjük a mért értékeket.",
  "keywords": [
    "esztergálás",
    "forgácsolási erő",
    "erőmérő cella",
    "tervezés",
    "megmunkálás"
  ],
  "generated_keywords": [
    "forgácsolástechnika",
    "mérőrendszer tervezés",
    "LabVIEW adatgyűjtés"
  ]
},
{
  "major": "Gépészmérnöki és Mechatronika",
  "year": 2024,
  "title": "Összecsukható mentős hordágy emelését segítő pneumatikus rendszer tervezése",
  "students": [
    {
      "name": "Dimény Zalán",
      "major": "Sapientia EMTE, Marosvásárhelyi kar, Mechatronika, 3. év"
    },
    {
      "name": "Tatár Norbert",
      "major": "Sapientia EMTE, Marosvásárhelyi kar, Mechatronika, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Forgó Zoltán",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki Tanszék"
    }
  ],
  "content": "A mentős szakma köztudottan jó fizikumot és kemény állóképességet igényel. A sok súly emelése és teherhordás eredményeként a mentősök jórésze sérülésekkel hagyja maga mögött a szakmát. Ennek a problémának a megoldásán szeretnénk segíteni. A mentősök a helyszínen a pácienseket egy összecsukható hordágyra helyezik, amit fizikai erőből kell a földről megemelni, amely eléggé megterhelő. Ez a folyamat elsősorban a derekat, valamint a hátat terheli, és hosszú távon sérvhez is vezethet. A legmegterhelőbb része a műveletnek az, hogy a földről nagyjából 30 centiméterre megemeljék a hordágyat. A dolgozatunk célja, hogy egy olyan kiegészítő rendszerrel szereljük fel a mentős hordágyakat, amely a mentősök helyett elvégzi az emelés első felét, a földtől 30 centiméterre, így ők csupán e felett kell saját erőből emelniük. Ezt úgy érjük el, hogy pneumatikus munkahengereket szerelünk az összecsukódó lábakhoz. Az ágyhoz rögzítünk egy tartályt, amelyben a munkahenger meghajtásához szükséges sűrített levegőt tároljuk. Ehhez szerelünk egy kis kompresszort a bármikori újra töltéshez. A projekteben ezt a rendszert modelleztük meg, és végeztük el a hozzá tartozó számításokat.",
  "keywords": [
    "hordágy",
    "mentőszolgálat",
    "pneumatika",
    "modellezés"
  ],
  "generated_keywords": [
    "ergonómiai fejlesztés",
    "pneumatikus emelőrendszer",
    "mentéstechnikai innováció"
  ]
},
{
  "major": "Gépészmérnöki és Mechatronika",
  "year": 2024,
  "title": "Evolvens fogaskerékpár csúszásának pontos modellezése",
  "students": [
    {
      "name": "Szőcs Krisztina",
      "major": "Sapientia EMTE, Marosvásárhelyi kar, Gépészmérnöki, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Máté Márton",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki Tanszék"
    }
  ],
  "content": "Az evolvens fogazatú fogaskerekek működésének egyik fő problémája az, hogy kapcsolódás során a fogprofilok csúszva gördülnek. A főpont a legördülő fogprofilok egyetlen olyan pontja, ahol tiszta gördülés valósul meg. A csúszás a terhelés ugrásszerű változásával, közösen okozzák a fogaskerekek tönkremenetelét és különböző meghibásodásait. Dolgozatomban a fogaskerekek viselkedését elméleti síkon tanulmányozom csúszás során. A csúszás leírására szolgáló, létező matematikai modelleket és azoknak az eredményeit vizsgálom, majd egy általam létrehozott, egzakt matematikai modellt vezetek fel. Az általam javasolt modell létrehozása során szempontjaim között szerepelt, hogy kerüljek bármely geometriai közelítést, és csak azokat a profilpontokat vizsgáljam, ahol ténylegesen létrejöhet a kapcsolódás a fogaskerekek között. Tehát, a kapcsolódási pontokat a valós kapcsolódási szakaszon belül értelmezem. Célom, hogy egy olyan matematikai megoldást hozzak létre, amely egyformán alkalmazható elemi és általános fogazatú evolvens fogaskerékhajtásokra, és pontos, valósághű eredménnyel szolgál a fogaskerekek relatív csúszásának a leírására.",
  "keywords": [
    "fogaskerék",
    "csúszás",
    "egzakt módszer",
    "fogaskerekek kapcsolódása"
  ],
  "generated_keywords": [
    "evolvens fogazat",
    "relatív csúszásmodellezés",
    "matematikai mechanika"
  ]
},
{
  "major": "Gépészmérnöki és Mechatronika",
  "year": 2024,
  "title": "Mikrokontroller alapú otthonbiztonsági riasztórendszer tervezése és megvalósítása",
  "students": [
    {
      "name": "Siesz Timea Szabina",
      "major": "Sapientia EMTE, Marosvásárhelyi kar, Mechatronika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Bakó László",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "Az ember életében a biztonság kiemelkedő fontossággal bír már az őskortól fogva. Az időjárási viszontagságoknak kitett ősember menedéket keresett, a tűz felfedezése lehetővé tette számára a hideg elleni védekezést és az állatok távoltartását. A történelem során a városok falakkal védték magukat, míg a modern korban mérnöki fejlesztésű biztonsági rendszerek gondoskodnak családtagjaink és vagyonunk védelméről. Ezek a rendszerek érzékelik a jogosulatlan behatolást és széles választékban elérhetőek a mai technológia segítségével, bár áruk magas és működésük hibákat mutathat. A dolgozat bemutatja a biztonságtechnikai rendszerek fejlesztésének és szimulációjának módszereit, valamint néhány mögöttes technológiát. Az elméleti részben részletesen tárgyaljuk a különféle szenzorok alkalmazását, beleértve azok előnyeit és hátrányait. Emellett bemutatásra kerül saját fejlesztésű riasztórendszerünk, melynek tervezése és működése részletesen elemzésre kerül a dolgozatban. A biztonságtechnikai rendszerek fejlesztése során kiemelt figyelmet szentelünk a modern technológiai eszközöknek és módszereknek, beleértve az adatfeldolgozást és az automatizációt. A dolgozat részletezi az alkalmazott módszereket és eszközöket, valamint áttekintést ad a fejlesztés folyamatáról és eredményeiről. A dolgozat célja, hogy megvilágítsa azokat az innovációs lehetőségeket, amelyek révén a biztonságtechnikai rendszerek hatékonyabbá és könnyebben hozzáférhetővé válhatnak mindennapi felhasználás szempontjából.",
  "keywords": [],
  "generated_keywords": [
    "mikrokontroller",
    "otthonbiztonság",
    "riasztórendszer",
    "szenzorok",
    "automatizálás"
  ]
},
{
  "major": "Gépészmérnöki és Mechatronika",
  "year": 2024,
  "title": "Mechatronikai elemekkel felszerelt lengőhimbás mechanizmus vizsgálata",
  "students": [
    {
      "name": "Dósa Balázs-Bencze",
      "major": "Sapientia EMTE, Marosvásárhelyi kar, Mechatronika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Egyed-Faluvégi Erzsébet",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki Tanszék"
    }
  ],
  "content": "Az ipar fejlődésével rengeteg szerszámgép jelent meg, összetettebb és bonyolultabb felépítéssel, mechanizmusokkal. A dolgozat célja a gyalugépben található kost mozgató mechanizmus ismertetése, tanulmányozása. Ez egy lengőhimbás mechanizmus, mely a szerszámtartó kosnak egy egyenes vonalú, váltakozó irányú vízszintes mozgást biztosít. Felépítése egyszerű, nagy előnye, hogy nincs szükség irányváltóra. A tervezett mechanizmus additív gyártással valósult meg. A mechanizmus mozgatását egy NEMA 17-es léptetőmotor biztosítja egy Arduino Nano mikrovezérlőn keresztül. Az elmozdulás mérésére egy VL53L0X lézeres távolságérzékelőt használtam. A mért adatokat grafikonon ábrázolom.",
  "keywords": [
    "lengőhimbás mechanizmus",
    "egyenes vonalú mozgás",
    "léptetőmotor",
    "lézeres távolságérzékelő"
  ],
  "generated_keywords": [
    "Arduino Nano",
    "additív gyártás",
    "VL53L0X",
    "NEMA 17",
    "mechatronikai mechanizmus"
  ]
},
{
  "major": "Gépészmérnöki és Mechatronika",
  "year": 2024,
  "title": "Tűzvédelmi stand tervezése",
  "students": [
    {
      "name": "Fazakas József",
      "major": "Sapientia EMTE, Marosvásárhelyi kar, Mechatronika, 4+ év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Pásztor Judit",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki Tanszék"
    }
  ],
  "content": "A dolgozatban a hő és füst terjedését vizsgálom zárt térben, talajszint alatti helységekben, és azok lejáratánál. Az ehhez szükséges szimulációs standot megtervezem és elkészítem. A dolgozat első része tartalmazza az elméleti hátterét a tűz keletkezésének, és azon tényezők összességét, amelyek táplálhatják vagy megakadályozzák a tűz tovább terjedését. Néhány megrázó tűzesetet is felsorolok. Kitérek azon tűzesetek tragikus kimenetét okozó jelenségekre, hibákra. Az elméleti áttekintést követi a tűzvédelmi stand tervezése, majd a kivitelezés lépései. Megtervezem a szimulációs kísérletet is, amely segítségével az elméleti kutatásban leírtakat, gyakorlati mérések által is megpróbálom alátámasztani, igazolni.",
  "keywords": [
    "tűzvédelmi stand",
    "hőterjedés",
    "füstterjedés",
    "szimuláció",
    "talajszint alatti helységek"
  ],
  "generated_keywords": [
    "tűzszimuláció",
    "tragikus tűzesetek",
    "biztonságtechnika",
    "tűzmegelőzés",
    "gyakorlati validáció"
  ]
},
{
  "major": "Gépészmérnöki és Mechatronika",
  "year": 2024,
  "title": "PVD-porlasztókamra takaróernyőit mozgató rendszer fejlesztése",
  "students": [
    {
      "name": "Sebő Zsolt",
      "major": "Sapientia EMTE, Marosvásárhelyi kar, Mechatronika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Máté Márton",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki Tanszék"
    },
    {
      "name": "Dr. Jakab-Farkas László",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki Tanszék"
    }
  ],
  "content": "A dolgozat célja egy olyan automatizált rendszer bemutatása, amely megvalósítja a PVD-porlasztókamra target-takaróernyőinek a mozgatását a kamra központi számítógépén tárolt vezérlőprogram segítségével. A tervezett rendszer a Sapientia Marosvásárhelyi karán lévő PVD-porlasztókamra bővítését szolgálja. A tervezés során fontos volt figyelembe venni az ajtók geometriai elhelyezkedését, hogy úgy tudjuk nyitni és zárni, hogy az ajtószárak mozgása akadálymentesen valósuljon meg. Ehhez szükséges volt mértanilag elemezni a mechanizmust. Továbbá a mechanizmusban keletkező erők meghatározása is szükséges, hogy tudni lehessen az ajtók mozgatásához kellő nyomatékot. Az ajtók mozgatását egy, pneumatikus munkahengerrel meghajtott, fogasléc-fogaskerék hajtás valósítja meg. A pneumatikus munkahenger vezérlését egy programozható logikai vezérlő (PLC) végzi. A tervezési folyamatot meghatározó egyik lényeges követelmény a rendszer moduláris szerkezete, annak érdekében, hogy könnyedén hozzá lehessen férni a porlasztó egységekhez.",
  "keywords": [
    "PVD-porlasztókamra",
    "geometria",
    "fogaskerék",
    "fogasléc",
    "munkahenger",
    "PLC-vezérlés"
  ],
  "generated_keywords": [
    "automatizált mozgatórendszer",
    "mechanikai tervezés",
    "moduláris szerkezet",
    "pneumatikus hajtás",
    "ipari vezérlés"
  ]
},
{
  "major": "Gépészmérnöki és Mechatronika",
  "year": 2024,
  "title": "Fogászati kompozitok polimerizációs zsugorodásának hatása a fogcsücskök elhajlására",
  "students": [
    {
      "name": "Kántor Éva-Andrea",
      "major": "Sapientia EMTE, Marosvásárhelyi kar, Mechatronika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Kántor József",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki Tanszék"
    },
    {
      "name": "Dr. Kerekes-Máthé Bernadette-Evelyn",
      "university": "Marosvásárhelyi Orvosi, Gyógyszerészeti, Tudomány és Technológiai Egyetem"
    },
    {
      "name": "Dr. Jakab-Farkas László",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki Tanszék"
    }
  ],
  "content": "A fogászati kompozitok számos előnyös tulajdonsággal rendelkeznek más tömőanyagokkal szemben, ebből kifolyólag gyakran használják őket oldalsó fogak restaurálásához. A kompozitok fontos jellemzője a polimerizációjukkor végbemenő zsugorodás, amely a tömésben és a fogszövetben megjelenő feszültségekhez vezethet. A zsugorodási feszültségek a fogzománc apró repedéseinek megjelenését, széli beszűrődés kialakulását, a fogcsücskök elmozdulását eredményezhetik. Kutatásom célja, hogy megvizsgáljam 2 fogászati kompozit polimerizációs zsugorodásának hatását a csücsök-elhajlásra. Alumíniumötvözet lemezből kialakított MOD kavitások (4mm x 4mm x 4mm) fogászati kompozittal lettek feltöltve. A kísérleti terv négy mintacsoportot tartalmazott a használt rétegzési technika (bulk, horizontális, ferde) és tömőanyag (Filtek Z550, Filtek One Bulk Fill) függvényében. A csücsök-elhajlás mértékének meghatározására DIC (Digital Image Correlation) technikával, illetve koordináta-mérőgép segítségével került sor. A DIC technikával vizsgált nagyfelbontású fényképek a tömés behelyezése előtt és 10 perccel utána készültek. A koordináta-mérőgéppel a kavitások külső falain tömés előtt és egy nappal tömés után készültek mérések. A mérési eredmények statisztikai analízise T-próba segítségével történt.",
  "keywords": [
    "fogászati kompozit",
    "polimerizációs zsugorodás",
    "csücsök-elhajlás",
    "DIC technika",
    "koordináta-mérőgép",
    "statikai analízis"
  ],
  "generated_keywords": [
    "MOD kavitás",
    "Filtek kompozitok",
    "rétegzési technikák",
    "mechanikai feszültség",
    "fogrestauráció vizsgálata"
  ]
},
{
  "major": "Gépészmérnöki és Mechatronika",
  "year": 2024,
  "title": "Koszinusz hajtópár kapcsolódásának vizsgálata Autodesk-Inventor környezetben",
  "students": [
    {
      "name": "Gál Károly-István",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Fejlett mechatronikai rendszerek MSc., 2. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Máté Márton",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki Tanszék"
    }
  ],
  "content": "A fogaskerekek kapcsolódása illetve csúszása fontos téma a gépgyártás világában. Amikor két fogaskerék kapcsolódik egymással, ideális esetben csak gördülnek egymáson, de a valóságban bizonyos mértékű csúszás is előfordul. Az evolvens fogaskerekek csúszása jelentős probléma, különösen akkor, ha nagy terhelésnek vannak kitéve vagy ha a tervezési vagy gyártási hibák miatt nem megfelelően illeszkednek egymáshoz. A csúszás negatívan befolyásolja a rendszer hatékonyságát és élettartamát. A csúszás miatt megnövekedik a súrlódás, ami hőt és kopást eredményez. A csúszás során zaj és rezgés képződik, ami további problémákat okozhat. A koszinusz fogaskerekek profilját koszinusz függvénnyel írjuk le, nagyobb merevséget biztosítva. Kis fogszám esetén nem jelentkezik alámetszés. Dolgozatunkban a koszinusz fogaskerekek kapcsolódását és csúszását tanulmányozzuk profileltolásos és anélküli esetekben. Mathcad-ben matematikai modellt készítünk, majd Autodesk-Inventorban .iam kiterjesztésű modellként megvalósítjuk a hajtást. Bár AutoLISP környezet hatékonyabb lenne, bonyolultsága miatt ezt nem használjuk. A hajtás létrehozása után méréseket végzünk, azokat a matematikai modellel összevetjük, és következtetéseket vonunk le.",
  "keywords": [
    "koszinusz fogaskerék",
    "fogaskerék kapcsolódás",
    "csúszás vizsgálat",
    "Autodesk Inventor",
    "Mathcad modell",
    "profileltolás",
    "gépelemek"
  ],
  "generated_keywords": [
    "fogaskerékpár szimuláció",
    "hajtómű modellezés",
    "csúszási jelenség",
    "Autodesk-AutoLISP",
    "mozgásanalízis"
  ]
},
{
  "major": "Hardverfejlesztések és beágyazott rendszerek",
  "year": 2024,
  "title": "Térbeli orientáció pontosságának javítása IMU-alapú szenzorfúzióval: Egy összehasonlító tanulmány a fúziós algoritmusokról",
  "students": [
    {
      "name": "Simon Hunor",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Automatika És Alkalmazott Informatika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Fehér Áron",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "A szenzorfúzió fontos szerepet játszik a térbeli pozíció és mozgás pontosságának javításában. A dolgozat három szenzor (gyorsulásmérő, giroszkóp, magnetométer) kombinációjával megvalósított IMU-alapú szenzorfúziót vizsgál. A fejlesztés során négy algoritmust hasonlítottak össze: kvaternión alapú becslés, komplementer szűrő, bővített Kálman-szűrő és Mahony szűrő. Ezek MATLAB környezetben kerültek fejlesztésre és tesztelésre, majd STM32 mikrovezérlőre implementálva valós környezetben is validálták őket. A cél az orientáció pontos meghatározása zajos szenzormérések ellenére.",
  "keywords": [
    "szenzorfúzió",
    "kvaterniók",
    "MATLAB",
    "STM32",
    "IMU"
  ],
  "generated_keywords": [
    "térbeli orientáció",
    "giroszkóp",
    "gyorsulásmérő",
    "magnetométer",
    "bővített Kálman-szűrő",
    "Mahony szűrő",
    "komplementer szűrő"
  ]
},
{
  "major": "Hardverfejlesztések és beágyazott rendszerek",
  "year": 2024,
  "title": "Intelligens tűzérzékelő biztonsági riasztórendszerhez",
  "students": [
    {
      "name": "Ráduly Botond",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Automatika És Alkalmazott Informatika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Lefkovits László",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "A dolgozat célja egy intelligens tűzérzékelő rendszer megalkotása, amely képes élő videófelvétel alapján, mesterséges intelligencia segítségével észlelni a tüzet. A rendszer központi eleme a YOLO (You Only Look Once) alapú gépi látási algoritmus, amelyet először laptopon, majd Raspberry Pi 4 Model B eszközre portolva teszteltek. A rendszerhez IP kamera csatlakozik, amely Etherneten keresztül továbbítja a képeket. A végső cél egy olyan autonóm biztonsági riasztórendszer kialakítása, amely megbízhatóan képes detektálni tüzet valós időben.",
  "keywords": [
    "tűzérzékelés",
    "Raspberry Pi",
    "Kamera",
    "mesterséges intelligencia",
    "rendszer"
  ],
  "generated_keywords": [
    "YOLO",
    "gépilátás",
    "biztonsági rendszer",
    "videó alapú tűzjelzés",
    "IP kamera",
    "valós idejű képfeldolgozás",
    "beágyazott rendszer"
  ]
},
{
  "major": "Hardverfejlesztések és beágyazott rendszerek",
  "year": 2024,
  "title": "3D nyomtatott kéz vezérlése EMG jelekkel és képfeldolgozással",
  "students": [
    {
      "name": "Magyar Roland István",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Számítástechnika szak, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Fehér Áron",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "A dolgozat célja egy 3D nyomtatott robotkéz vezérlésének bemutatása, amely két fő technológiát alkalmaz: EMG (elektromiográfiás) jelek és valós idejű képfeldolgozás. A robotkéz az emberi kéz mozgását utánozza egy kamera élő videóképe alapján, valamint EMG szenzorok segítségével nyert izommozgás információk alapján. A rendszer egy mikrovezérlővel (ESP32) működik, amely a jeleket feldolgozva motorokat vezérel, így mozgatva a kéz ujjait. A projekt tartalmaz egy 3D-nyomtatott mechanikai részt, EMG jelfeldolgozó áramkört és Pythonban írt képfeldolgozó programot.",
  "keywords": [
    "képfeldolgozás",
    "digitális jelfeldolgozás",
    "EMG",
    "Python",
    "ESP32"
  ],
  "generated_keywords": [
    "robotkar",
    "3D nyomtatás",
    "bionika",
    "izomjelek",
    "valós idejű vezérlés",
    "mesterséges végtag",
    "mikrovezérlő"
  ]
},
{
  "major": "Hardverfejlesztések és beágyazott rendszerek",
  "year": 2024,
  "title": "FIR és IIR szűrők hardveres megvalósítása és tesztelése SystemVerilogban fixpontos aritmetika és Cocotb felhasználásával",
  "students": [
    {
      "name": "Kovács Benedek",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Automatika és Alkalmazott Informatika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Fehér Áron",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "A dolgozat célja véges (FIR) és végtelen (IIR) impulzusválaszú digitális szűrők tervezése és implementálása SystemVerilog nyelven, fixpontos aritmetika alkalmazásával. A szűrők hardveres megvalósítása FPGA és ASIC célokra történik, a lebegőpontos aritmetikánál alacsonyabb erőforrás-igényű fixpontos ábrázolással. A fejlesztett szűrők funkcionalitásának verifikációjához Python nyelven, Cocotb tesztkeretrendszer segítségével készült egy tesztkörnyezet. Ez biztosítja a szűrők helyességének, teljesítményének és robusztusságának ellenőrzését különféle bemenetekkel.",
  "keywords": [
    "SystemVerilog",
    "fixpontos aritmetika",
    "Cocotb",
    "HDL",
    "FIR szűrők",
    "IIR szűrők"
  ],
  "generated_keywords": [
    "digitális szűrők",
    "FPGA",
    "ASIC",
    "verifikáció",
    "Python alapú tesztelés",
    "hardverleíró nyelv",
    "digitális jelfeldolgozás"
  ]
},
{
  "major": "Hardverfejlesztések és beágyazott rendszerek",
  "year": 2024,
  "title": "Levegőminőség mérése és modellezése",
  "students": [
    {
      "name": "Portik Tamás",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Automatika és Alkalmazott Informatika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Turós László-Zsolt",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    },
    {
      "name": "Dr. Brassai Sándor Tihamér",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "A dolgozat célja a levegőminőség mérésének és előrejelzésének megvalósítása ESP8266 mikrokontroller segítségével, amely SCD30 (CO₂) és MQ7 (CO) érzékelőkkel van felszerelve. Az érzékelők által mért adatokat valós időben InfluxDB adatbázisban tárolják, majd ezek alapján LSTM típusú visszatérő neurális hálózattal történik az előrejelzés. A rendszer képes pontos CO₂ és CO koncentrációk becslésére. A hosszú távú mérés során hardveres kihívások, például a szenzorok kalibrálása, jelentkeztek, melyeket új kalibrációs módszerrel kezeltek. A rendszer alkalmazható beltéri és kültéri levegőminőség monitorozásra is.",
  "keywords": [
    "levegőminőség",
    "SCD30",
    "MQ7",
    "ESP8266",
    "InfluxDB",
    "LSTM",
    "neurális hálózat",
    "gépi tanulás"
  ],
  "generated_keywords": [
    "idősoros adatok",
    "érzékelő kalibrálás",
    "CO₂",
    "CO",
    "valós idejű adatgyűjtés",
    "hardveres korlátok",
    "benti és kültéri környezet"
  ]
},
{
  "major": "Hardverfejlesztések és beágyazott rendszerek",
  "year": 2024,
  "title": "Quadruped mobilis robot mozgását megvalósító algoritmusok tervezése",
  "students": [
    {
      "name": "Csillag Alex",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Automatika és Alkalmazott Informatika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Márton Lőrinc",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "Napjainkban a négylábú mobilis robotok, vagy más néven quadruped robotok, egyre népszerűbbek és egyre nagyobb szerepet töltenek be. Az ilyen típusú robotok számos területen, mint például a mezőgazdaság, építőipar, katasztrófavédelem, egészségügy, valamint haztartasokban is alkalmazzák. A mobilis robotok olyan feladatok elvégzésére vannak tervezve, ahol helyváltoztatás is szükséges, azaz az adott feladat térbeli helyzete a robotra felszerelt szerszám (robotkar, amely manipulációs feladatok elvégzésére képes) munkateréből kívül esik. Azonban, hogy ezek a robotok hatékonyan és biztonságosan működjenek, számos komplexitással kell szembenézni a tervezés során. A quadruped robotok mobilitása kulcsfontosságú tényező, mivel ezeknek a gépeknek képesnek kell lenniük különböző tereptíıpusokon való mozgásra és akadályok áthidalására. A navigációs rendszerek kifejlesztése elengedhetetlen a robotok hatekony ´es pontos mozg´as´anak biztosításához, beleértve az akadály felismerést és kerülést is. Emellett a quadruped robotoknak dinamikusan kell alkalmazkodniuk a környezetükhöz és a változó terephez.\nDolgozatom fő célja egy ilyen quadruped robot mozgásának vizsgálata és elemzése. Ennek érdekében a robot szerkezetének és működésének ismertetésére kerül sor, belértve a mozgást megvalósító vezérlő algoritmusokat és a stabilitás vizsgálatát is. Ez az elemzés matematikai modellek illetve szimulációs módszerek segítségével történik. A quadruped robotok tervezése és fejlesztése a jövőben egyre fontosabbá válik az automatizáció és a robotika területén. Dolgozatom által nyújtott eredmények és megközelítések hozzájárulhatnak ezeknek a rendszereknek a hatékonyságának és funkcionalitásának növeléséhez, elősegítve ezzel a quadruped robotok széleskörű alkalmazását és elfogadását a mindennapi életben.",
  "keywords": [
    "quadruped robot",
    "mobilis robot",
    "navigációs rendszer",
    "akadályfelismerés",
    "mozgásalgoritmus",
    "matematikai modell",
    "szimuláció"
  ],
  "generated_keywords": [
    "négylábú robot",
    "akadálykerülés",
    "dinamikus alkalmazkodás",
    "terepviszonyok",
    "vezérlő algoritmusok",
    "robotkar",
    "stabilitásvizsgálat"
  ]
},
{
  "major": "Hardverfejlesztések és beágyazott rendszerek",
  "year": 2024,
  "title": "A mezőgazdasági gépek munkálat közbeni útvonalának monitorizálása",
  "students": [
    {
      "name": "Balazs Bálint-Bernárd",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Automatika és Alkalmazott Informatika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Márton Lőrinc",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    },
    {
      "name": "Dr. Fehér Áron",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "A dolgozatom célja egy olyan beágyazott eszköz fejlesztése, amely képes mezőgazdasági gépek munkálat közbeni útvonalának a monitorizálásársa. A munkám során olyan eszközt kívántam kifejleszteni, amit mezőgazdasági feladatok minőségét képes javítani, ellenőrizni.Az eszköz képes arra, hogy amikor a munkagép kimegy az adott parcellára és az üzemeltetője elindítja a rendszert, akkor rajzolja ki, hogy milyen utat tett meg a megmunkálás alatt, és ezt mentse el.A rendszer egy vezérlőből és és egy szoftverből tevődik össze.A hardver egy ESP32 mikrovezérlőből, egy hely- meghatározás (GPS) jeladóból, ami küldi a szélességi és hosszúsági koordinátákat és egy 9 tengelyes inerciális mérőegység (IMU) érzékelőből áll, ami érzékel XYZ tengely mentén mágnesességet, gyorsulást és giroszkóp értékeket.A bejövő adatokból a GYRO_Z-ből számolunk szögsebességet, ACCE_X és ACCEl_Y-ból számolunk gyorsulást, és MAG_X és MAG_Y-ból számolunk szögelfordulást.A szoftver a GPS hosszúsági, szélességi adatokból és az IMU értékekből a Kálmán szűrő segítségével megbecsüli a munkagép orientációját.A kifejlesztett szoftver képes a munkagép pozíciójának és orientációjának grafikus ábrázolására, így a mezőgazdasági feladat elvégzésének minősége könnyen ellenőrizhető.",
  "keywords": [
    "mezőgazdasági gép",
    "útvonal monitorozás",
    "ESP32",
    "GPS",
    "IMU",
    "Kálmán szűrő",
    "szögsebesség",
    "gyorsulás",
    "szögelfordulás",
    "pozíció ábrázolás"
  ],
  "generated_keywords": [
    "orientáció becslés",
    "grafikus megjelenítés",
    "munkagép nyomkövetés",
    "beágyazott rendszer",
    "adatfúzió",
    "szántóföldi munka követése",
    "művelési minőség ellenőrzése"
  ]
},
{
  "major": "Hardverfejlesztések és beágyazott rendszerek",
  "year": 2024,
  "title": "Kalickás indukciós motor szabályozási módszereinek tanulmányozása",
  "students": [
    {
      "name": "Bartha Tibor",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Automatika és Alkalmazott Informatika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Kutasi Dénes Nimród",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "A dolgozat az indukciós aszinkron gépek hatékony szabályozásának és modellezésének módszereit mutatja be. A bevezető részben áttekintésre kerül a villamos gépek osztályozása és az indukciós aszinkron gépek szabályozási elveit. Az elméleti megalapozás és szakirodalmi tanulmány rész részletesen ismerteti a matematikai modelleket és elméleti alapokat, hangsúlyt fektetve a skalár és vektor szabályzásra. Ennek keretein belül részletesen tárgyalja a koordináta transzformációkat. A szimulációs modellek fejezetben bemutatásra kerülnek a skalár, vektor és a közvetlen nyomatékszabályozás szimulációs modelljei MATLAB/Simulink környezetben. Ezután részletesen ismertetésre kerül a labor stand felépítése, üzembe helyezése és a kísérleti eredmények. Végül a dolgozat a rendszer felhasználási lehetőségeit, következtetéseit és továbbfejlesztési lehetőségeit részletezi. Célom a indukciós aszinkron gép hatékony szabályozásának és modellezésének bemutatása, valamint a gyakorlati alkalmazhatóság és a további kutatási lehetőségek feltárása. Az elméleti háttér, szimulációs modellek és kísérleti eredmények alapján a dolgozat hangsúlyozza a jelenlegi állapotot és a továbbfejlesztés irányait ezen a területen.",
  "keywords": [
    "kalickás indukciós motor",
    "szabályozás",
    "mezőorientált szabályozás",
    "közvetlen nyomatékszabályozás",
    "skalár hajtás"
  ],
  "generated_keywords": [
    "aszinkron gép",
    "vektor szabályzás",
    "koordináta transzformáció",
    "MATLAB/Simulink szimuláció",
    "laboratóriumi mérés",
    "hajtásrendszerek",
    "villamos gépek modellezése"
  ]
},
{
  "major": "Hardverfejlesztések és beágyazott rendszerek",
  "year": 2024,
  "title": "Képfeldolgozás alapú robotirányítási rendszer mozgó céltárgyakhoz",
  "students": [
    {
      "name": "Antal József",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Automatika és Alkalmazott Informatika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Márton Lőrinc",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "Az ipari és kollaboratív robotok fontos szerepet töltenek be az ipari környezetben, komplex gyártási folyamatokra alkalmazhatóak. Az ipari robotok általában nagy teljesítményű gépek, olyan területeken dolgoznak, ahol nincs közvetlen kapcsolatuk emberekkel, míg a kollaboratív robotok olyan területeken dolgoznak, ahol emberrel közvetlenül kell együttműködniük. Ezek a robotok gyakran elvégzik az automatizálható, ismétlődő feladatokat, lehetőséget teremtve az emberek számára a munkafolyamatok más területein való hatékonyabb részvételre. A munkám során egy olyan robotirányítási szoftvert fejlesztettem ki, amely képes leemelni mozgó futószalagról ismeretlen pozíciójú és orientációjú céltárgyakat. Az alkalmazott UR3as robotkar kiváló példája a kollaboratív robotoknak. A rendszer emellett egy kamerát és egy futószalagot is tartalmaz. A kamera és a futószalag segítségével a robotkar képes valós időben felügyelni és reagálni a mozgó tárgyakra, lehetővé téve azok gyors és pontos azonosítását. Az ARUCO markerrel ellátott tárgyak megbízható felismerése elengedhetetlen a robotkar irányításához. A feladatot Python környezetben implementált algoritmusok végzik el. A kutatás következő szakaszában részletesen vizsgáltam a tárgyak felismerésének pontosságát. A mérések során a tárgyakat mindig azonos pozícióba helyeztem a futószalagra, miközben a futószalag sebességét változtattam, hogy megfigyeljem a pontosság változását különböző sebességeken. Emellett elemeztem a kamera elhelyezésének hatását a tárgyak pozíciójának meghatározására. Különböző magasságokban vizsgáltam a pontosság és gyorsaság összefüggéseit a legjobb eredmények eléréséhez.",
  "keywords": [
    "UR",
    "ARUCO",
    "Python",
    "Helyzet meghatározás",
    "Képfeldolgozás"
  ],
  "generated_keywords": [
    "kollaboratív robot",
    "robotkar vezérlés",
    "futószalag",
    "valós idejű képfeldolgozás",
    "pozíció- és orientáció-meghatározás",
    "kamerás szenzor",
    "UR3",
    "ARUCO marker alapú detekció"
  ]
},
{
  "major": "Hardverfejlesztések és beágyazott rendszerek",
  "year": 2024,
  "title": "Fejlesztői környezet és In-Circuit Debugger tervezése és kivitelezése RISC processzorra",
  "students": [
    {
      "name": "Székely Áron",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Automatika és Alkalmazott Informatika, 2. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Bakó László",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "Modern elektronikai eszközök fejlesztésében szinte elkerülhetetlen a mikrovezérlők használata: általában olcsóbbak mint egy diszkrét elemekből összerakott áramkör és számtalan felbukkanó problémát meg lehet oldani szoftverfrissítésekkel. De ezekkel az előnyökkel jönnek hátrányok is: nehezebb átlátni a belső működésüket. Dolgozatom célja egy assembly fejlesztői környezet tervezése és kivitelezése egy meglévő RISC processzorhoz. A felület weben érhető el és standard webes technológiákat használ (HTML, Javascript, CSS), ez lehetővé teszi a felület használatát akármilyen webböngészővel rendelkező eszközön. A felület alkalmas firmware fejlesztésére, tesztelésére és exportálására VHDL állományként. A tesztelést lehet végezni egy virtuális IO egységekkel bővíthető szimulátorral vagy egy FPGA-n kialakított processzor és In-Circuit Debuggerrel. Mind a két tesztelési módszer során bármelyik pillanatban meg lehet szakítani a program futását (manuálisan vagy breakpontok alapján), lehet utasításonként lépni és meg lehet figyelni és módosítani a processzor belső állapotát.",
  "keywords": [
    "RISC",
    "In-Circuit Debugger",
    "assembly fejlesztői környezet",
    "webes fejlesztés",
    "HTML",
    "JavaScript",
    "VHDL",
    "FPGA",
    "szimulátor"
  ],
  "generated_keywords": [
    "mikrovezérlő programozás",
    "firmware fejlesztés",
    "processzor állapotfigyelés",
    "webalapú IDE",
    "debugger funkciók",
    "léptetés",
    "töréspontok kezelése",
    "virtuális IO egységek"
  ]
},
{
  "major": "Hardverfejlesztések és beágyazott rendszerek",
  "year": 2024,
  "title": "Nemlineáris tekercsek mérésére szolgáló készülék fejlesztése",
  "students": [
    {
      "name": "Csata László-Levente",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Automatika és Alkalmazott Informatika, 4. év"
    },
    {
      "name": "Sárkány Illés-Sámuel",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Automatika és Alkalmazott Informatika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Kelemen András",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "A nagyteljesítményű áramirányítókban alkalmazott nemlineáris tekercsek működési feltételei lényegesen eltérnek a szokványos laboratóriumi mérőműszerek által előállított mérési feltételektől. Ezért az ilyen tekercsek áramköri paramétereinek az ellenőrzése olyan speciális mérőáramkörök alkalmazását teszi szükségessé, amelyek képesek az áramirányítókra jellemző körülmények előállítására. Így például fontos lehet meggyőződni arról, hogy egy egyenáramú közbensőkör szűrőtekercse a névleges áramsűrűség közelében is lineáris marad mágneses szempontból, ugyanis a mágneses telítődés az áramköri elemek túlzott igénybevételéhez vezethet. Dolgozatunk egy olyan készüléket mutat be, amely képes impulzusüzemben előállítani a mérés elvégzéséhez szükséges feltételeket, anélkül, hogy túlterhelné a rendelkezésre álló kis teljesítményű hálózatot, vagy tápegységet. A mérés során kis átlagteljesítménnyel töltött kondenzátortelep egyszeri, vagy ismételt kisütésével hoztunk létre programozható nagyságú és időtartamú áramimpulzusokat. A tekercsfeszültség időbeni változásának ismeretében meghatároztuk a tekercsfluxus és a tekercsáram közötti összefüggést, amelyből kinyertük a nemlineáris tekercsek jellemzésére használt paramétereket, illetve becsültük a tekercsveszteségeket névleges üzemi körülmények között. A készülék vezérlésére és a mérési adatok gyűjtésére dsPIC30F6010a alapú fejlesztőrendszert használtunk. Az áramkör modellezését és szimulációját Matlab Simulink környezetben végeztük.",
  "keywords": [
    "Nemlineáris tekercs",
    "telítődés",
    "differenciális induktivitás",
    "áramimpulzus"
  ],
  "generated_keywords": [
    "tekercsfluxus",
    "impulzusüzemű mérés",
    "kondenzátortelep kisütés",
    "dsPIC30F6010a",
    "áramirányító",
    "mágneses telítődés",
    "tekercsveszteség",
    "Matlab Simulink modellezés"
  ]
},
{
  "major": "Hardverfejlesztések és beágyazott rendszerek",
  "year": 2024,
  "title": "Vasúti sín állapot diagnosztikai rendszer",
  "students": [
    {
      "name": "Vasi András",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Számítástechnika, 4. év"
    },
    {
      "name": "Csegezi-Balázs Csongor",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Szoftverfejlesztés MSc., 2. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Sándor Hunor",
      "university": "MES MOM Manager, Accenture"
    },
    {
      "name": "Dr. Szántó Zoltán",
      "university": "MES MOM Consultant/Spec, Accenture"
    }
  ],
  "content": "A vasút meghatározó részét képezi a közlekedésnek, mivel nagyon biztonságos, olcsó, környezetbarát és gyors közlekedési forma. A vasút karbantartása kiemelten fontos, mivel rengeteg meghibásodás forrása lehet a nem megfelelő sínállapot, amely nagy anyagi károkat okozhat vagy akár emberi életeket veszélyeztethet. A baleset megelőzéséhez kulcsfontosságú a rendszeres karbantartási művelet, még mielőtt azok túl súlyossá válnának a problémák. Dolgozatunkban bemutatunk egy általunk fejlesztett IoT mérő rendszert, mely a vasúti sínek állapotát hivatott felmérni és a hibáit detektálni. A rendszer több komponensből épül fel, fejlesztettünk hozzá hardvert és szoftvert egyaránt. Hardver részről terveztünk egy dedikált mérő dobozt, amely az adatok begyűjtéséért felelős, melyeket vezeték nélküli hálózaton továbbít egy mobil eszköznek. A mérődoboz saját tápellátással rendelkezik. A mobil eszköz felelős a mérődoboz vezérléséért, illetve az ettől érkező adatokat felcímkézi a szükséges információkkal, illetve GPS koordinátákat csatol ezekhez. Az adatokat feltölti a felhőbe. A felhőben az adatok tárolásra, majd feldolgozásra és legutóbb kiértékelésre kerülnek vizualizálva az eredményeket. A hibák kimutatása összetett algoritmusokat igényel, ugyanis az adatok gyakran zajosak, hiányosak és torzítottak lehetnek. A minél pontosabb hiba detektálás érdekében nagyon fontos a megfelelően magas mérési frekvencia is. A fejlesztés során folyamatosan teszteltük a komponenseket.",
  "keywords": [
    "vasút",
    "sín",
    "állapot",
    "mérőrendszer",
    "IoT",
    "mérés",
    "hiba diagnosztika",
    "szoftver",
    "hardver",
    "applikáció",
    "szenzor",
    "felhő",
    "adatgyűjtés",
    "teszt"
  ],
  "generated_keywords": [
    "vasúti karbantartás",
    "mérődoboz",
    "vezeték nélküli adatátvitel",
    "GPS alapú címkézés",
    "felhőalapú feldolgozás",
    "hibadetektáló algoritmus",
    "mérési frekvencia optimalizálás",
    "valós idejű adatvizualizáció"
  ]
},
{
  "major": "Hardverfejlesztések és beágyazott rendszerek",
  "year": 2024,
  "title": "Levegőminőség mérése és modellezése",
  "students": [
    {
      "name": "Portik Tamás",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Automatika és Alkalmazott Informatika, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Turós László-Zsolt",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "Ez a tanulmány egy új megközelítést mutat be a levegőminőség mérésére és modellezésére egy ESP8266-alapú mérőegység segítségével, amely SCD30 (CO2) és MQ7 (CO) szenzorokat használ. Az adatok valós időben kerülnek rögzítésre, majd MQTT protokollon keresztül továbbítódnak egy InfluxDB adatbázisba. Az ESPHome firmware leegyszerűsíti a konfigurációt és támogatja az MQTT protokollt. A hardveres rész egyedi tervezésű áramkört tartalmaz, amely biztosítja az MQ7 érzékelő fűtőelemének megbízható kapcsolását. A mért adatok alapján egy LSTM típusú neurális hálózatot képeztek ki a CO2 és CO koncentrációjának előrejelzésére. A rendszer hatékonynak bizonyult, bár a hosszú távú mérés során kalibrációs kihívások jelentkeztek, különösen a CO2 érzékelő esetén. Ennek megoldására egy új kalibrációs eljárást dolgoztak ki, mely figyelembe veszi az érzékelők közti eltéréseket. A rendszer bizonyította, hogy alkalmas lehet beltéri és kültéri levegőminőség-monitorozásra, figyelembe véve a hardveres korlátokat és kalibrációs igényeket.",
  "keywords": [
    "levegőminőség",
    "ESP8266",
    "SCD30",
    "MQ7",
    "MQTT",
    "InfluxDB",
    "ESPHome",
    "LSTM"
  ],
  "generated_keywords": [
    "szén-dioxid szenzor",
    "szén-monoxid szenzor",
    "gépi tanulás",
    "idősoros előrejelzés",
    "neurális hálózat",
    "kalibrációs eljárás",
    "mérőállomás tervezés",
    "adatgyűjtés IoT eszközzel",
    "beltéri/kültéri mérés"
  ]
},
{
  "major": "Hardverfejlesztések és beágyazott rendszerek",
  "year": 2024,
  "title": "Hálózati adatforgalom vizsgálata különböző terhelés mellett",
  "students": [
    {
      "name": "Peter-Tibor Erszeny",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Távközlés, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Hajdu Szabolcs",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "A dolgozat célja különböző hálózati topológiák kialakítása, amely segítségével megvizsgálható valós forgalom terhelés alatt különböző típusú és márkájú routerek átviteli sebessége és terhelési kapacitása. A vizsgálat során 100 Mbps-es és 1 Gbps-es sávszélességgel rendelkező ipari, otthoni és SOHO kategóriájú routerek kerültek tesztelésre: TP-Link ER6120, TP-Link WR941ND, Cisco 2800 Series és ASUS RT-N18U. A teszteléshez az Iperf és SourcesOnOff programokat használták, amelyek különböző adatforgalmakat szimulálnak, az utóbbi különféle eloszlási paraméterek alapján generál valósághű hálózati forgalmat. A mérések során az adatátviteli sebesség és a terhelés hatása lett elemezve több párhuzamosan csatlakozó számítógép segítségével, IP-címek és protokollok váltásával. A vizsgálat kiterjedt az ár-teljesítmény arány értékelésére is, különös figyelemmel az otthoni felhasználás szempontjaira. Az adatok hitelességét egységes hardver- és szoftverkörnyezet, valamint azonos kábelek és csatlakozók biztosították.",
  "keywords": [
    "Sávszélesség",
    "Router",
    "TCP-UDP",
    "Iperf",
    "SourceOnOff"
  ],
  "generated_keywords": [
    "hálózati forgalom",
    "terheléses tesztelés",
    "adatátviteli sebesség",
    "hálózati topológia",
    "SOHO router",
    "IP-cím váltás",
    "valósághű adatfolyam",
    "ár-teljesítmény arány"
  ]
},
{
  "major": "Hardverfejlesztések és beágyazott rendszerek",
  "year": 2024,
  "title": "Automata tekercselőgép tervezése és gyakorlati megvalósítása",
  "students": [
    {
      "name": "Nagy Péter-Ferencz",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Mechatronika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Dávid László",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "A korszerű gyártástechnológiában a tekercselőgépek nélkülözhetetlenek a villamos gépek, hálózati zavarszűrők, fojtótekercsek és áramkorlátozó előtétek gyártásánál. A pontos és egyenletes tekercselés érdekében elengedhetetlen a huzal feszítőerejének szabályozása, amelyet túl laza, túl feszes vagy keresztezett huzalok elkerülésére alkalmaznak. A dolgozat bemutatja egy léptetőmotorral vezérelt automata tekercselőgép tervezését és megvalósítását. A fordulatszám vezérlését inverterrel táplált állandó mágnesű szinkronmotor is biztosíthatja, amelyből a feszítőerő visszabecsülhető. Emellett korszerű megoldásként elektromágneses fék alkalmazása is lehetséges. A dolgozat célja a tekercselési folyamat hatékonyságának és megbízhatóságának javítása szabályozott feszítőerő és pontos mozgatás segítségével.",
  "keywords": [
    "tekercselőgép",
    "léptetőmotor",
    "feszítőerő",
    "szabályozás"
  ],
  "generated_keywords": [
    "automata tekercselés",
    "villamos gépgyártás",
    "szinkronmotor",
    "inverteres meghajtás",
    "elektromágneses fék",
    "huzalfeszítés",
    "gyártástechnológia automatizálása"
  ]
},
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2024,
  "title": "Felhőalapú távvezérlés és OPCUA integráció ipari robotoknál",
  "students": [
    {
      "name": "Keresztes Kristóf",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Mechatronika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Forgó Zoltán",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Gépészmérnöki"
    }
  ],
  "content": "A dolgozat célja egy távvezérlési alkalmazás fejlesztése Universal Robots™ ipari robotok számára. A fejlesztés során egy fizikai UR10e kollaboratív robotot és az URSim szimulációs környezetet használták. Az alkalmazás Flask szerverrel, grafikus felületen keresztül teszi lehetővé a robot távvezérlését, valamint az OPCUA alapú integráció révén egy Visual Components környezetben működő digitális ikerpárt is létrehoztak. A szoftvermodulokat Pythonban írták, a kommunikáció ZeroMQ keretrendszeren keresztül történik, a késleltetés minimalizálása érdekében. A Flask alkalmazást Microsoft Azure felhőszolgáltatásban futtatták, amelyen keresztül videófelügyeleti funkció is elérhető. A hangsúly az egyszerű, gyors és továbbfejleszthető megoldásokon volt.",
  "keywords": [
    "Universal Robots",
    "Python",
    "OPCUA",
    "Flask",
    "távvezérlés"
  ],
  "generated_keywords": [
    "felhőalapú robotirányítás",
    "UR10e digitális ikerpár",
    "Flask Azure integráció",
    "ZeroMQ kommunikáció",
    "ipari robot szimuláció",
    "Visual Components",
    "moduláris robotvezérlés"
  ]
},
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2024,
  "title": "StandApp",
  "students": [
    {
      "name": "Nágo Márk",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Informatika, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Jánosi-Rancz Katalin Tünde",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
    }
  ],
  "content": "A dolgozat célja egy olyan mobilalkalmazás, a StandApp létrehozása, amely elősegíti az emberek tájékozottságát, közösségi kapcsolódását és a társadalmi felelősségvállalást. Az alkalmazás központi gondolata, hogy a felhasználók könnyen elérhető formában információt kapjanak a környezetükről, eseményekről és lehetőségekről, ahol segíthetnek. A projekt célja nem csupán az információátadás, hanem az emberek motiválása, hogy aktívan részt vegyenek a közösség életében. Az alkalmazás Android és iOS platformokon is működik, és egyszerű, logikus kódalapra épül, amit egy erős szerveroldali háttér támogat. A rendszer célja a közösségi kapcsolatok erősítése, az együttműködés elősegítése, valamint egy társadalmilag érzékenyebb hozzáállás kialakítása a technológia segítségével.",
  "keywords": [
    "mobilalkalmazás",
    "közösségi felelősségvállalás",
    "tájékozottság",
    "Android",
    "iOS"
  ],
  "generated_keywords": [
    "StandApp platform",
    "digitális közösségi elköteleződés",
    "társadalmi érzékenyítés",
    "mobiltechnológia a változásért",
    "segítő szándék erősítése",
    "környezeti tájékoztatás",
    "együttműködés digitális eszközökkel"
  ]
},
{
  "major": "Informatika és szoftverfejlesztés",
  "year": 2024,
  "title": "Tábla játék regisztrálása videofelvételből",
  "students": [
    {
      "name": "Gáll Botond",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Automatika és Alkalmazott Informatika, 4. év"
    }
  ],
  "teachers": [
    {
      "name": "Dr. Lefkovits László",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Villamosmérnöki Tanszék"
    }
  ],
  "content": "A jelen dolgozatban létrehoztunk egy olyan rendszert, amely videofájl vagy élő felvétel képkockáit dolgozza fel. Egy videofájlból vagy élő felvételből a játék lefolyását követjük, feldolgozzuk, a lépések szabályszerűségét ellenőrizzük és regisztráljuk egy adatbázisba. Az első fázisban videojelből kialakítunk egy képsorozatot, amely a játékra jellemző álló a képeket tartalmazza, tehát amelyeken csak a táblán lévő zsetonok és a dobókockák tiszta állását (mozgó elemek nélkül) rögzítettük. Következik az egyedi képek kiválogatása és a játék állás elemzése. Ez az elemzés meghatározza a játéktábla 4 sarkát, és a zsetonok pozícióját a táblán. Ezekből az adatokból a koordináták feldolgozása után meg lehet határozni a játék állását. Minden álló képen megjelenő dobókocka helyzetét és a dobott számot szintén meghatározzuk. A program text állományba rögzíti a dobásokat és a megfelelő lépéseket.\nEzzel a módszerrel rögzíthetünk sok játszmát, amelyből a mesterséges intelligencia elsajátíthatja a játék szabályait és kialakítja a stratégiát.\nA képek feldolgozásához a Python programozási nyelvet és az OpenCV könyvtárat használtuk.",
  "keywords": [
    "backgammon",
    "képfeldolgozás",
    "OpenCV",
    "Python"
  ],
   "generated_keywords": []
},
{
  "major": "Számítástechnika",
  "year": 2024,
  "title": "\"MI\" a művész",
  "students": [
    {
      "name": "Babos Dávid",
      "major": "Sapientia EMTE, Marosvásárhelyi Kar, Számítástechnika, 3. év"
    }
  ],
  "teachers": [
    {
      "name": "Csaholczi Szabolcs",
      "university": "Sapientia EMTE, Marosvásárhelyi Kar, Matematika-Informatika Tanszék"
    },
    {
      "name": "Dr. Dávid László"
    }
  ],
  "content": "Már idők kezdete óta az embereket körbeveszi a művészet fogalma. Ez képes megnyilvánulni hang és kép formájában, mint például zene, festmények, rajzok, képek, filmek stb. Viszont a 2020-as években a kitörő mesterséges intelligencia a művészet megfoghatóságát egy teljesen új szintre emelte és olyan személyek számára is elérhetővé tette, akiknek nehezükre esik ecsetet ragadni.\nKutatásom célja, hogy bárki számára a lehető legközvetlenebbé tehessem a képek művészeti ábrázolását a mesterséges intelligencia felhasználásával. Ennek érdekében egy telefonos applikációt hozok létre, amit akárki a nap bármely pontjában ki tud húzni a zsebéből, hogy egy perc alatt olyan alkotásokat hozzon létre, mint Van Gogh. Majd az alkotás létrejötte után meg tudja osztani másokkal a művészet gyarapodása érdekében.\nAz új kép megalkotása iránt a Neural Style Transfer módszert alkalmazom, amely lehetővé teszi két kép összevonását. A két kép közül az elsődleges tartalmazza a mondanivalót amit a felhasználó megörökített, a második pedig a stílust, amely lehet egy híres festő alkotása, vagy egy letöltött kép az internetről, vagy akár egy festmény amit egyik ismerősünk csinált. Eredményként pedig egy olyan kép fog létrejönni amely a tartalmat megörzi viszont a stílusát teljesen átruházza a második képről.\nEzen képgenerálások nagyon nagy könnyedséggel parametizálhatóak, így teljes mértékben testre lehet szabni azt, hogy mi lesz az eredmény. Ezek mellett bármikor ki lehet bővíteni a stílusok tárházát vagy akár ezeket megosztani az ismerőseinkkel.\nA kutatásom látványos eredményekkel rendelkezik így megerősíti a továbbfejlesztési lehetőségeket.",
  "keywords": [
    "mesterséges intelligencia",
    "neuron hálózat",
    "konvolúciós réteg",
    "művészet",
    "applikáció",
    "közösségi média"
  ],
   "generated_keywords": []
}

]